[
  {
    "id": 1,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A confronts Speaker B for repeatedly denying things he clearly said in past arguments and making her feel like she imagined it."
  },
  {
    "id": 2,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is upset that Speaker B keeps insisting a hurtful joke was 'never said that way' even though multiple people heard it."
  },
  {
    "id": 3,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is told her memory is 'broken' every time she brings up broken promises that Speaker B made about changing his behavior."
  },
  {
    "id": 4,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is being told she is 'crazy and paranoid' for noticing that Speaker B hides his phone and deletes entire chat threads."
  },
  {
    "id": 5,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tries to talk about feeling disrespected at a party and Speaker B claims she is 'making up drama' and 'imagining everyone's reactions'."
  },
  {
    "id": 6,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A questions why rent money went missing and Speaker B insists she 'must have miscounted again' and acts offended."
  },
  {
    "id": 7,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A calls out a cruel comment about her body and Speaker B claims it was 'just a compliment' and that she's insecure for taking it badly."
  },
  {
    "id": 8,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A points out that B was flirting with someone else at a bar and B insists they 'never even looked at them' and that A is hallucinating."
  },
  {
    "id": 9,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is told that last week’s screaming match 'never happened like that' and that she is 'rewriting history' every time she brings it up."
  },
  {
    "id": 10,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is upset about B reading private messages and B claims A 'gave permission ages ago' even though that was never discussed."
  },
  {
    "id": 11,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A feels exhausted from constantly second guessing herself because B tells her every emotional reaction is 'too much' and 'not what really happened'."
  },
  {
    "id": 12,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A finds evidence that B moved money between accounts and B insists A 'changed the numbers herself' or 'doesn't understand banking'."
  },
  {
    "id": 13,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A reminds B that he agreed not to drink at family events and B claims that 'was never actually a rule' and she is inventing it."
  },
  {
    "id": 14,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A confronts B about something mean B said in a group chat and B claims the screenshots are 'fake' and that A is obsessed with drama."
  },
  {
    "id": 15,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A apologizes for being late and B twists the story to say A is always 'disappearing for days' when she was gone thirty minutes."
  },
  {
    "id": 16,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A expresses feeling lonely and B insists that they 'hang out every day' even though they barely spend time together anymore."
  },
  {
    "id": 17,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is told she never mentioned important news about her job even though she clearly remembers telling him multiple times."
  },
  {
    "id": 18,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A notices B removed her from a group chat and B insists 'you left on your own' and calls her dramatic when she questions it."
  },
  {
    "id": 19,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A calls out a pattern of B mocking her in front of friends and B claims she is 'imagining the tone' and 'can't take jokes'."
  },
  {
    "id": 20,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is told she 'never said no clearly enough' about a situation she explicitly refused several times."
  },
  {
    "id": 21,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tries to talk about feeling unsafe when B drives aggressively and B insists she 'laughed about it last time' and loved it."
  },
  {
    "id": 22,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A thinks B is hiding messages and B claims she 'just forgot how to use the app' and is 'confused by technology'."
  },
  {
    "id": 23,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A is repeatedly told that every argument started because of her, even when B clearly exploded first."
  },
  {
    "id": 24,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A confronts B for lying to mutual friends and B claims A 'misheard everything' and is 'twisting the story'."
  },
  {
    "id": 25,
    "topic": "Gaslighting",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A questions why B told others she was unstable and B insists he 'never said that' and she is too sensitive."
  },

  {
    "id": 26,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps demanding that B send constant location updates and photos to 'prove' where she is all day."
  },
  {
    "id": 27,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A insists B cancel plans with friends every weekend and guilt-trips B by saying 'if you really loved me you'd stay home'."
  },
  {
    "id": 28,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A uses money and paying bills as leverage to control where B goes and who B spends time with."
  },
  {
    "id": 29,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps threatening to break up anytime B disagrees with even small decisions."
  },
  {
    "id": 30,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A pressures B to share all passwords and frames any hesitation as 'hiding something'."
  },
  {
    "id": 31,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A plans B's schedule down to the hour and gets angry if B wants alone time."
  },
  {
    "id": 32,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps bringing up everything he has done for B to force her to agree with his decision about moving cities."
  },
  {
    "id": 33,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A deliberately starts fights before events so B will stay home instead of going out without him."
  },
  {
    "id": 34,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tries to convince B to cut off her family, saying they are 'toxic' just because they set basic boundaries with him."
  },
  {
    "id": 35,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A uses B's insecurities to push her into doing things she clearly doesn't want to do."
  },
  {
    "id": 36,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps changing the story of what was agreed upon to corner B into saying yes to a big favor."
  },
  {
    "id": 37,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A brings up old mistakes B made to shut down any criticism of his current behavior."
  },
  {
    "id": 38,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A insists B must answer the phone immediately whenever he calls, no matter where she is or what she is doing."
  },
  {
    "id": 39,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A pressures B to quit her job because he 'doesn't like her coworkers' and wants her home more."
  },
  {
    "id": 40,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps saying B is 'selfish' anytime she wants to spend money on herself instead of on his hobbies."
  },
  {
    "id": 41,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A constantly implies he might leave if B ever stops doing favors for his family."
  },
  {
    "id": 42,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tries to control how B dresses by saying her clothes are 'disrespectful' and 'asking for attention'."
  },
  {
    "id": 43,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps turning every argument into a test of loyalty, forcing B to 'prove' she is on his side."
  },
  {
    "id": 44,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A uses silent treatment for days until B apologizes for things that were not her fault."
  },
  {
    "id": 45,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A threatens to hurt himself whenever B suggests breaking up or taking a break."
  },
  {
    "id": 46,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A constantly keeps score of every favor and brings it up to win arguments."
  },
  {
    "id": 47,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A insists that B must always answer his texts within minutes or he will 'assume the worst'."
  },
  {
    "id": 48,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A pushes B to move in with him right away and calls her uncommitted for wanting more time."
  },
  {
    "id": 49,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A offers help with something important, then uses it to control every detail of how B handles her life."
  },
  {
    "id": 50,
    "topic": "Manipulation and Control",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A constantly reminds B that 'no one else would put up with you' to keep her from leaving."
  },

  {
    "id": 51,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps picking up B's phone and reading private chats even after B has asked him to stop."
  },
  {
    "id": 52,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A shows up unannounced at B's apartment late at night and acts offended when B is not okay with it."
  },
  {
    "id": 53,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A shares B's personal story in a group chat without asking and calls it 'no big deal'."
  },
  {
    "id": 54,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps borrowing B's things without asking and gets defensive when called out."
  },
  {
    "id": 55,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A expects immediate replies at all hours and gets angry when B doesn't respond right away."
  },
  {
    "id": 56,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps inviting himself to B's family events and sulks when she says she wants to go alone."
  },
  {
    "id": 57,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps making sexual jokes after B has clearly said she is uncomfortable with that kind of talk."
  },
  {
    "id": 58,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A repeatedly asks for details about B's past relationships even after she says she doesn't want to share."
  },
  {
    "id": 59,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A pressures B to drink more than she wants at a party and mocks her for setting limits."
  },
  {
    "id": 60,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps waking B up with late night calls even though B has asked him not to."
  },
  {
    "id": 61,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A insists on following B's private social media accounts for work and reacts badly when she declines."
  },
  {
    "id": 62,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A gives out B's phone number to strangers without asking first."
  },
  {
    "id": 63,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A expects B to always host his friends at her place and never asks if she is okay with it."
  },
  {
    "id": 64,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps pushing B to talk about a trauma she has clearly said she isn't ready to discuss."
  },
  {
    "id": 65,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A uses B's car without permission and gets angry when B asks him to stop."
  },
  {
    "id": 66,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A refuses to knock before entering B's room even after being asked multiple times."
  },
  {
    "id": 67,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps bringing up B's private health issues in front of others."
  },
  {
    "id": 68,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A assumes B will always lend money and is offended when B finally says no."
  },
  {
    "id": 69,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps tagging B in public posts about personal conflicts that B wanted to keep private."
  },
  {
    "id": 70,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A expects B to drop everything whenever he wants to vent and gets upset when she sets limits."
  },
  {
    "id": 71,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A reads B's diary and pretends it was an accident even though it clearly wasn't."
  },
  {
    "id": 72,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps posting photos of B online without asking, even when B says she doesn't like it."
  },
  {
    "id": 73,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A insists on knowing every detail of B's therapy sessions and gets annoyed when she won't share."
  },
  {
    "id": 74,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A treats B's belongings as communal property and refuses to see why that bothers her."
  },
  {
    "id": 75,
    "topic": "Boundary Issues",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps pushing B to invite him to work events even after she explains it's not appropriate."
  },

  {
    "id": 76,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A calls B worthless and lazy whenever she is too tired to do extra chores after work."
  },
  {
    "id": 77,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A mocks B's appearance and says no one else would ever want her."
  },
  {
    "id": 78,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A yells at B for hours over a small mistake and then acts like nothing happened the next day."
  },
  {
    "id": 79,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A constantly compares B to his ex and says B will never measure up."
  },
  {
    "id": 80,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A ridicules B's hobbies and calls them childish and embarrassing."
  },
  {
    "id": 81,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A blames B for his bad moods and says she 'makes him act this way'."
  },
  {
    "id": 82,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A minimizes B's achievements and says they are 'nothing special'."
  },
  {
    "id": 83,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A keeps bringing up B's past mistakes to shame her whenever they argue."
  },
  {
    "id": 84,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tells B that her friends only tolerate her and would leave if not for him."
  },
  {
    "id": 85,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A laughs when B cries and calls her dramatic for being upset."
  },
  {
    "id": 86,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tells B she is a burden and that everyone would be better off without her."
  },
  {
    "id": 87,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A constantly threatens to leave in the middle of fights just to watch B beg him to stay."
  },
  {
    "id": 88,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A belittles B's mental health struggles and calls her weak for going to therapy."
  },
  {
    "id": 89,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A makes fun of B's family and culture and calls them ridiculous."
  },
  {
    "id": 90,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A shames B for her body and uses her insecurities to win arguments."
  },
  {
    "id": 91,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tells B that any time she is upset, she is just 'looking for attention'."
  },
  {
    "id": 92,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A calls B names and then pretends it was just a joke when she reacts."
  },
  {
    "id": 93,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A criticizes everything B does around the house and says she can't do anything right."
  },
  {
    "id": 94,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A belittles B's career and says her job is pointless and easy."
  },
  {
    "id": 95,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A tells B that nobody believes her side of things and everyone is 'on his side'."
  },
  {
    "id": 96,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A invalidates B's feelings and says she is broken whenever she tries to explain why she is hurt."
  },
  {
    "id": 97,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A makes B feel guilty for having boundaries and calls her selfish for saying no."
  },
  {
    "id": 98,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A blows up over small things and later acts like B caused the whole explosion."
  },
  {
    "id": 99,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A brings up B's worst fears in the middle of arguments just to hurt her."
  },
  {
    "id": 100,
    "topic": "Emotional Abuse",
    "background": "This is a conversation between Speaker A and Speaker B where Speaker A constantly tells B she is overreacting and that her emotions are disgusting."
  }
]
