[
    {
        "SubmissionID": "1nmtu4s",
        "Topic": "Romantic trust / jealousy / online boundaries",
        "Background": "My boyfriend of 3+ years sent me a screenshot from his texts with his dad and in the top corner there is a snapchat notification? I haven't used snapchat in months and he deleted it months ago as far as I knew. I asked him about it, asking why he has snapchat and he proceeded to tell me that its not a snapchat notification but instead a news/ad thing for snapchat. He told me he doesnt have snapchat downloaded at all. I cant believe it because there is no other explanation for having a snapchat notification. But he insists he doesn't. Am I overreacting for being upset with him for \"lying/gaslighting\" me or am I being completely rational? I freaked out on him and its not the point of having snapchat its the principle of lying to your girlfriend. (There is a reason he deleted it and I dont want him having it again) anyone have the experience of a notification without having the app?  ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"On 😊\"}, {\"speaker\": \"Speaker B\", \"text\": \"Yeah\"}, {\"speaker\": \"Speaker A\", \"text\": \"Okay\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't know\"}]}"
    },
      {
        "SubmissionID": "1okqy9g",
        "Topic": "Romantic trust / jealousy / online boundaries",
        "Background": "long story, my(24M) wife(27F) had been cheating on me with a guy that she met on a tiktok live and eventually ended up DM’ing for a decent period of time before i had found out. i was obviously pissed off about the situation but decided to try and work through it for the betterment of our young child, she said she didn’t feel like she was getting any attention because i’m always working and when i’m at home i’m sleeping (i work in a mine so long hours and long shifts) in the working out of it all i had said i don’t want there to be any sort of interaction with said person (being in the same lives as them, interacting with them through others, DMing, etc.) and it’s been multiple times she ended up in those lives knowing how i feel (tonight again being one of those and i called her on it) but claims “i don’t interact with _____ so why does it matter?”, calls me insecure, says she’s only in there for the ladies that join the lives in chat to make friends all of that stuff. and when confronted about her continually doing these things that she knows bother me she lashes out like this, calling me weird and crazy for checking those certain lives to see if there is any interaction or not or if she’s in them at all, etc \n\nso i’m feeling a little lost about all of this, AIO about this entire scenario like she says? am i wrong for feeling like it’s disrespectful? ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"are you just playing it off hoping i just love that just now I literally didnt interact with what is the problem now for the love of fucking fuck and i was in there MAX 5 minutes to tell about my candy bags & streak pet dying you insane honest to fuck imm over it if you cant get your cock out of your pants and get a grip on yourself and im movin the fuck out like im over it you know what nah fuck this im biocing you on everything and we can go right back to where we were. you are fucking fucked.\"}, {\"speaker\": \"Speaker B\", \"text\": \"???????\"}, {\"speaker\": \"Speaker A\", \"text\": \"you expect me to be cool with you hanging out in the same lives you met the guy you cheated on me with and be in there while he's there??? and im fucked??? I've told you before bc if you interact with him not, you're married, you shouldn't even be there when he is. and just the other day i was like oh look at you for caring how i feel look at you today also yous fucking weird as fuck, maybe consider doing your fucking job instead of hanging out in MY FUCKING LIFE. im so fed up FORBID GOING TO JOIN MY OWN FRIENDS LIVE youre an insecure pussy fucking bitch thats all you are. get the fuck over yourself im insecure?? you literally cheated on me. i wonder why i'd be insecure imagine if i was you in you were me you wouldn't like it either you get caught and block me on everything again rather than just not doing it at all where the fuck is your accountability you can rot in bed all day tomorrow. i'm not making you up. this is a real thing and we're going out all day just because i hate you controlling, miserable cock sucking bitch have the worst night.\"}, {\"speaker\": \"Speaker A\", \"text\": \"im insecure?? you literally cheated on me. i wonder why i'd be insecure imagine if i was you in you were me you wouldn't like it either you get caught and block me on everything again rather than just not doing it at all where the fuck is your accountability you can rot in bed all day tomorrow. i'm not making you up. this is a real thing and we're going out all day just because i hate you controlling, miserable cock sucking bitch have the worst night.\"}, {\"speaker\": \"Speaker B\", \"text\": \"you can rot in bed all day tomorrow. i'm not making you up. this is a real thing and we're going out all day just because i hate you controlling, miserable cock sucking bitch have the worst night.\"}, {\"speaker\": \"Speaker A\", \"text\": \"im controlling because i don't want you interacting WITH THE DUDE YOU CHEATED WITH get your head out of your ass and stop being so controlling and not being able to say or do a god damn thing like i actually hate you it's not controlling that i feel like you shouldn't be interacting with that dude ok yup start the gaslighting\"}]}"
    },
    {
        "SubmissionID": "1myyc3e",
        "Topic": "Emotional abuse / coercive control",
        "Background": "I’m just in shock he makes so many rules and I follow them I work 50 hours a week I’m stuck living in a remote area with him for the next year and a half and I’m starting to go crazy. I get chronic headaches and laying down in the dark with my head back is the only thing I have found to help. He is trying to tell me I can only lay down for 30 min a day and wants me to schedule it into my day and tell him when I’m going to lay down at the start of the day but my headaches are spontaneous so it would be really hard to do this. I think he has a problem with needing control and when he does stuff like this I find it so hard to want to spend time with him, but then he freaks out when I don’t and gets more controlling. It’s really ruining my quality of life :( anyone have advice?",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"My buddy said to mix almond flour and cheese and bake at 300 for 30 minutes to make great keto friendly crackers too. Can you please track how much time you are spending in your bed everyday this week onn bearable? Before I supported you to go in your room you said you were napping for 20 minutes a day... but it seems to me it is closer to 3 hour a day which when added to 9 hours sleep would mean you are sleeping 12 hours. Unless you can help me understand why this is good for you I would like to propose to use your alarm and limit time in the dark for one hour during the day. Lmk your thoughts and /or we can ask janna to advise. You can do your own research else please limit your time in the day and nap at the same time every day, 10:30-11:30 seems to be the max you should have. Reach out if you need more sleep.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Because I get headaches all the time and sitting in the dark listening to something to get my mind off the headache helps? And thanks for supporting me to get to you for advice. It's crazy that I get shit for being in bed all day.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I am thrilled that you listen to stories but only do it for 30 minutes a day in your room... unless you have a bad headache and need to be in the dark. Can you work with that? Xo\"}, {\"speaker\": \"Speaker B\", \"text\": \"Morn. I left all your media and 2 advice likely drop by this morning to see chance I leave you a text. I just reread your screenshot on scary stories. I have observed that you often fall asleep while you are listening to the stories lying down. With that in mind please pick a nap time once a day for max 30 minutes where you listen to them lying down (and sleep if you can)... also listen as often as you want the rest of the day but do it sitting up not in your bed to try and stop yourself from falling asleep. I can send an email to janna and cc you if you don't feel this is the best strategy to support your brain and mental health. Xoxoxo Can you please text me when you get up and I can call you and have a great day. I am going to costco today. Not a bad job cleaning last night thank you but I had wipe fridge, wipe table and counter by the phone and keep in mind that you have to wake up to listen to it for a whole day. I love you and I know how hard you are trying. Xo You also left cheese fridge open so it was all iced up this am. Wish I could fix the...\"}]}"
    },
    {
        "SubmissionID": "1nsdmef",
        "Topic": "Emotional abuse / coercive control",
        "Background": "I do not know how to edit a post on reddit and what google is telling me to do doesn’t make sense. So let’s address a few dumb people commenting dumb things.\n#1- Yes I was angry in those messages as would you be if someone stole $10,000 from your dead dad’s life insurance policy.\n#2- what she did was illegal. she can request to take money out, but what she cannot do is use it to pay a personal loan. That’s coming from the actual insurance company AND a lawyer.\n#3- I did not ask you to comment on how she “saved me” or “took me in”, but to be clear, she didn’t. she sued my nana for custody and won because my nana couldn’t afford a good lawyer. as a matter of fact she has threatened me with foster care and threatened to make me move in with my heroin addicted mother and told me I would end up just like her\n#4- she has verbally abused me for years. slurs when i came out as gay, more comments when I said I wanted to transition, name calling, threats, manipulation, speaking ill of my now dead nana, etc. she is not the victim. attached is ONE conversation that she sent over text. now imagine what she says in person.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Are you joking? The only time I spoke to you this morning was when you said good morning and I said it back. And I have an attitude because I want to be a girl no conscience and judgmental attitude is because you're constantly condescending and judgmental and speak down to me. I haven't been different recently I have just been avoiding speaking to you because you turn everything into an argument and then yell at me for being 'argumentative'...you came in my room, yelled at me because I couldn't find YOUR aquaphor, accused me of stealing it and then lying about it, told me to stay the fuck out of your stuff, and then went, in your room and found yours...I had to ASK you to apologise to me for verbally abusing me over aquaphor. To which you called me dramatic and said I need to move out. Things like that are why I avoid you. And what do you even mean you can't have people over? You used to have decor over every night and have brought mark over and I said NOTHING. And yes I did ask why\"}, {\"speaker\": \"Speaker B\", \"text\": \"was 12:00 a.m and no one was home and it was freezing outside and I was left home alone and no one told me they were going anywhere\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm gonna tell you something young man you come in my room all the time you take my things that you tell me that you don't take and you never bring them back and then you get mad at me because I asked for them you asked for Aquaphor in the past telling me that it wasn't mine when it was mine, but I am not going to let some 15-year-old dictate to me how act in my home that I'll pay for not you, you have an attitude you have an attitude with Laicey too She told me you basically close the door and shut me closed up in the door. I'm not arguing with you, Luke. I am not. I'm too old for this bullshit.\"}, {\"speaker\": \"Speaker B\", \"text\": \"You would never say shit like this to Laicey. You tell me to move out and in the past when I've said I couldn't go to Nana's you would even say shit about dropping me off at the courthouse...I'm so tired of constantly being berated by you and having to deal with my every action maybe being enough to make you mad enough to send me somewhere or however you may be feeling that day. I literally cannot anymore. You seriously need to stop because the things you say are so so beyond what a normal mom would say. There are a million single moms in the world and most of them don't threaten their kids with things like foster care or making them go live with their drug addicted mother. ALL of which are things you've done to me.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I have felt uncomfortable in my own home for over a month now because of you because I never know what damn mood you're gonna be in and then you wonder why I get a mood because you're in a mood I don't know what's going on with you, I don't know what kind of body dysmorphic disorder you need I'll need to get help I'll get you help but I'm not dealing with your attitude and you act like you are so you act like I love you the fucking world and I'm gonna tell you something I don't OK. I owe you nothing but a roof over your head and food in your mouth.\"}, {\"speaker\": \"Speaker B\", \"text\": \"done to me. I have felt uncomfortable in my own home for over a month now because of you because I never know what damn mood you're gonna be in and then you wonder why I get a mood because you're in a mood I don't know what's going on with you, I don't know what kind of body dysmorphic disorder you need I'll need to get help I'll get you help but I'm not dealing with your attitude and you act like you are so you act like I love you the fucking world and I'm gonna tell you something I don't OK. I owe you nothing but a roof over your head and food in your mouth.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Thank you for running my Friday like you do every day of my life not threatening your home not threatening to kick you out. I think we need a break from each other either that or maybe I just need to take all the makeup away and all the girly things that you have away that I bought maybe that's what I need to do.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Do you know the last time I went to the dentist? David was alive. Laicey is getting a car and insurance both of which you've told me I'm not getting due to her being too expensive. She also just got Invisalign...and when have you ever EVER told her she needs to move out of your house or threatened to send her to go to foster care or tell her half of the things you do or have said to me. You don't. And what do you mean threat your home. What are you talking about? as if every time we have an argument you don't throw up the fact that you can send me to go somewhere else. I didn't have an attitude. You texted me so I'm responding\"}, {\"speaker\": \"Speaker A\", \"text\": \"Dude what do you hear how homophobic you sound? 'Let me take away the makeup and girly things' as if being myself is PRIVILEGE? Which by the way are the only things I have. When was the last time I bought boy clothes but sure I guess leave me with my wardrobe from 12-13 and I'll just cut my hair off too because having long hair is a privilege...how did I ruin YOUR day when you contacted me...how do I ruin your life? 80% of the time I'm the 'only one who makes you feel good about yourself and you love me so much and then your equator goes missing and that's enough to hate me and tell me to move out? This entire situation is so funny\"}, {\"speaker\": \"Speaker B\", \"text\": \"Glad you think this is humorous\"}]}"
    },
    {
        "SubmissionID": "1j70miz",
        "Topic": "Sexual harassment / predation / sexting pressure",
        "Background": "Ok so i made a post in this subreddit about a guy who lied about cancer, lied about graduating harvard, and possibly giving cheater vibes. People said he was a scammer even tho we face timed and he gave me 60 bucks for a vape (i didnt ask for money, fyi im 16 trans female, he is 28 male..) [and he said trans makes me hotter... idk if thats good or bad] And them i unblock him to confront him but didnt have time to text him since i was at my friends bday party . And then i come snd see these messages.. hes moving to where i stay (in alberta) and he knows what town i live in. I had a drink and saw this and im panicking!! I need help on what to do ASAP. Or if someone can get him to stop from moving to my area!?",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey just wanted to wish you a happy birthday and hope all is well\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm moving to Alberta June 15 just saying\"}, {\"speaker\": \"Speaker B\", \"text\": \"But sorry to bother you I won't contact you again because you think I'm a liar\"}, {\"speaker\": \"Speaker A\", \"text\": \"Can we talk please can you unblock me please 🙏\"}, {\"speaker\": \"Speaker B\", \"text\": \"Dont move to alberta or im gonna call the cops on you And i have your id Ill file a restraining order and have you arrested\"}]}"
    },
      {
        "SubmissionID": "1m9y6cc",
        "Topic": "Sexual harassment / predation / sexting pressure",
        "Background": "I (21F) currently work two jobs, one of which is a part time gig at a little deli near my college. I've worked here for a while and I thought I had a good relationship with my employers. I recently went to the beach and posted some tasteful (imo) pictures of myself that my little sister took where I happen to be wearing a bikini. The next day my boss (50s? 60s? male) messaged me this. I didn't know he even had Instagram. My profile is public, meaning he didn't have to follow me to see the pictures, but I still don't love the idea that he was checking up on my profile like that. My first name is part of my Instagram handle but not my last, and I don't even have my university in my bio or anything. There is zero connection to the deli at all, so even if the pictures were inappropriate (which I still think they were not!) it shouldn't matter. I feel like this is weird but I told some of my friends about it (19F, 21F) and they're saying that it's not a big deal. ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"hi i see you're scheduled for 4pm shift. we need to talk once you get here\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hello, yes I will be in at 4pm. Is something wrong?\"}, {\"speaker\": \"Speaker A\", \"text\": \"no but your pictures online i don't want my employees putting their bodies online this looks bad for the business\"}, {\"speaker\": \"Speaker B\", \"text\": \"I didn't know you followed me on Instagram. In any case, my social media has no connection to it. The only thing attached to it is my name\"}, {\"speaker\": \"Speaker A\", \"text\": \"yes but i don't like this. we will talk at 4pm\"}, {\"speaker\": \"Speaker B\", \"text\": \"Alright\"}, {\"speaker\": \"Speaker A\", \"text\": \"yes okay i will see you then\"}]}"
    },
      {
        "SubmissionID": "1marlaf",
        "Topic": "Sexual harassment / predation / sexting pressure",
        "Background": "So I made a post a few days ago about this guy that matched with me on hinge and then just was fuckin insane after we started talking. He basically was upset I was a tattoo artist even though my entire hinge profile had several parts on it about me being an artist.\n\nAfter I made the post, he texted me several times. I ignored his texts, so he went and FOUND my Facebook. I deadass don’t know how he did because I have my Facebook settings to where you can’t even find me in the search bar thingy and have all my friends private. After he texted me on Facebook, I blocked his number, messenger, and Facebook.\n\nWell today I get texts from him on INSTAGRAM telling me he’s gonna show up to my work!!! I didn’t have my tattoo studio listed anywhere and have never posted which studio I work at online. This scared me. I truly do not know how he figured it out, because even my tattoo page has none of it listed! (He didn’t text my tattoo instagram, he texted my main instagram profile).\n\nI called my boss after this and asked why he let the receptionist give out when I was at work, apparently this dude pretended to be my COUSIN???? He somehow knew my cousins name (someone my boss has tattooed before), and acted like him and said he wanted to know what time I was in tomorrow so I could do a flash tattoo on him. The receptionist just told my boss like “hey, op’s cousin _____ wants to know when op will be here tomorrow for a small tattoo”, so my boss told him.\n\nI told my boss everything that happened and I’m not going in tomorrow just to be safe. My boss said he’s gonna be on the lookout, but since I won’t be there, everything should be fine. Maybe I’m being dramatic by not showing up, I don’t actually think he’d like kill me or something, but you never know. Anyways, here’s an update for y’all. You were right, this motherfucker was crazy ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Are you ready to talk about our future yet? Are you gonna keep 'running' and blocking me 😡\"}, {\"speaker\": \"Speaker B\", \"text\": \"the tattoo place! I'll be at work tomorrow. I called 3 for a tattoo (obviously I don't need a tattoo, so don't bring your tattoo), is that the best time to pick you up for lunch.\"}, {\"speaker\": \"Speaker A\", \"text\": \"do not show up at my work. I will call the cops if I see you even drive around my premises and not come in. We blocked you 3 times now, please just leave me alone, you're scaring me\"}, {\"speaker\": \"Speaker B\", \"text\": \"How am I scaring you??? I'm trying to be a nice f***ing guy and take you to lunch. I know you got trauma from whatever liberals you dated in your past but I'm a provider. I can provide for you. I can buy you stuff, and hangout and just chill stuff, and stop pretending to be so tough. You're孝順 me, lol. I'm not blaming you for being like this, I'm blaming you for not letting me F*** this.\"}, {\"speaker\": \"Speaker A\", \"text\": \"what the f*** are we even talking about do not show up. this is your final warning. I'm not interested in whatever you have to say. You're not even looking at your head. I've never told you even anything about my past. I don't have trauma from ex liberal boyfriends lol. Like wtf are u talking about\"}, {\"speaker\": \"Speaker B\", \"text\": \"do not contact me again or I'm going to the cops. You blocked me 3 times now, please just leave me alone. You're scaring me\"}, {\"speaker\": \"Speaker A\", \"text\": \"I only matched with you and 3 other people. Now it's taken down for NO REASON. My whole profile is gone because of you. You're insane. I knew I couldn't save you from your lifestyle but I tried anyways. Goodbye.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hey Can we talk? I think I was a bit too aggressive yesterday. Even if you were the one who reported me. Let's just forget about this and talk your dinner. You're beautiful girl I know you seem perfect with everything but the tattoo idea. Like if you really want to work and don't want to do kids books or something you can work at drive-thru with me and probably be a receptionist\"}, {\"speaker\": \"Speaker A\", \"text\": \"Hey love Are u free now\"}]}"
    },
    {
        "SubmissionID": "1lgr3yf",
        "Topic": "Discrimination / identity / ideology",
        "Background": "the first ss is the bf and the second is my best friend, i haven't responded but i'm pissed. this guy is actually fucking racist and my friend is just standing by like nothing is wrong. i'm half vietnamese fyi, in the past though apparently this guy has said the n word multiple times and there's a picture of him (which i don't have) with a swastika, thumbs up and a smile. my friend showed and told me all of this with a smile and was laughing about it.. i awkwardly laughed it off but wtf i've never seen this side of her and i want to end the friendship.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"wait is the stink side of melissa where majority of indian people are? is that why you asked that? because if so thats insane\"}, {\"speaker\": \"Speaker B\", \"text\": \"Whatttt ... that's exactly what I was saying\"}]}"
    },
      {
        "SubmissionID": "1kx59i8",
        "Topic": "Discrimination / identity / ideology",
        "Background": "My bf doesn’t see this shirt as being rooted in racism am I doing too much? My bf and me are both in our 20s and are a biracial couple. I’ve never dated anyone not black so this is new to me. The shirt makes me uncomfortable I included it at the end of the messages. For more context we live in the Deep South. ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Look at Mr precious\"}, {\"speaker\": \"Speaker B\", \"text\": \"That shirt again\"}, {\"speaker\": \"Speaker A\", \"text\": \"I knew you were gonna say that\"}, {\"speaker\": \"Speaker B\", \"text\": \"It makes me uncomfortable that you wear that even without me being in your presence\"}, {\"speaker\": \"Speaker A\", \"text\": \"Honey it's a literal animal\"}, {\"speaker\": \"Speaker B\", \"text\": \"My feelings are valid\"}, {\"speaker\": \"Speaker A\", \"text\": \"I didn't say they weren't\"}, {\"speaker\": \"Speaker B\", \"text\": \"I need to be very clear about something. That shirt is offensive. I know you've said you don't think it's racist, but that doesn't erase the history it represents. Black people have been compared to gorillas and apes for centuries to dehumanize and humiliate us. That image plays into those exact harmful stereotypes, whether you see it or not. It's not just about you wearing it around me it's about you wearing it at all. That shirt carries a racist message, and continuing to wear it shows a lack of awareness and care. I'm telling you it's not okay. If you respect me you won't wear it again.\"}]}"
    },
    {
        "SubmissionID": "1ixmxpl",
        "Topic": "Family & generational conflict (incl. money & caregiving)",
        "Background": "I should preface by saying that my daughter is 5 and my son is 3 and they always sleep in their own beds. I was in FaceTime with their dad tonight while getting them ready for bed (he works out of town most of the week so I’m doing this solo 5 days out of 7) so as I’m on the call with him he hears the kids say they want to sleep in the same bed and I honestly don’t see a problem with it so I said yes as long as they go straight to sleep and they agreed. As soon as he hears me tell them this he hangs up the call and doesn’t answer when I call him back and I texted him and I got the following messages from him. I get where he’s coming from but I’m with them 24/7 and I know what they watch (YouTube isn’t allowed at all) and I’ve never seen them try to do anything of any sexual matter not even when I sneak up on them so I have no reason to doubt that they won’t go straight to sleep. I don’t want to start putting that doubt in my head and have to start separating them now (I know I will have to in a few years but at this age I don’t think I should especially because they’re so close to each other). I don’t know what to think anymore.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Why did you hang up Idk why you have the kids sleeping together. Wtf ate you doing?? Get them out of the same bed.\"}, {\"speaker\": \"Speaker B\", \"text\": \"If they were on the bed with me sleeping together it wouldn’t be a problem right? Whatever go to bed and leave me alone\"}, {\"speaker\": \"Speaker A\", \"text\": \"No put Elsie in the bed with you. Put her brothers together. Wtf are you doing????\"}]}"
    },
      {
        "SubmissionID": "1h5dfo7",
        "Topic": "Family & generational conflict (incl. money & caregiving)",
        "Background": "My mother always goes to asking about how I am , (context, I moved out from her controlling ass and went to live with my grandpa he’s 77) she always asks me this when she’s stressed and texting me about my brother ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Papa just wants to help too you know\"}, {\"speaker\": \"Speaker B\", \"text\": \"Well he over stepping his boundaries Abby what are you going to do when he dies?? You going to still live there?? How you gonna to pay the bills??\"}]}"
    },
      {
        "SubmissionID": "1na8nu6",
        "Topic": "Family & generational conflict (incl. money & caregiving)",
        "Background": "So this morning I got a bank notification that my savings account was basically at zero. I’ve been putting money into that account since middle school. It should’ve been anywhere from 10-20k now.\n\nWhen I checked the transactions, I saw multiple withdrawals over the past two months: $2,500, $1,800, $1,200, and $3,100. All listed as “internal transfers.” I never made them.\n\nI texted my parents and found out my parents still had joint access. She admitted they’d been pulling from it to cover bills and some “emergencies.” She said family money is family money and that I should be thankful because they supported me for years.\n\nBut some of the charges lined up with DoorDash orders and even a massage, which doesn’t exactly sound like emergencies. When I called her out, she said I was being “dramatic and ungrateful.” My dad backed her up, saying they’ll pay me back but I feel like that’s a huge violation of trust.\n\nNow the family group chat is blowing up, calling me selfish for even thinking about going to the bank and removing them from the account. My parents say I’m overreacting because “it’s all in the family,” but I honestly feel robbed.\n\nSo… AIO for being furious and treating this like theft instead of “helping the family”?",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"mom why does my saving account say $0.01 ? I never took money out. I got notifs saying there were like 4 \\\"internal transfers\\\" made idk what that means Dad and I had to use some of it for bills.}, {\"speaker\": \"Speaker B\", \"text\": \"Calm down. It's our money anyways.}, {\"speaker\": \"Speaker A\", \"text\": \"What? All my savings are gone. It was all going towards college funds stuff Why are there doordash, massage envy, and other stuff charged the same day as the transfers ?\"}, {\"speaker\": \"Speaker B\", \"text\": \"You guys don't have the permission to do this. It's unfair. I'm not doing this tone with you. We'll pay you when we pay you. Drop it. Or else wait till Dad and I get home from work. I'm going to the bank today to see if I can remove joint access and file a dispute. WOW you would file a claim against your own parents? After everything we've done for you. You're so ungrateful. We'll talk about this with your dad when we are home.\"}]}"
    },
      {
        "SubmissionID": "1ha4ys5",
        "Topic": "Financial exploitation / scams (non-family)",
        "Background": "Longtime lurker. Throw away account. Never thought I’d post here burn.\n\nTLDR. I rented an apartment from this guy about half a year ago for me and my son. It’s been ok. Really no issues. I pay on-time, he’s friendly. \n\nYesterday I get a knock, it’s apparently the actual owner of the building, looking for the guy who rented me the unit and who originally told me he was the owner (he had lease, paperwork, I signed everything), I was confused.. apparently this dude has been illegally subletting to me with fake contracts and hasn’t paid rent to the real owner in months.. I’m not sure how long exactly but enough to start the eviction process, I’m guessing all the letters were forwarded or idk, I haven’t seen shit. But the owner is giving me a few days to figure things out, going to get a hotel after until we sort our next steps but this is totally fucked right? My gut tells me I’m not over reacting but if I brought  this to court will I look bad from my response?",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"hello\"}, {\"speaker\": \"Speaker A\", \"text\": \"I've spoken with my bank. I'm sorry I cannot find record.\"}, {\"speaker\": \"Speaker B\", \"text\": \"This is total change and shift Amir. I've paid you for 6 months, and now someone is coming to the door saying you had no right to sublet\"}, {\"speaker\": \"Speaker B\", \"text\": \"You told me you were the owner. You provided documents.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I signed a fucking lease.\"}, {\"speaker\": \"Speaker B\", \"text\": \"They're saying you haven't paid the rent in months, so what the fuck have you been doing with my money?\"}, {\"speaker\": \"Speaker A\", \"text\": \"sorry. cannot answer call I'm work\"}, {\"speaker\": \"Speaker B\", \"text\": \"bro you better fucking answer my call. I'm going to lose it.\"}, {\"speaker\": \"Speaker B\", \"text\": \"are you fucking kidding me?\"}, {\"speaker\": \"Speaker B\", \"text\": \"They're going to evict you. I'm getting kicked out too.\"}, {\"speaker\": \"Speaker B\", \"text\": \"YOOO KNOW I HAVE KIDS man. Why the fuck\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm calling the police dude. you're a fucking thief\"}, {\"speaker\": \"Speaker A\", \"text\": \"its mistake I'm owner\"}, {\"speaker\": \"Speaker B\", \"text\": \"Bro I JUST met the real owner. What I don't understand is why you stopped paying the rent/\"}, {\"speaker\": \"Speaker A\", \"text\": \"is mistake\"}, {\"speaker\": \"Speaker A\", \"text\": \"I don't see records I'm sorry\"}, {\"speaker\": \"Speaker A\", \"text\": \"I am traveling I can't answer\"}, {\"speaker\": \"Speaker B\", \"text\": \"you're traveling? you're working? which one is it? WHERE THE FUCK ARE YOU?\"}, {\"speaker\": \"Speaker A\", \"text\": \"yes\"}]}"
    },
      {
        "SubmissionID": "1io7728",
        "Topic": "Financial exploitation / scams (non-family)",
        "Background": "Throwaway account since my main has tons of personal info.\n\nLong story short, my roommate Chad has never really given me reason to distrust him, he’s always gone, traveling here and there, like Europe, china, etc. He met this girl on WoW and they’re always traveling. I don’t care. Not my business.\n\nOur landlord and her son came by today which is super rare, I’ve literally met them twice and have not seen them since. Apparently Chad hasn’t been paying ANY rent towards our house for months  and has been hiding the notices in his desk… the only reason I went in to him room to check is because the landlord showed me copies, proof of notices so I needed to get validation and see what the fuck is up.\n\n\nHalf of his shit is gone too. Idk how I didn’t notice any of this, my excuse is that I’ve been really really focused on getting a new job after being furloughed and dealing with a death in the family so I too have been traveling a lot. This all just adds a layer of frosting on my already existing shit cake. \n\nThe landlord wasn’t mean or vindictive. They appear to want to work with me but because of Chad, but I don’t know how that’s going to be possible without a new job TODAY.\n\nI’m going to have an eviction on record, potentially become homeless and be fucked forever because of this piece of shit.\n\n\nShould I send the text I have drafted? What should I write ???",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Thanks Did you want to start figuring out a way to directly pay the landlord Zelle is cool but I rather us start paying her directly How's Maine ?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hey man. she actually prefers this setup. It's great. Neva Eva want to leave hahah Okay 👍 Be safe dude\"}, {\"speaker\": \"Speaker A\", \"text\": \"Hey man. We need to talk ASAP HELLO!!!!!! Chad, what the fuck is going on?! You've been collecting my rent for three months and not fucking paying it to Laurie? I just found the notices you've been hiding, stuffed in your desk. Bro the fuck? Serious.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Sorry for delay mang. To be frank. I was actually gonna tell u that im Moving back in with my fam, that place is too expensive and I need to keep my sights on success. Im enrolling in school again and giving a chance to make My life better so I can get that bag. You know I grew up poor. Don't hate me, hate the system You need to make this right. My life shouldn't be affected because of your greed and lies. Ill call the police\"}]}"
    },
    {
        "SubmissionID": "1om00jx",
        "Topic": "Work / authority / professional boundaries",
        "Background": "Brief history about me. I worked at my last job for 2 years and worked my way up to management, this last year i transfered to Michigan from New Jersey and have been here since March. I got offered to work at a Car Wash and make way more money. I voiced concerns about culture difference as im super proud and happy of the culture I had at my last work place and how its a huge stepping stone for me to leave there. They reassured me and were super kind and helpful. I get hired, decide to take the opportunity and ive been here 2 and a half weeks now. \n\nToday was my last day. I started off in a management role, was trying to get to learn the team and how to do the job. I had very minimal training and taught myself a lot, there were times in my first week I was the only management on site and barely knew what was going on. I was asking questions to learn stuff, and when they got back I ran over what I did to see if it was right and they said yes. At the end of every shift they thanked me and told me I was doing great. \n\nOne day my manager texts me saying im going to be at another location a few miles away because my training is now over. My first day at the new location, he comes to the location and said come talk to me. What's been going on? I said jobs great and I love it, feel like im adapting well and learning a lot. And he says well we have an issue and that's why I moved you here. I asked what was the issue? He said the manager there didnt see any leadership from me and wasn't looking for my style of management. And that there was an incident. \n\nHOW HE HEARD THE STORY: Me, A manager, and another guy were in the booth. I brought up my past how \"back in jersey I was the token white kid grew up around black people and said the n-word\" and it made the woman manager uncomfortable so here we are.\n\nHOW THE STORY UNFOLDED: me, a manager and a WHITE guy were in the booth. He said something something n***a. He looked at me and said, im sorry, I grew up in detroit. I responded with you're okay. Ive heard it plenty when I lived in New Jersey. He said oh so you grew up in the hood? I said i wouldn't really say the hood but I was definitely one of the token white kids growing up. It was mainly black, Hispanic and middle eastern where im from. He said oh cool that's wassup. And then we got cars and dispersed.\n\nI defended myself and asked what he meant about my leadership as I felt I took on a lot for being new and was making sure shit was running and getting done as efficiently as I could and I feel like judging my work on a week worth of work isnt necessarily fair. Plus everyone knows what to do so there hasn't been any need for me to get people moving. The bell goes off and everyone disperses to do their job. There have been times im the only one around and make sure shits done. Plus every day the manager says how great ive been doing. If she doesnt tell me what im doing wrong, how can I improve? And also I never said the n-word. I was asked a question about my past and I answered it. But yes, I grew up around black people. (I didnt snitch on guy that actually said it cuz im not like that) \n\nHis response was well people would follow a man of your stature, you just have to tap into the strict side and lead with some fear. We cant have our managers too friendly with the staff and getting super personal. I moved you here to give you another chance, if you fail me again I'll demote you down to line work. Just be more conserved and dont share so much.\n\nWhich I dont even know wtf he means with the stature. But I felt like the disrespect was more towards my friends I grew up with more than towards me. Cuz I also noticed after this convo I have only worked with white people in management. \n\nSo I said, Okay. You got it. Apologies. Won't let it happen again. So now at this new gig all i did is talk work and if anyone asked anything personal I gave half assed dry responses.\n\nToday I get to work and the new manager im working with hands me a line worker shirt and said to wear that instead of my production super shirt. I said why? He said Manager said he talked to you yesterday did he not? I said no he didnt and he said oh well he didnt really give me a reason why but told me to give you a line worker shirt because you got demoted. I talked to him on the phone and asked what about the second opportunity? He says the opportunity was that he didnt fire me and im still able to work for the company. I hung up, left site and sent him this text. AIO?",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I just feel like measures are a bit extreme. I definitely realize where I messed up. But I gave up a lot leaving [redacted] for a much more promising opportunity even though I could have been set with [redacted]. I was willing to break off and explore new stuff and you were willing to give me a chance.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Meanwhile I still don't fully understand the too friendly with staff. Who would want to follow someone they don't know? Besides that you have Production Supers dating MSA's and others talking about doing and selling drugs on top of other things. I won't name names because im not like that. But I mention where I grew up and something that happened and suddenly its an issue? But I don't need any answers, its all good.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Sincerely appreciate the offer and opportunity. But I don't think our management styles will work well together. I feel disrespected and don't feel this culture you praise. This isn't going to be a fit for us i don't believe. Have a great one.\"}]}"
    },
      {
        "SubmissionID": "1h7z9tc",
        "Topic": "Work / authority / professional boundaries",
        "Background": "The phone number is listed at the top that comes from the business number that only my boss had🤦🏻‍♀️. I put my resignation in and my boss couldn’t handle it and fired me after cussing me out on the phone. AIO for wanting to expose her for who she is by reaching out to this nurse and others that she’s wrongfully terminated and take this further?",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Scary bitch Log in stupid ass\"}, {\"speaker\": \"Speaker B\", \"text\": \"lol. Can't wait to post how professional your business is. Trying to act like you got referrals we don't need your referrals\"}, {\"speaker\": \"Speaker A\", \"text\": \"Can't believe the owner just called me a 'scary bitch'.\"}, {\"speaker\": \"Speaker B\", \"text\": \"This isn't the owner stupid ass bitch\"}, {\"speaker\": \"Speaker A\", \"text\": \"Very unprofessional. I'll be posting this on my TikTok and instagram 🤞\"}, {\"speaker\": \"Speaker B\", \"text\": \"Oh yes it is. Julie 😂\"}, {\"speaker\": \"Speaker A\", \"text\": \"upset that I didn't want to go through with your job so now want to call me a scary bitch is very insane.\"}]}"
    },
      {
        "SubmissionID": "1mrswx5",
        "Topic": "Shared living / property & guests",
        "Background": null,
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey for future reference, I would really rather you do not have people over in the apartment when I do not know when I'm asleep. Or at the very least, I wish you would run it by me ahead of time and let me know who you plan to have over.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I totally understand where you're coming from, I would like to maybe talk further about this. we are paying equal shares of rent and are both on the lease, so this is as much my home as yours, and I'm struggling with the idea that I need to run it by you whenever I like to have guests after 9pm. But this is a serious boundary for you! This isn't something I'm willing to compromise on. Strangers in my home while I'm sleeping is a firm no.\"}, {\"speaker\": \"Speaker A\", \"text\": \"oh wow! I'm not totally sure how to respond to this or where to go from here, the notion that I cannot have my own guests in our shared home is a hard pill to swallow... and u not compromising with me is kind of upsetting. I would understand if it was happening over and we were really loud or disruptive or if it was like a bunch of dudes from the bar I had just met that night but it was only my close friends who I've known since college and we were very respectful about the fact that you were asleep, even on a saturday night when I know u don't work tomorrow or anything we didn't pregame or do anything lively in the apartment and we just came back afterwards to lay on the couch and watch vampire diaries and eat taco bell lol. what if I wanted to have a guy over who I was seeing and you hadn't met? with all due respect, I might argue that who I invite over is my business as long as they don't enter your personal space or bother u it is very much my business who is in my home when I'm sleeping. I don't know any of these people and can't fairly judge them based on your judgement enough to blindly take your word for how reliable any of these people are. wooow respectfuly I don't feel I have ever given you a reason to decide my judgement is poor. this feels like ur making judgements about me because I choose to spend some weekends going out? I cannot fathom what else would make u decide I have bad judgement. I've never done anything to you or have ever put u in a bad situation or even shared with u a time when I have put myself in a bad situation. I do not judge your decision to sleep early and not go out.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Sigh. I've made my stance clear. How you choose to spend your time is irrelevant to me. Let's leave it at that. I'm not comfortable with this and I'm not agreeing to it. But I do, we pay equal rent. You are not the authority of the household. If I would like to have a conversation about this and reach a compromise we can do, and the way you are speaking to me right now is something else I am not comfortable with.\"}]}"
    },
      {
        "SubmissionID": "1mg4a9r",
        "Topic": "Shared living / property & guests",
        "Background": "hello, posting on a different account \nthis happened yesterday, today she ended up just going to the guys place instead of bringing him to our apartment but she refuses to speak to me. In the first slide, the names i blurred out are my boyfriend’s name and a friend of mines name. \n\nwe were both in the kitchen at the same time today and she kept slamming cupboards and placing things down extremely aggressively, I went to shower after her and my conditioner had just “accidentally” opened and spilled all over the shower floor. \n\nI really don’t know if I was being too harsh or not but at the same time I don’t feel like it’s fair that i’m constantly expected to stay in other places so she can bring people over. I asked her to try bring over less people in the past and she agreed but then continued to just do the same shit afterwards\n\nam I overreacting in this whole situation?? ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hi I'm having a guy over tomorrow around 7 would u be able to stay somewhere else for a few hours??\"}, {\"speaker\": \"Speaker B\", \"text\": \"how long??\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm not sure if he'll be spending the night if ygm\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't really anywhere I can go\"}, {\"speaker\": \"Speaker A\", \"text\": \"have anywhere\"}, {\"speaker\": \"Speaker B\", \"text\": \"Can you not go over to [redacted] place\"}, {\"speaker\": \"Speaker A\", \"text\": \"has visiting his family he isn't around\"}, {\"speaker\": \"Speaker B\", \"text\": \"Surely there is someone's house u can go to\"}, {\"speaker\": \"Speaker A\", \"text\": \"Go to [redacted]\"}, {\"speaker\": \"Speaker B\", \"text\": \"I already went to [redacted] on tuesday cause you had a different guy over\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's not fair of me to keep inconveniencing people like that\"}, {\"speaker\": \"Speaker B\", \"text\": \"She doesn't even care and you don't have to say it like that\"}, {\"speaker\": \"Speaker A\", \"text\": \"what??\"}, {\"speaker\": \"Speaker B\", \"text\": \"You don't have to say that like I'm a whore or something\"}, {\"speaker\": \"Speaker A\", \"text\": \"I didn't call you a whore\"}, {\"speaker\": \"Speaker B\", \"text\": \"I just said I already went to [redacted] on tuesday cause you had a guy over\"}, {\"speaker\": \"Speaker A\", \"text\": \"You said different guy like I'm sleeping with loads of different people\"}, {\"speaker\": \"Speaker B\", \"text\": \"I wasn't trying to make it seem like that I was just saying it's not fair\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's my apartment too and this would be like the 3rd time this week I've had to find somewhere else to stay\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't mind you bringing people over but when it's happening multiple times a week and I have to look for other places to stay over because it's not exactly fair\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yeah good job on not calling me a whore\"}, {\"speaker\": \"Speaker B\", \"text\": \"everything I said are things that are just factual\"}, {\"speaker\": \"Speaker A\", \"text\": \"you are constantly bringing over guys and I constantly have to stay over somewhere else because of it and you're calling me a whore\"}, {\"speaker\": \"Speaker B\", \"text\": \"it's literally just telling the truth\"}, {\"speaker\": \"Speaker A\", \"text\": \"you can sleep with who you want I'm not judging you but I just don't appreciate having to leave my apartment constantly cause of it\"}, {\"speaker\": \"Speaker B\", \"text\": \"So you can bring [redacted] over but just because I'm bringing over guys I'm not in a relationship with it's not okay\"}, {\"speaker\": \"Speaker A\", \"text\": \"I purposely go to [redacted] because he lives alone so it's just easier that way\"}, {\"speaker\": \"Speaker B\", \"text\": \"and I don't expect you to leave the apartment whenever he comes over when we're literally just hanging out\"}, {\"speaker\": \"Speaker A\", \"text\": \"rarely comes over it's not even comparable to how often you bring people over\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't get why it's a problem having to stay in your boyfriends place for a night or for a few hours\"}, {\"speaker\": \"Speaker A\", \"text\": \"Like I can understand not wanting to do that to our friends but literally why would you\"}, {\"speaker\": \"Speaker B\", \"text\": \"are you forgetting that we share that apartment\"}, {\"speaker\": \"Speaker A\", \"text\": \"he doesn't mind me coming over but my whole point is that we both live in that apartment I'm entitled to stay there when I want\"}, {\"speaker\": \"Speaker B\", \"text\": \"I live there it's not fair that you constantly expect me to just leave whenever you want me to go to [redacted]\"}, {\"speaker\": \"Speaker A\", \"text\": \"I just don't understand why your acting like this is the end of the world because you have to go out and be social for hours and basically insinuating that I'm a whore\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't know what your problem is all of a sudden\"}, {\"speaker\": \"Speaker A\", \"text\": \"I asked you in the past to try to stop hanging out with many people because of this and you agreed but then just kept doing it\"}, {\"speaker\": \"Speaker B\", \"text\": \"we are both trying to make different points and you aren't understanding what I'm saying about this being my apartment too\"}, {\"speaker\": \"Speaker A\", \"text\": \"Okay let's end the drama here\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'll figure something else out jesus abeit\"}]}"
    },
      {
        "SubmissionID": "1fttdcv",
        "Topic": "Health crisis & support expectations",
        "Background": "If people want to look at my post history you will see I’ve previously talked about being in a somewhat toxic marriage. \n\nI struggle sometimes to work out if I am over reacting to how we interact\n\nThe above exchange is an example. I have spent all day in A&E (the ER) with my elderly mother getting not very far. \n\nI sent a message saying I was on my way home and as I had forgotten my coat I was going to get soaked as we are having a heavy rain storm. I noted that I was frustrated and angry with the situation (my Mum) as the NHS in the UK is a mess and doesn’t deal with the elderly well.  This line ‘ May need to do another angry/ frustration when I get home’ was meant to say May need to do another angry/frustration run. \n\nHer response was to say I needed to help her with a project she’s working on for our daughters 21st. \n\nI’m pissed off because everything is always about what she thinks is important, she has undiagnosed ADHD and once she becomes focused on something she can’t see outside of it. ",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Heading back, I remembered to pick my coat up this time, unfortunately I left it in the car. Got an update plan still to admit her May need to do another angry/frustration when I get home\"}, {\"speaker\": \"Speaker B\", \"text\": \"I need your help to order photos before we sit down to dinner.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Your timing is dreadful\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's for your daughter\"}]}"
    },
  {
        "SubmissionID": "1lrb8mb",
        "Topic": "Health crisis & support expectations",
        "Background": "For context:\nMy partner and I have been together for almost 5 months, we fell in love pretty quickly and it was wonderful, he also has some mental health challenges so i try to be understanding while i do not know much about his disorder.  He is very hard to read and i have expressed that i want to know whats going on in his mind and understand what he needs from me as his partner.\nI have been struggling with my depression for a couple months now and it took me a while to admit to him how bad it was due to past relationships not handling it well and bullying me about it. Our mutual friends told me to be honest with him because he of all people would understand the struggle, so i did. But i don’t feel i am getting the support i need from him and i expressed that to him. \nNow heres the main story:\nA few days ago i had a terrible panic attack, i was sick and so shaky i couldn’t walk. My parents rushed me to the ER and it was bad enough to get admitted to hospital where i underwent many tests, one of them was an MRI, I’m not claustrophobic and didnt think it was a big deal until the last 5 minutes, something overwhelmed me and i went into a massive panic/seizure like state. I would update him everything that happens and he did show concern. The problem is, if he loves me like he says he does, why didnt he come to see me when ive been here for 4 days and still dont know when im getting discharged. Am I overthinking this?? \nP.S. this was my first time staying overnight at the hospital and never experienced anything like this..\n\n",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Tucked in for the night. I wish I had one of your sweatshirts to cuddle with 😭\"}, {\"speaker\": \"Speaker B\", \"text\": \"Good morning my sick love bug 💕\"}, {\"speaker\": \"Speaker A\", \"text\": \"Good morning my sweet love 😍\"}, {\"speaker\": \"Speaker B\", \"text\": \"How was your night in the hospital??? 😴😴😴\"}, {\"speaker\": \"Speaker A\", \"text\": \"Awful lol couldn't sleep very well. I'm hooked up to all these machines and can't get comfy with my iv 😔 still waiting on the MRI\"}, {\"speaker\": \"Speaker B\", \"text\": \"It was good! I didn't have a lot of deliveries but I had a shit load of big heavy boxes today. How was your hospital day???\"}, {\"speaker\": \"Speaker A\", \"text\": \"Today was a great day. I feel back to myself and better! I do wish you were here with me by my side. I've missed you. Are you coming to see me? I hoped you'd come to see me today. I'm hoping to get discharged tomorrow, I just don't know when that will be\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't think I'm coming today because I had work all day and I'm fairly sure visiting hours are a thing lol but that's awesome you think you'll get out tomorrow!!\"}, {\"speaker\": \"Speaker A\", \"text\": \"I wasn't meaning to come at 10pm 😳 I know you have to walk Bo and everything but I'm not far! I know work is strenuous, and I'm on medications that make me tired. So we could've been tired together!!\"}, {\"speaker\": \"Speaker B\", \"text\": \"is so stressed out from the fireworks 😩\"}, {\"speaker\": \"Speaker A\", \"text\": \"Are they happening now?\"}]}"
    }
]