[
    {
        "SubmissionID": "1n214ts",
        "URL": "https://i.redd.it/g080a3x9eolf1.jpeg",
        "Title": "AIO for thinking this is odd???",
        "Body": "I, F(22) met this guy (M22) from hinge. We’ve been talking for a couple months. have not met yet as he’s been out of state. He recently came back to the state I live in and just a few hours before this message, we were dating about scheduling a date. Then he sends this??? Im honestly so confused and feeling like I need to distance myself. It seems he doesn’t see the issue and I’m not sure how to explain it to him. Or is it just me who thinks it’s weird he’s trying to pass me off to his friend, while continually saying he is interested in me??? ",
        "BestComment": "He's definitely over-thinking SOMEthing. Either it's like he said and he didn't want to just give your snap to a random friend without your consent, and he went awkward with it and weirdly asked you without considering how you may take it, or he was trying to get that confirmation you were into him and again went about it really awkwardly.",
        "Topic": "Boundary Issues",
        "Background": "Early-stage Hinge match asks if he can give her Snapchat to a friend who saw her name pop up in his car, blurring boundaries by trying to pass her along while still claiming interest in her.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Also I completely forgot but My friend thinks you’re cute (My phone was connected to apple carplay and your name popped up) he would like your snap but i wanted to ask you is it okay if I give it to him?\"}, {\"speaker\": \"Speaker B\", \"text\": \"As much as I appreciate the compliment, I’ll have to pass. It’s you who I’m interested in lol but lowkey this really is throwin me off, now I have no idea if you feel the same\"}, {\"speaker\": \"Speaker A\", \"text\": \"Oh you don’t have to worry about that, I’m interested in you, maybe even a little more than you are with me lol, I just wanted to ask instead of just handing it off without your consent\"}]}"
    },
    {
        "SubmissionID": "1kl3j4z",
        "URL": "https://www.reddit.com/gallery/1kl3j4z",
        "Title": "AIO by being annoyed about my boyfriend’s Mother’s Day post to me?",
        "Body": "So yesterday was Mother’s Day for where I’m from and I’m currently pregnant with my little a boy.\n\nMy boyfriend took it upon himself to make a post dedicated to me and didn’t ask but just posted. I have a lot of issues one being I didn’t even announce my pregnancy. The only people that know are people who really see me and know me. Also my own mom got sent this post and she got pissed and really chewed me out about it. \n\nSo I’m really mad and bothered because something about it the story just feels so degrading. But am I overreacting?",
        "BestComment": "I think you should have included your ages in the post. You’re 15, and he’s 18. That explains a lot.",
        "Topic": "Gaslighting",
        "Background": "Pregnant girlfriend confronts her boyfriend about a degrading Mother’s Day post announcing her pregnancy to thousands without consent, while he tells her to lighten up and acts like she is overreacting.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"I'm glad I picked you to be the mother of my child and I can't wait to give you more I love you babe\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yeah sharing to your 3100 followers that you basically see me as an object that you chose to impregnate is so hilarious\"}, {\"speaker\": \"Speaker B\", \"text\": \"OMG lighten the fuck up, you're reading way too deep into a story post. You act so miserable these days and get pissed about the minor things...\"}, {\"speaker\": \"Speaker A\", \"text\": \"ITS BECAUSE I AM FUCKING MISERABLE !!!\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm 34 weeks pregnant, I barely can breathe and walk. So yes I'm freaking annoyed that your Mother's Day post to me is 'thank you for being hot and letting me impregnate you'... like it was a very you centered post. Why are you gaslighting me on this\"}, {\"speaker\": \"Speaker A\", \"text\": \"Like most people didn't even know you were the father and that post has made me the laughing stock so thanks a lot\"}]}"
    },
    {
        "SubmissionID": "1gva09m",
        "URL": "https://www.reddit.com/gallery/1gva09m",
        "Title": "aio for telling my mum im moving out over this",
        "Body": "i’m 18 and a girl. her boyfriend hasn’t been around long, 7-8 months i would say. i had no problem with him, i never really liked him i just tolerated for my mums sake. problems started happening a month ago now, he started acting really weird towards me. i was getting ready for a date with my gf, i thought my mum came home so i went downstairs (i’d just gotten out of the shower so i had just a towel on) but it was her bf so i quickly went back upstairs, i said sorry as i didn’t know it was him then i went back to getting ready. about 20-30 mins later i forgot something in the bathroom so i went to get it, i heard him moaning so i thought my mum was home (gross😔). went back into my bedroom to continue getting ready and i turned my music up loudly so i couldn’t hear that bs. i finished getting ready and went downstairs but it was only him so i asked him if my mum was home he said no 🌚. which i realised he was jerking it. i could feel him staring at me when i was getting myself a drink, i caught him staring at my boobs but i didn’t say anything. then i saw him adjust himself 😔. things like that have been happening a lot for the past month. sometime before all that happened my gf and i were in the living room together and we were kissing, it wasn’t snogging anything like that it was just little sweet ones we was having a moment 🫠 & we were home alone but he randomly came in but we just laughed it off. my gf said maybe that’s what made the weirdness start to happen. \n\ni’ve told her this, she tells me i’m just overthinking things. i told her it’s making me uncomfortable, but she keeps telling me i’m just overthinking so i’ve been at my girlfriends house all the time pretty much. i don’t like being around him anymore. \n\ni feel annoying posting this and im kinda embarrassed 😔 i don’t wanna move out i love my mum but i can’t deal with her around that man she’s a different person and i hate it. i haven’t even been at work i have a week off 💔\n\nthis is really long im very sorry i appreciate it if you read everything ",
        "BestComment": "Hey! So my mom married a creep when I was 14 and they split up about five years later. It was a VERY rocky time for my mom and I. But we figured it out later. Right now, prioritize your safety. Make sure you eat, hydrate, rest, meditate. You have to treat yourself like you would a friend right now. I’m so sorry you had to endure this. I relate, deeply. Feel free to message me. You can do this!! You’re so young, hun, the sky is the limit!! I’m also excited for you because wheh I left home I really found myself. There is an adventure in this\n\nEdited to add: you may never want to forgive your mom. And your mom may never ask for it. And that’s ok too. Like I said PRIORITIZE YOURSELF. It worked out for me n my mom but it certainly doesn’t mean that everyone deserves or has earned forgiveness, and that’s ok too. Take care of yourself.",
        "Topic": "Emotional Abuse",
    "Background": "A daughter explains feeling unsafe around her mother’s boyfriend and losing access to having her girlfriend over, while her mother dismisses her discomfort, mocks her, and threatens to pack her things.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"I'm tired of this awkwardness in the house. I've spoken to her bf that he isn't comfortable when he's just there with you two... I don't think this is fair.\"}, {\"speaker\": \"Speaker A\", \"text\": \"No, I'm not I can't believe you right now\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's my own house I grew up here he's not even been around for a year and how he feels is more important than mine\"}, {\"speaker\": \"Speaker B\", \"text\": \"Whatever I do someone is going to be pissed off.\"}, {\"speaker\": \"Speaker A\", \"text\": \"So you thought pissing your child off was the better option\"}, {\"speaker\": \"Speaker A\", \"text\": \"I told you why I'm uncomfortable when he just saunters in the house when you're not there\"}, {\"speaker\": \"Speaker A\", \"text\": \"But the second he's suddenly uncomfortable it's a problem and I can't have my girlfriend here anymore\"}, {\"speaker\": \"Speaker B\", \"text\": \"You aren't having her here anymore and that's that. Goodnight\"}, {\"speaker\": \"Speaker B\", \"text\": \"Grow up\"}, {\"speaker\": \"Speaker A\", \"text\": \"I fear moving out is a pretty big growing up move no?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Right and where are you gonna go?\"}, {\"speaker\": \"Speaker A\", \"text\": \"The place I practically live in her dad doesn't care he literally told me if anything ever happens I can live with them\"}, {\"speaker\": \"Speaker B\", \"text\": \"Still haven't come and got your stuff I see.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I've had work\"}, {\"speaker\": \"Speaker B\", \"text\": \"Right, when are you coming to get it then if you're still having your tantrum?\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'll pack your things\"}, {\"speaker\": \"Speaker A\", \"text\": \"No i will do it tomorrow\"}, {\"speaker\": \"Speaker B\", \"text\": \"Me and [REDACTED] will do it tonight. Have it all done and ready for you\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ermmm no\"}, {\"speaker\": \"Speaker A\", \"text\": \"He isn't touching my things\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'll do it myself\"}, {\"speaker\": \"Speaker A\", \"text\": \"Lol ur in for a shock enjoy\"}]}"
    },
    {
        "SubmissionID": "1mvfk83",
        "URL": "https://www.reddit.com/gallery/1mvfk83",
        "Title": "AIO or if you truly loved someone you wouldn’t sneak out at 1am and cheat?",
        "Body": "We’ve been together since 2017, once a year this will happen, he’ll have a shower put on cologne and go for a drive - he’s managed to get away with it by gaslighting me into thinking I was just paranoid because what’s wrong with going for a night drive? But this time he failed miserably - I obviously know his snap username but not his password so I tried to log in while he was asleep and got the verification code. Apparently there’s a glitch where deleted immediately messages don’t delete and I can view them. Tbh why not just block the person all together why even keep them it’s like he wants to get caught it’s a game.\n\nI have insane health anxiety and going to have to get tested for stds and yes we’re over - unfortunately we have a house and pets together and I have no family or friends to stay with. Which is probably why I stuck around so long but my only option is to be homeless to get away from him ",
        "BestComment": "If you truly love someone, you don’t sneak out at 1am to cheat. You don’t gaslight your partner into thinking they’re paranoid, you don’t risk their health, and you don’t treat your relationship like it’s some kind of game to see if you can get away with it. Love is about respect, honesty, and safety. He failed at all three. You’re not overreacting, you finally have the proof that backs up your gut feeling. I’m so sorry you’re in this situation, but you deserve way better than a partner who risks your health and peace of mind for a quick hookup in a car.",
        "Topic": "Gaslighting",
    "Background": "A fiancée messages the woman her partner is meeting at night, revealing that he is engaged and habitually cheats after years of brushing off her suspicions as paranoia.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Cool\"}, {\"speaker\": \"Speaker B\", \"text\": \"U drive?\"}, {\"speaker\": \"Speaker A\", \"text\": \"He\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yea\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm free now if u want to meet\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yeah\"}, {\"speaker\": \"Speaker A\", \"text\": \"Have you got insta\"}, {\"speaker\": \"Speaker A\", \"text\": \"Did he tell you he has a fiancé btw? We're not in an open relationship he just likes to cheat - hope you both had fun\"}, {\"speaker\": \"Speaker A\", \"text\": \"When was the last time you got tested? Probably never if you're the type of person to meet people for sex at night at a bus station\"}, {\"speaker\": \"Speaker A\", \"text\": \"Get some self respect, in fact you can have him if you want\"}]}"
    },
    {
        "SubmissionID": "1ivjyt2",
        "URL": "https://www.reddit.com/gallery/1ivjyt2",
        "Title": "AIO that I have black mold and property management is seemingly questioning whether or not it’s even mold?",
        "Body": "For context, I live in an older building in Culver City and have lived here for 12 years. I’ve never really complained about much and all of the little things that need fixing I’ve just done on my own over the years. I finally reach out to property management because the black mold around my window sills continues to come back (I think it’s due to the fact that the windows in my apartment are so old and in the winter time there’s a ton of condensation and moisture either from rain getting in or the difference in temperature outside vs inside). I now have an almost 10 week old daughter and need this issue taken care of asap and they have stopped responding to me. Thinking of getting the city or a lawyer involved. Am I overreacting?",
        "BestComment": "DEFINITELY NOR. That can be so detrimental to your health and if it’s sporing so easily spores are present. You need to take some action toward your rental management if they don’t agree to come inspect and test.",
        "Topic": "Gaslighting",
    "Background": "A tenant reports recurring black mold and concern for her baby’s health, and the property manager minimizes it as something she just needs to clean unless there is visible leaking.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"Hi Hannah, not trying to be difficult but do you clean the window sills? They need to be cleaned at least once every 6 months. Are the windows leaking? If you see water intrusion then we can handle it for you but if there's no leak it just needs to be cleaned.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I've been dealing with this every winter since I've lived here, and have never said anything because I just clean it constantly, but it continues to come back and I now have a 9 week old baby and I don't feel comfortable breathing that in. The windows are very old and need replacing.\"}]}"
    },
    {
        "SubmissionID": "1monq2r",
        "URL": "https://i.redd.it/vn3hz7wr4oif1.jpeg",
        "Title": "AIO or is my brother trying to use me to get his GF to forgive him ?",
        "Body": "Honestly if you’re someone recovering from toxic relationships just ignore this because it’s triggering.\n\nBut context this pass Sunday my (f15) brother (M19) is in a relationship with my best friend (F15) that we will just call Mia for the post.\n\nBut Mia was my best friend before she was even my brother’s Gf…now she’s family because they recently had my little nephew. The relationship between my brother and Mia is very toxic mostly because of him, he’s very controlling and gets jealous a lot, he knows how to control her . Meanwhile Mia is very in my opinion trauma bonded to him because she suffered some bad stuff from her mom’s ex boyfriend…he was like messing with her at night. From what she told me my brother was really there for her and helped her feel normal again. Then Mia is also religious and my brother was her first for alot of things if you catch my drift, and I think she thinks he’s supposed to be her husband and she needs to be with him..so there whole relationship is just mess.\n\nAlthough the situation that brings me here is Mia and my brother were arguing all day Sunday he wanted to take the baby out to meet his friends and she told him no because she feels like he still too little. But that didn’t stop my brother getting mad  at her and she was like in the recliner breastfeeding the baby and she asked him to bring like a certain medicine to give the baby. I’m not even sure what it was but it had someone weight to its like an inhaler...he ignores her the first few times she asked and he finally does give to her…but I kid you not he quite literally chucks it at her hard. While she’s holding my nephew and this I could tell scared her and she looked at my brother very obviously scared of him. After he does that he looks at her and walks away and she starts hiding under the blanket with the baby crying. That’s when he realizes he fucked up and  starts apologizing to her a bunch. But she kept\nPulling away and just didn’t speak to him she was still obviously crying and my mom did take her home after that.\n\nShe hasn’t spoken to my brother since Sunday. I have obviously talk to her and she’s just tired of being treated horribly by him in her own words, “I don’t understand why he treats me this way, I’ve done so many things for him that I really didn’t even want to do to keep him happy in the relationship and he still treats me like this, I won’t allow him to mistreat our baby”\nMy brother is now been trying to use me to convince her to forgive him…but personally I don’t want her forgive him. He stole her light and positive energy since being in this relationship. She’s not the same person she was before they dated and I feel awful for bringing him into her life…AIO? ",
        "BestComment": "i feel so horrible for her. she was abused and then your brother used her trauma against her to just continue abusing her. you are absolutely right that she should not forgive him or talk to him. he is a predator and your friend deserves better. these situations are really hard, because from the outside you can’t do much to help, but i’m sure your friend really really appreciates having you especially in a time like this. keep trying to be there for her and hopefully she can get away from your brother soon.",
        "Topic": "Manipulation and Control",
    "Background": "A brother who threw something near his girlfriend while she held their baby asks his sister to convince the girlfriend to forgive him, downplaying the incident as not that deep and avoiding accountability.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I have no idea why you’re downplaying this you were wrong point blank.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Can you just tell her I’m really sorry..it was just the heat of the moment and it’s not that deep. She has done similar when she’s mad.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I’m not telling her anything until you actually realize what you did because right now you obviously are still trying to avoid accountability...\"}, {\"speaker\": \"Speaker A\", \"text\": \"Like i honestly believe if she didn’t have that reaction u would not believe what you did was wrong\"}, {\"speaker\": \"Speaker B\", \"text\": \"Well obviously no shit that’s a definition of apology I wouldn’t apologize if I intentionally tried to hit her, it was mistake and I’m not villain like that and she knows that.\"}]}"
    },
    {
        "SubmissionID": "1lr6fio",
        "URL": "https://www.reddit.com/gallery/1lr6fio",
        "Title": "AIO: Is my gf overreacting for getting mad at me for this?",
        "Body": "I sent a tiktok to my girlfriend because I thought a female on my fyp looked like her. She got mad at me which I thought she was joking, she blocked me shortly after so I texted her on IG to figure out what she got mad at me for. The following images details what happened after.",
        "BestComment": "Are you teenagers?  If you are adults...please block this person and never speak again.",
        "Topic": "Boundary Issues",
    "Background": "A girlfriend becomes upset and blocks her boyfriend after he sends a TikTok of a girl he thinks looks like her, accusing him of looking at other girls and objecting to him watching that kind of content.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"my reaction every time I watch this EP\"}, {\"speaker\": \"Speaker A\", \"text\": \"she looks like you\"}, {\"speaker\": \"Speaker A\", \"text\": \"rly dude don't ttm ever again\"}, {\"speaker\": \"Speaker A\", \"text\": \"u can go look at other girls\"}, {\"speaker\": \"Speaker A\", \"text\": \"what makes u think we're be with u if we looking at that shit\"}, {\"speaker\": \"Speaker A\", \"text\": \"looking at what\"}, {\"speaker\": \"Speaker A\", \"text\": \"girl on my typ that looks like you?\"}, {\"speaker\": \"Speaker A\", \"text\": \"no\"}, {\"speaker\": \"Speaker A\", \"text\": \"girls shaking their ass\"}, {\"speaker\": \"Speaker A\", \"text\": \"if r u on\"}, {\"speaker\": \"Speaker A\", \"text\": \"huh?\"}, {\"speaker\": \"Speaker A\", \"text\": \"where\"}, {\"speaker\": \"Speaker A\", \"text\": \"in her glasses reflection\"}, {\"speaker\": \"Speaker A\", \"text\": \"BRO WHAT nah u trippin\"}, {\"speaker\": \"Speaker A\", \"text\": \"am i\"}, {\"speaker\": \"Speaker A\", \"text\": \"i'm done with u\"}, {\"speaker\": \"Speaker A\", \"text\": \"u trippin if u think i was observing that hard\"}, {\"speaker\": \"Speaker A\", \"text\": \"idk y dude get with girls is to look at others\"}, {\"speaker\": \"Speaker A\", \"text\": \"bye\"}, {\"speaker\": \"Speaker A\", \"text\": \"ok\"}]}"
    },
    {
        "SubmissionID": "1hpver9",
        "URL": "https://www.reddit.com/gallery/1hpver9",
        "Title": "Am I Overreacting To My Boyfriend Canceling Our 2 Year Anniversary Plans?",
        "Body": "First time posting here but I am seriously in need of a reality check. I want to know who is in the wrong because I'm not able to look at the situation as clearly anymore. \n\nBACKSTORY:\n\nMy boyfriend (M45) and I F(27) met in 2022 when I started working at the same restaurant as he already did. We didn't really talk much but 6 months in to me working there is when he started to show interest and tried to pursue me. Took about 3 months of that for me to give him a chance. After our first time hanging out he told me he had been single for some time and that he was looking for someone to do stuff with like concerts, dinners, vacations etc. but keep it light. Being I am 17 years younger he also said he wouldn't want anything too serious with me since he wouldn't want to \"steal my youth\" or take away any experiences I should be having at my age. I said I love all those things and I would be down but that I thought he was full of it and just trying to spit some game at me. He asked me to name an artist I liked and if I have ever been to Hawaii to which I said yes (he had never been.) A couple days later he booked us a trip to Hawaii but we had to stop in Las Vegas first to go see the artist I liked who would be performing the day before our flights to Hawaii. I was surprised it wasn't all talk. Over that vacation we had a mix of fun and getting to know each other and how we are as partners in relationships to which I promptly said I cook but I am not the best with cleaning to which he said if I cook he would have zero issue doing his part by cleaning and doing any \"manly\" duties. This was the start of our relationship and we had been together ever since. We moved in with each other in 2023. \n\n\nTODAY'S ISSUE:\n\nFast forward to now, I haven't worked with him in a while but he uses work as an excuse not to do his part or the bare minimum. His motto has always been \"quick and easy\" and it's really getting to me that he is the lead server at his job never calls out and people praise all his hard work and efforts yet he comes home \"too tired\" for anything more as if I don't work myself. \"But I work REALLY hard\" is what I'm usually understanding of however that doesn't mean you get to check out. I've seen his work ethic because I worked there and it's amazing I just wish there was some of that leftover for our home and our relationship. He goes out of his way to give co workers rides and help people which I really do love but once he's in the door it's immediately to the couch and what's for dinner.\n\nYesterday (12/29) was our 2 year anniversary which he PROMISED he would take the day off whether he had to request it off or call out he would make it happen for me. My only requests were to spend the day together and it would be nice if he could make the reservation so I could be somewhat surprised. He didn't feel like making the reservation anywhere and said \"ugh baby just pick one!\" So I made two at places I like. Two days before the date he tried to tell me he wants to go to work to which I was very upset because he's had months notice of this and he could easily request or switch the days off with his coworkers. He asked off new years day but not our date which upset me even more like you could have done both or just chose the one. He realized I was upset and said he would keep his word and that he understands my feelings. The 28th at 10pm I got off work to call him and asked if I should pick up something to drink since we don't work the next day to which he said he was for sure going to work and going back on his word yet again. He said he doesn't feel comfortable not going to work on our anniversary (sunday) but he would want to do something the next day EVEN THOUGH HE STILL IS SCHEDULED. So you'll call out but just not that day? Attached pic is what I was met with. Please help me because this is another promise he hasn't kept and other promises he doesn't keep or leaves them until the last second and then guilt trips me. I need advice 🫠🫠🫠\n\n\nTL;DR:\n\nBoyfriend promised to have anniversary plans. Tried to go back on it, said nevermind and he understood me, and then actually did cancel. Said he didn't feel comfortable calling out of work on that day but would call out the next day and he requested new years day off when he could have easily requested our day off instead or as well. He has a history of being wishy washy when it comes to his word and we have a 17 year age gap so I am left conflicted. ",
        "BestComment": "Short version, stop dating your father’s buddies.",
        "Topic": "Manipulation and Control",
    "Background": "A younger woman confronts her older boyfriend for breaking his promise to take their anniversary off, while he cancels last minute, gets defensive, and then tugs on her emotions with repeated “Is this really how we end?” messages.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I am extremely hurt and disappointed. I desire not to have the promises made to me kept. You can make whatever choice you need to as will.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm tired of this shit\"}, {\"speaker\": \"Speaker A\", \"text\": \"You do not and never will control me. You do whatever it is you need to do. You seem to be great at that.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I love you with all my heart\"}, {\"speaker\": \"Speaker A\", \"text\": \"But ok\"}, {\"speaker\": \"Speaker A\", \"text\": \"Bye now\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's not good because you called me 10 minutes after my shift to tell me you're going back on your promise and ruining our anniversary and trust for you. I hope you understand the gravity of the situation. I will be going to the apartment tomorrow to grab some things so I can stay in the valley until I sort my thoughts.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Pick up all the shifts you want including new years since we won't be spending together. I hope I keep you happy and warm at night.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Can you call me so we can talk about things?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Is this really how we end?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Ok, I will back off.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Can you call me so we can talk about things?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Is this really how we end?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Ok, I will back off.\"}]}"
    },
    {
        "SubmissionID": "1o8sic4",
        "URL": "https://i.redd.it/wu3h4v0stlvf1.jpeg",
        "Title": "Am I Overreacting?",
        "Body": "Hey everyone,\nI’m feeling really frustrated and just need to know if I’m overreacting.\n\nA client dropped off her dog this morning for boarding/daycare. Everything seemed totally normal and there was no mention of any health issues. Later in the day, she texts me saying he “has a bug” and asks if I can go to the vet to pick up his meds.\n\nI asked what kind of bug, and she said “G something.” I’m assuming she meant Giardia.\n\nI was honestly stunned. Giardia is super contagious, and I have four of my own dogs plus several client dogs here daily. If she had just told me upfront, I obviously wouldn’t have taken him. Instead, she brought him over knowing he was sick and didn’t say a word.\n\nShe ended up having someone pick him up, but I’m still really upset. It feels so disrespectful, like she completely disregarded the safety of my dogs and everyone else’s.",
        "BestComment": "\nNOR. She should be banned from your boarding/daycare facility for knowingly bringing a dog with an illness that could make the other dogs ill. That is completely unacceptable.",
        "Topic": "Boundary Issues",
    "Background": "A dog daycare provider finds out a client dropped off a puppy with a contagious bug and only later admits it over text, minimizing the risk by saying it’s common and manageable.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"It's g something. Apparently it's very common the first year for puppies. But, other dogs can't be trusted around poop so safe for him to be solo\"}, {\"speaker\": \"Speaker A\", \"text\": \"What bug does he have??\"}]}"
    },
    {
        "SubmissionID": "1mkmy7m",
        "URL": "https://i.redd.it/myyt5jhyfqhf1.jpeg",
        "Title": "AIO my family wont answer the phone?",
        "Body": "hello everyone, i am really upset at my useless family who never even answers the phone. my mom likes to take our dog for walks regularly but she never brings her phone with her ever and even when she does she often does not answer the phone on the first try. it’s not even just her my dad and sister are often the exact same way. like what if i was stuck on the side of the road and needed help???? i feel like i don’t even matter to them and they don’t even care about me. i think i’m going to buy my mom an apple watch with cellular data because this is getting ridiculous \n\ni am a 25 year old man who lives on his own by the way",
        "BestComment": "I'm GenX I often didn't see my parents for weeks or months at a time without even a postcard. \n\nThe house they lived in didn't even have a phone, the phone was in the trailer they had my bedroom in, so if I tried to call them after 9pm? No one would answer. We didn't have an answering machine either. When they left for work in the morning, it'd be 12 hours before we'd see them again, or more.\n\nAnd, get this, that wasn't considered neglect!!!\n\nTry to remember you're only the main character of your own story, other people have lives & their own emergencies or need to rest. \n\nAlso, roadside assistance is what you actually need for when your car breaks down, way faster & more reliable.",
        "Topic": "Emotional Abuse",
    "Background": "An adult son vents at his family in a text, calling them useless and unreliable for not answering his calls when he imagines needing help in an emergency, while his parent tersely asks what he needs.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Holy shit answer the phone\"}, {\"speaker\": \"Speaker A\", \"text\": \"You people are so incredibly useless and unreliable that God forbid my car breaks down on the highway, I'd rather trust some white guy because you clearly cannot be reached in a timely manner\"}, {\"speaker\": \"Speaker A\", \"text\": \"I long to live such a gleefully unaware life, honestly good for you guys\"}, {\"speaker\": \"Speaker B\", \"text\": \"What the hell do you need?\"}]}"
    },
    {
        "SubmissionID": "1o88yk4",
        "URL": "https://i.redd.it/a5gyb3vpqhvf1.jpeg",
        "Title": "AIO ? My friends say it's no big deal that my boyfriend has a \"little cruch\" on my \"super sexy\" mom ?",
        "Body": "I (21f) love my mom (45f) but there have been times where she has embarrassed me. My dad (49m) and I are American and very modern. My mom is an Italian woman who got US citizenship and she has some very old-school ways. She treats herself like maid, especially when guests come over. \n\nLast Saturday, my boyfriend (22m) came over for dinner with my parents. His 1st time meeting them. Even though my mom has a head cold, she did her usual thing. She spend hours cleaning an already clean house and then spend hours cooking a massive dinner that nobody can finish. \n\nWhen my boyfriend came over, my mom hugged and kissed him on both cheeks. She does that with everyone. She served dinner. She dominated the conversation. She was her usual self. My boyfriend was acting like a lovesick puppy. When we were alone, I sniped at him. \n\nI complained to my friends. My friend group is a mixture of people I met in high school and people I met in college. Both male and female friends. The guys surprised me as they all sympathized with my boyfriend. They explained that they all had a crush on my mom at some point, that it was almost like a rite of passage for our little group. They talked about how my mom is \"super sexy\" but I have nothing to worry about. That having a crush on my mom is almost like having a crush on a celebrity, she's unattendable.\n\nI was expecting my girl friends to rain in the horndogs and back me up but they basically agreed that it was no big deal. Of course, none of them wants their guy to crush on their mom but they all agreed that it wasn't a major relationship problem. \n\nI feel so out-of-the-loop. Apparently my mom is \"super sexy\" and everyone knows it. I'm a little annoyed at my friends as they obviously had conversations about my family behind my back, but do they have a point. Is it really no big deal that my boyfriend has a \"crush\" on my mom ? Am I overreacting ?",
        "BestComment": "some of these replies are wild. yeah, it’s cool that he apologized- his response seems well thought out. but as someone who has had friends crushing on my mom, it is fuuuucking weeeeird. you’re allowed to feel uncomfortable in this situation, but your bf doesn’t seem to have any ulterior motives or anything.",
        "Topic": "Boundary Issues",
    "Background": "A boyfriend messages his girlfriend to apologize and clarify that being flustered by her charismatic mother doesn’t mean he prefers her, after the girlfriend is upset by his apparent crush on her mom.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey Em, are you feeling better ?\"}, {\"speaker\": \"Speaker A\", \"text\": \"I want to apologize again. I like you. I promise on my life that I'm not some kind of sick freak. I may be an idiot sometimes, but I'm not a full-on weirdo. Yes, I acted weird last Saturday, and you have every right to be upset. Your mom is a very interesting lady, and I was flustered. But it doesn't mean what you think it means.\"}, {\"speaker\": \"Speaker A\", \"text\": \"You're gorgeous, so it's no surprise that your mom is pretty. I like you as you are. I don't want you to act like your mom. I'm sorry if I'm explaining it poorly. Anyway, I'll give you your space. Goodnight Emily.\"}]}"
    },
    {
        "SubmissionID": "1nz3hsm",
        "URL": "https://i.redd.it/kua0wr29odtf1.jpeg",
        "Title": "AIO my boyfriend cheated on me with my entire family.",
        "Body": "AIO?? My boyfriend named Eugene and I have been dating for 2 days and we have already moved in together because we are so in love!! ❤️ he works as a Brazilian strip dancer and he forced me to share all of my assets with him. Every night he goes out to the strip club and comes home to shoot me with an AK47 every day. But he is such a good man, once he gave me some gum in class (it was already chewed but it still had some flavoring left on it.) ",
        "BestComment": "My bf killed my family, AIO?!?",
        "Topic": "Emotional Abuse",
    "Background": "In an exaggerated, darkly comedic chat, a boyfriend tells his partner he cheated with her parents, says he hates her, and orders her to clean up his mess while she pleads with him not to leave.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Heyyy babe how are you doing??\"}, {\"speaker\": \"Speaker B\", \"text\": \"I cheated on you with your mom, sister, and your dad. I hate you and I hope you would cease to exist.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Btw I shat on the floor and pissed in the bed so clean it up like the terrible house wife you are.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Wait baby please don’t I’m sorry!!!\"}]}"
    },
    {
        "SubmissionID": "1knon8t",
        "URL": "https://www.reddit.com/gallery/1knon8t",
        "Title": "Update: Am I overreacting?",
        "Body": "sorry if the title is vague. this is an update to a post i made two days ago about how my friend texted  me to pick him up for school, and after i had drove to where lived, he ditched me and got another ride without telling me. that post blew tf up, so thank you for guys for that. it's not important to my situation but someone at my school, or more like a group of people, found my post and realized it was me, i guess from my post prior to the one this one is an update to (cuz it included a partial picture of me/ my ex gf)\n\nduring the time after the incident between me and my friend happened, i told some of my other friends about what happened. they was supporting me, they said my friend was being weird for what he did, and that gave me a lot of security yk. my friends still have my back, even if this dude isnt doing that\n\nbut after what he said in these text messages, im not sure if i wanna be associated with him again. he just refuses to take any type of blame for what he did, he just saying he's always been like this, blah blah blah. that doesn't help his case at all either, he's just saying he's always been an AHole rather than just becoming one now. half the people in my last post were saying i had no backbone for not splitting up with bro right away. after what he texted me, i've been thinking, and i think i will probably part ways with him for the foreseeable future. the stuff that happens because of it will be something i have to deal with down the road yk",
        "BestComment": "your friend is an absolute loser who tries to compensate by being a “nonchalant king” lol run",
        "Topic": "Gaslighting",
    "Background": "A teen confronts his friend for leaving him waiting for a ride, while the friend reframes it as a misunderstanding, blames him for waiting, and insists he has always been this way rather than acknowledging change.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"no\"}, {\"speaker\": \"Speaker B\", \"text\": \"yes\"}, {\"speaker\": \"Speaker A\", \"text\": \"I want you to just tell me why you've been acting so mean towards me these past two weeks\"}, {\"speaker\": \"Speaker A\", \"text\": \"you changed\"}, {\"speaker\": \"Speaker B\", \"text\": \"I haven't\"}, {\"speaker\": \"Speaker A\", \"text\": \"bro yes have its clear as day even to you\"}, {\"speaker\": \"Speaker A\", \"text\": \"you were never this rude to me before I thought we were locked in with each other\"}, {\"speaker\": \"Speaker B\", \"text\": \"how have I been rude to u?\"}, {\"speaker\": \"Speaker B\", \"text\": \"that shit yesterday was a misunderstanding I told u\"}, {\"speaker\": \"Speaker A\", \"text\": \"no it wasn't you didn't explain why you didn't just tell me you had a ride\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'd not even force u or anything to drive u why you wait so long\"}, {\"speaker\": \"Speaker B\", \"text\": \"just leave\"}, {\"speaker\": \"Speaker A\", \"text\": \"that would've cleared everything up but instead I waited for like half an hour\"}, {\"speaker\": \"Speaker B\", \"text\": \"cuz I told you I was busy\"}, {\"speaker\": \"Speaker A\", \"text\": \"you can't at least tell me you had a ride?\"}, {\"speaker\": \"Speaker B\", \"text\": \"I just thought u would know I have one\"}, {\"speaker\": \"Speaker A\", \"text\": \"how the fuck am I supposed to know that for all I knew you could be taking a shower\"}, {\"speaker\": \"Speaker A\", \"text\": \"I wasn't answering my calls\"}, {\"speaker\": \"Speaker B\", \"text\": \"I ain't mean it like that if I'm not responding just assume I don't need you anymore\"}, {\"speaker\": \"Speaker B\", \"text\": \"I did not even force u or anything to drive u why you wait so long\"}, {\"speaker\": \"Speaker A\", \"text\": \"just leave\"}, {\"speaker\": \"Speaker B\", \"text\": \"this is exactly what I'm talking about why is it all my fault?\"}, {\"speaker\": \"Speaker B\", \"text\": \"i ain't saying ur fault\"}, {\"speaker\": \"Speaker A\", \"text\": \"all i'm saying is that's not my fault too in not trying to be rude per purpose or sum\"}, {\"speaker\": \"Speaker A\", \"text\": \"ok fine I believe you but just tell me what's wrong then\"}, {\"speaker\": \"Speaker B\", \"text\": \"or not what's wrong per say but why have you been acting different\"}, {\"speaker\": \"Speaker B\", \"text\": \"for the last I did not change on dead homies\"}, {\"speaker\": \"Speaker A\", \"text\": \"you just realize who I am\"}, {\"speaker\": \"Speaker B\", \"text\": \"so you're saying you're just mean always?\"}, {\"speaker\": \"Speaker B\", \"text\": \"no but i've always been this way\"}, {\"speaker\": \"Speaker B\", \"text\": \"if don't rock with it that's cool with me but i'm not gonna change\"}, {\"speaker\": \"Speaker A\", \"text\": \"if anything though u changed it shit you just been more of a pussy past year\"}, {\"speaker\": \"Speaker B\", \"text\": \"how?\"}, {\"speaker\": \"Speaker A\", \"text\": \"you just are\"}, {\"speaker\": \"Speaker A\", \"text\": \"no bro this isn't you, you were never like this even a few months ago\"}, {\"speaker\": \"Speaker B\", \"text\": \"you said we were brothers what happened\"}, {\"speaker\": \"Speaker B\", \"text\": \"nothing stop acting like something happening\"}, {\"speaker\": \"Speaker A\", \"text\": \"this is why ur girl broke up with you\"}, {\"speaker\": \"Speaker A\", \"text\": \"what\"}, {\"speaker\": \"Speaker B\", \"text\": \"I think we just need some time away from each other maybe it's just me\"}, {\"speaker\": \"Speaker A\", \"text\": \"if u realize that sooner we will be back to talking Imfo\"}, {\"speaker\": \"Speaker A\", \"text\": \"k\"}]}"
    },
    {
        "SubmissionID": "1h8339y",
        "URL": "https://www.reddit.com/gallery/1h8339y",
        "Title": "AIO/ Ex won’t leave me alone.. do I go to the police?",
        "Body": "Very long story short (even though this is still long), my ex is from out of state, we met when I lived there and I moved back home, we’d been struggling with long distance so were making plans for him to move to me. He planned a visit to come do an interview, but prior to that visit we got into a fight and he lost his mind, I didn’t think he was still coming to visit.. but he did..\n\nThis brought out a week-long drunken verbal/emotional harassment “visit” that ended in me breaking up with him and he went back to his home state. He continued to try to call me and text me, I would only respond sporadically through text to leave me alone. \n\nA few weeks later he told me during that manic week, he did in fact take the job and was still planning to move here to try to prove how much I meant to him and win me back even when I told him to stay home. He did come back, he moved in with a “friend” who lives 6 minutes down the street.\n\nFor the last few months he’s continued to try to contact me. I made the mistake of meeting up with him once, in public at a park, to “find closure” because I stupidly thought that would help/work.\n\nSince that day, almost two months ago, I’ve blocked over 5 numbers (which I figured out he can keep creating with an app) and 2 emails (which I learn only go to my spam folder). There’s moments where I don’t hear from him and can ignore his emails going to my spam folder, but last night he was at it again..\n\nCalling me from a no caller ID number that I can’t block, leaving me drunk voicemails. Now he’s texting me from another new number, he just “wants to talk”, I know that’s not a good idea.. \n\nUnfortunately he knows where I live, but I moved upstairs, installed a ring camera and have two exits to “escape” from if needed. I don’t want to be ignorant in thinking he won’t hurt me, I don’t think he will, he’s never been violent, his word are his weapons.. I’m trying to just ignore his efforts to contact me, I’m not sure what else to do. My therapist and doctor say to file a restraining order, I’m scared it will ramp things up worse… is that the only last option? Is there something else I can do before going to the police?",
        "BestComment": "If anything you’re underreacting! Go to the police and change your number too for good measure.",
        "Topic": "Boundary Issues",
    "Background": "An ex repeatedly sends affectionate messages saying he misses and loves his former partner despite her wanting distance, crossing her stated boundaries after a breakup.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I love you. I hope things are better for...\"}, {\"speaker\": \"Speaker A\", \"text\": \"I really miss you so much\"}, {\"speaker\": \"Speaker A\", \"text\": \"Please call me\"}, {\"speaker\": \"Speaker A\", \"text\": \"Can you call me to talk please\"}, {\"speaker\": \"Speaker A\", \"text\": \"I wish we could have spent today together\"}]}"
    },
    {
        "SubmissionID": "1k9ay0r",
        "URL": "https://www.reddit.com/gallery/1k9ay0r",
        "Title": "AIO for ending my 6 year relationship over these messages?",
        "Body": "For context: my boyfriend and I have been together for 6 years, we have a house together and we have children together. He went out one night with coworkers and got really drunk and then this girl sent me these screenshots of their messages (she is blue and he is white) from that night. We have already discussed multiple times that his drinking bothers me, once he starts he can’t stop kind of guy. I’ve asked him to get help or just stop drinking because it bothers me but he hasn’t taken me seriously. \n\nI feel so betrayed and disgusted, also, I’m 4 month postpartum with our youngest child. He shouldn’t even be entertaining another woman, whether he remembers it or not. \n\nI just don’t really know what to do or if I’m over reacting for thinking that I need to end our relationship and that I can’t move on from this. ",
        "BestComment": "just be glad she sent these to you. imagine how many girls didn’t/couldn’t. \n\nyou deserve better but if you don’t care about that, your children deserve better. it would be better to raise them alone than in a loveless marriage (edit:relationship*)",
        "Topic": "Boundary Issues",
    "Background": "A long-term partner’s drunken messages to another woman about hanging out, with no mention of his relationship, highlight infidelity and violated relationship boundaries.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"K wtf\"}, {\"speaker\": \"Speaker B\", \"text\": \"Wanna hang out?\"}, {\"speaker\": \"Speaker B\", \"text\": \"I do actually\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ahh ok and how do u know me? Cuz I don't live anywhere near there I'm in\"}, {\"speaker\": \"Speaker B\", \"text\": \"We hung out in [REDACTED] before. With too hottie lol his friend\"}, {\"speaker\": \"Speaker A\", \"text\": \"I don't remember this at all lol are u sure it was me and not my sister\"}, {\"speaker\": \"Speaker B\", \"text\": \"That's fair! I'm sure because I turned down [REDACTED] too hottie his friend\"}]}"
    },
    {
        "SubmissionID": "1hyox1p",
        "URL": "https://i.redd.it/ba4x8xwtuace1.jpeg",
        "Title": "AIO GF used exs phone to text me",
        "Body": null,
        "BestComment": "imo its kinda weird that she’d even text u that in the first place. its like she purposely wanted to let u know she was with him",
        "Topic": "Boundary Issues",
    "Background": "A girlfriend uses her ex’s phone to text her current boyfriend and downplays hanging out with the ex as no big deal, while he points out she would be furious if he did the same.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"Hey baby it's my phone died and I'm using [REDACTED] to let you know I'm okay love you so much ❤️\"}, {\"speaker\": \"Speaker A\", \"text\": \"Wtf why are you using [REDACTED] phone? Why is he even with you? Thought you were supposed to be with [REDACTED]?\"}, {\"speaker\": \"Speaker B\", \"text\": \"It's not that big of a deal we seen him while walking around so he started hanging out with us, and she was at the restrooms so I couldn't so I just used his [REDACTED]\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's not THAT big of a deal?? You're hanging out with ur ex. If I just all of a sudden started hanging out with my ex you would've flipped shit. Let me go hang out with my ex since it's 'not that big of a deal'\"}, {\"speaker\": \"Speaker B\", \"text\": \"Whatever 😂 its not like i planned hanging with him anyways stop being mad for no reason\"}, {\"speaker\": \"Speaker A\", \"text\": \"Lmao ight I'll talk to you later.\"}]}"
    },
    {
        "SubmissionID": "1msv0ts",
        "URL": "https://i.redd.it/nm7r97kstljf1.jpeg",
        "Title": "AIO for confronting my friend (TW SA)about her bf that’s on the SO list in our town",
        "Body": "Am I overreacting for confronting my friend? \nWe have been friends for a short time and I always had a weird feeling about her bf, I’ve never met him but the way she talks about him concerns me.- someone I went to school with was convinced of SA and I had viewed the list and there was the person I went to school with… AND THIS GIRLS BF so I confronted her. \nWe had gotten into arguments about me over hearing him on the phone DEMANDING my number,to meet me, to meet my bf and have me on social media. I put my foot down and said absolutely not so she said that was fine. But later on she told me they’d gotten into a disagreement over me refusing. AM I OVERREACTING FOR CONFRONTING HER????!!!!!!",
        "BestComment": "NOR.  One of my coworkers has a bf that was convicted after a pedophile ring was exposed near me… and she’s still with him.  My other coworkers and I don’t talk to her anymore.  I suggest not associating with people like this.",
        "Topic": "Gaslighting",
    "Background": "One friend confronts another about her partner being on the sex offender registry, and the friend responds that it wasn’t her information to share and insists he doesn’t look at minors that way, minimizing the risk.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"He only on it for 1/2 more yrs then hes off the list\"}, {\"speaker\": \"Speaker B\", \"text\": \"So does my mother\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ok I let everyone know bc I had found it after someone I went to school with got convinced as well\"}, {\"speaker\": \"Speaker A\", \"text\": \"So I wanted to tell everyone up front and ask\"}, {\"speaker\": \"Speaker B\", \"text\": \"That wasn't yours to share but Okay\"}, {\"speaker\": \"Speaker B\", \"text\": \"He doesn't look at minors that way\"}, {\"speaker\": \"Speaker A\", \"text\": \"For one it's public information and I was worried about [REDACTED] and the kids so yes I was going to share and for 2 you weren't up front about that with me when I started coming over when he moved in I understand where you're coming from but it makes me uncomfortable because you didn't tell me\"}, {\"speaker\": \"Speaker A\", \"text\": \"And I understand he doesn't look at them like that rape is of all ages\"}]}"
    },
    {
        "SubmissionID": "1iquepb",
        "URL": "https://i.redd.it/w7stww3dqije1.jpeg",
        "Title": "AIO GI nurse found my instagram and emailed me",
        "Body": "a few weeks back i went to my follow up appointment with my GI doctor at his clinic. i was with my baby (10 month old) and was placed in a room by this guy who looked similar to my age. it was such a short interaction that i didn’t think much of. we were both friendly and polite, just smiling, saying thank you/you’re welcome for bringing me to my room.\n\ni look at my email today and see he emailed me. the title is the GI clinic address so i thought it might have been about some tests i need to do, but it’s actually sent to my makeup business email. you would have to find my instagram and go to my makeup accounts page through my bio and then from there find the contact info. i’m a bit lost on whether i should respond back or just ignore it. i am married and had my baby with me (which i think alone would have deterred anyone from assuming im single). i feel a bit uncomfortable and feel as though as a professional he shouldn’t be reaching out to me, but i honestly don’t know what to do. am i overreacting? ",
        "BestComment": "If they're in Canada that's actually illegal. I'm a nurse and unless there's written or verbal consent to contact you via your cell phone, then this is a violation.",
        "Topic": "Boundary Issues",
    "Background": "A GI clinic worker tracks down a patient’s business email from Instagram and cold-emails to ask her out, blurring professional boundaries despite her being married and having a baby.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hello,\"}, {\"speaker\": \"Speaker A\", \"text\": \"I am sorry, this is very direct. I tried to follow you on IG. We met at [REDACTED], in GI clinic. I regret that I didn't get your number or asked you out if you're single.\"}, {\"speaker\": \"Speaker A\", \"text\": \"P.S. I am clearly not desperate here lol\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yours,\"}, {\"speaker\": \"Speaker A\", \"text\": \"The guy who roomed you,\"}, {\"speaker\": \"Speaker A\", \"text\": \"Sent from my iPhone\"}]}"
    },
    {
        "SubmissionID": "1nuxhur",
        "URL": "https://www.reddit.com/gallery/1nuxhur",
        "Title": "AIO for thinking my date is being way too intense about where this is going?",
        "Body": "I’m 29F. Two years ago I ended a five-year relationship, and it really took me a long time to heal. I told myself I’d take it slow before diving into anything new.\nI’ve been seeing this guy (28M) for about a month. He’s fun and attentive, but last night at 1AM he sent me a long string of messages accusing me of not really wanting him, saying I’m “stuck in the past,” and even that I “need a therapist not him.”\nThe thing is, he’s not completely wrong—I am cautious, and I don’t always stay over or make a ton of time mid-week. But the way he came at me felt aggressive and kind of cruel.\nAm I overreacting for thinking this is a red flag, or is this just his frustration showing because he wants more than I can give right now?",
        "BestComment": "If someone txts me at 1am with this kind of shiz, I would be shutting that crap down straight away!",
        "Topic": "Emotional Abuse",
    "Background": "A new dating partner sends a late-night tirade accusing her of being stuck on her ex and telling her she needs a therapist instead of him when she reiterates she needs time.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I was asleep\"}, {\"speaker\": \"Speaker A\", \"text\": \"that's not fair.\"}, {\"speaker\": \"Speaker B\", \"text\": \"fair?? FAIR?? u think it's fair i'm here putting in all the effort and u still act like i'm some stranger.\"}, {\"speaker\": \"Speaker B\", \"text\": \"ur ex broke up with u TWO YEARS ago. how long am i supposed to wait? how long til u actually let someone in?\"}, {\"speaker\": \"Speaker A\", \"text\": \"i told u i need time.\"}, {\"speaker\": \"Speaker B\", \"text\": \"time time time. it's always time. at this point u don't need me, u need a therapist.\"}]}"
    },
    {
        "SubmissionID": "1j3pmqr",
        "URL": "https://www.reddit.com/gallery/1j3pmqr",
        "Title": "AIO? My ex says she didn’t cheat",
        "Body": "so basically I (m31) have been with my x (f28) for 11 years we have a son whose almost 2 this she left me december 28th. but after I found out she had been sleeping with a co worker for about 6 months. \nshe says it wasn’t cheating because she knew the relationship was done. \nI say it 100% was because even though we were going through a very rough patch I still was doing everything in my power to keep us together, took us on vacations, we still did EVERYTHING as a family including thanksgiving and christmas. I still paid a very large portion of her bills and supported her. \n\nshe won’t admit it but i’m almost positive she didn’t leave to keep a roof over her and her sister and her sisters boyfriends heads (they’ve lived with us a little over a year and a half at that point) \n\ncome to also find out that her whole family knew about this guy and no one said anything while I attended family events blissfully stupid. \n\nso basically I wanna know AIO when i’m furious and hurt beyond belief by people I thought were my family? AIO for wanting to fuck that dude up? I literally feel like my family was ripped away from me ",
        "BestComment": "NOR, slimy ass family through and through. seems you provided for not only her but her family member and their partner as well and they knew the whole time. \n\nNOR for wanting to fuck dude up but if you do know charges will follow.",
        "Topic": "Gaslighting",
    "Background": "An ex who had a long-term partner and child insists she is loyal and defends the affair partner by saying he didn’t know, reframing her months-long cheating as not really cheating.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"I'm a loyal person\"}, {\"speaker\": \"Speaker A\", \"text\": \"it was like all of a sudden gravity was gone or the air in my lungs didn't give me oxygen\"}, {\"speaker\": \"Speaker A\", \"text\": \"how can you say that? it's the most definitive moment of character\"}, {\"speaker\": \"Speaker A\", \"text\": \"it's what you choose to do with this knowing 100% that our sons best interests is well before our own\"}, {\"speaker\": \"Speaker B\", \"text\": \"idk why you hate him so much. he never had a commitment to you. he never thought i was w/ you at the same time. he knew i still lived at home w/ my baby daddy but i ended things & i needed to get out.\"}, {\"speaker\": \"Speaker B\", \"text\": \"leave him out of it too\"}]}"
    },
    {
        "SubmissionID": "1mkt886",
        "URL": "https://i.redd.it/zw1w5ec6cshf1.png",
        "Title": "AIO about coworker making rude comments about my kippah",
        "Body": "So for some added context I work as a custodian/janitor at a hospital on 1st shift, V has never liked me or the entire 1st shift crew. She's known for being extremely rude to those on her own shift, enough to make several people quit. She will walk into the office, and make backhanded comments about how it smells bad, or nobody must've done work today since theres rooms written on the board. She has slammed the office door mere inches behind me as Ive walked out of the office. For weeks she would come to departments we'd be working in just to mess with garbage carts, or equally infuriating, she'd stand at the end of a hallway and just absolutely glare at me. I have brought up the off the clock shenanigans, as well as not being comfortable with the way she acts around me or treats me. Absolutely nothing happens to her, she's continued her comments when she walks in to the office. Ive put up with it as I've come to the conclusion there is no point telling my boss as it's never worked in the past. \nI am a hat dude, I tend to always cover my head. I am also Jewish, not super Orthodox by any means, but while working here, I used to wear a baseball cap to keep chemicals away from my scalp. I dont go around talking about religion with people as that's their own business, and I tend to keep mine personal as I had some upsetting moments involving others knowing my religious background in the past. Well, somebody \"anonymously\" complained about the hats at work, claiming they looked unprofessional, so one day it said \"No hats as per policy\" on the board in the office. Now I've read the policy and never saw anything to that order, but that's not my battle to fight in the grand scheme of things. Due to that, I o stopped wearing a baseball cap and started wearing my yarmulke (kippah) to work instead. I've worked here for a few years now so I felt comfortable enough to wear it around my coworkers. Boss is fine with it as he recognizes it's religious, not had an issue with it at all. \n\nThe other day, V walks in, makes comments about how it smells so bad in the office, a coworker was showing me something on their phone, and V just walks between her and I like we weren't there. My coworker and I ignored her, then left the office. While leaving the office, I got to hear V telling one of her coworkers  who I will refer to as Kelly,(who is actually quite a nice individual)  \"That's just stupid. That hat is stupid\" I started to walk away faster as I did not want to be around that, I even heard Kelly tell V it was a religious thing, and V doubled down saying it was stupid. I didnt hear much more after that as my hearing isn't great and I was making distance. I messaged my Boss, immediately after the fact as he had just walked in shortly after I heard this interaction. The images show the following texts between my boss and I.\n\nIt seems no matter what he seems to defend her, she never stopped glaring at me or making comments. When she was turned in for being in our departments while she was off the clock (big no no) he told us \"Oh she's just the type she likes to get stuff ready early.\" I've not wanted to go to HR as I get along with my boss and don't want him to feel like I went over his head with stuff, but I am at my last straw. What should I do? If I was too vague or confusing please feel free to ask me to clear it up and I'll do my best. ",
        "BestComment": "This is a hostile workplace environment. You need to report and document this with HR. Your supervisor has failed to intervene. You probably have an EEO complaint. Things like this can result in significant civil settlements to the aggrieved party when employers fail to take appropriate action. Also, her presence in areas of the hospital where she is not working is problematic. It’s a hospital, not a mall to mosey through at will. It’s a secure facility with private information, potent drugs, expensive equipment, dangerous off limits areas, and delicate procedures taking place. She can’t stalk you around before shift.",
        "Topic": "Emotional Abuse",
    "Background": "A hospital coworker calls a Jewish employee’s kippah stupid and mocks it, while the boss explains she supposedly didn’t know what it was, minimizing the impact of the insults.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Okay I'll call in a second we're loading a uhaul\"}, {\"speaker\": \"Speaker A\", \"text\": \"Hey Boss sorry to bother you as you just showed up. But I REALLY do not need to hear talking about how my hat is stupid.\"}, {\"speaker\": \"Speaker A\", \"text\": \"even said it's a religious thing but she still has to mention how it's stupid.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Addressing it soon, it was already brought to my attention.\"}, {\"speaker\": \"Speaker B\", \"text\": \"and I met with [REDACTED] and like others, she thought you were wearing it in retaliation of no hats. She claims she honestly didn't know what it was.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Sometimes us older generations are blind to the world or were never taught about many things in this world. Sorry this happened.\"}]}"
    },
    {
        "SubmissionID": "1nihrqp",
        "URL": "https://www.reddit.com/gallery/1nihrqp",
        "Title": "AIO not wanting to drive 4 hours after how I was treated",
        "Body": "Basically my mom has been getting jealous that my boyfriend’s parents see our sons more (they are retired) my mom works 40+ hours a week. Both parents live 4 hours away from us. I don’t know what to do or say anymore. It makes me really sad because I want to have a relationship with my mom but she is too hurtful. It feels like nothing I do is good enough.\n\nI was hurt all last week because she said they’d come visit, I suggested one thing so she could spend more time with her grandkids and that made her decide she’d just go to our hometown instead. Both 4 hours from where she lives now, so she would have traveled the same distance had she come to my house. \n\nThen she randomly texts me a week later & acts like she didn’t just do that and expects me to come drive 4 hours to her? \n\nFirst text photos are from a time when we drove to our hometown, I told her we were doing this weeks before and she texted me at 1AM trying to make a plan for that day. Thought including it would give you a better idea on how she acts like this all the time and later pretends like it never happened \n\nI tried setting a clear boundary last night but any advice would be appreciated \n\nThoughts?? I feel crazy\n",
        "BestComment": "OP says driving four hours is too much of an imposition. OP implies it’s not an imposition for her full-time working mother because she drives other places(?).\n\nOP’s mother says OK, I’ll come to you and get a hotel room. OP says no, hotels are expensive and you really just need to board your dog regardless(?).\n\nOP’s mother tries again and generously says OK, if you want to come to me, I’ll pay your whole way.\n\nOP says this is offensive and she needs “consistently respectful interactions” or she will destroy her mother’s relationship with her grandchildren.\n\nAnd y’all are on here cheering OP on? Sick. Absolutely sick.",
        "Topic": "Emotional Abuse",
    "Background": "A mother guilt-trips her adult daughter with texts about hurt grandma feelings, preferred family, and how she was raised, after changing travel plans and then offering to cover costs if her daughter comes instead.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"I'm glad we deserve an hour of your time. Thank you\"}, {\"speaker\": \"Speaker B\", \"text\": \"Sucks you even brought the baby to see [REDACTED]\"}, {\"speaker\": \"Speaker B\", \"text\": \"No wonder grandma's feelings are hurt. I hope you never get treated this way\"}, {\"speaker\": \"Speaker B\", \"text\": \"Been here since Friday, wow despite what you think I did raise you better than that\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hope you and the babies are doing good. Love you\"}, {\"speaker\": \"Speaker A\", \"text\": \"Love you too\"}, {\"speaker\": \"Speaker B\", \"text\": \"So I think your sister and I will come down tomorrow till Thursday morning. I'm going to get a room till cause I have to bring Lucy\"}, {\"speaker\": \"Speaker A\", \"text\": \"Why don't take her to a doggy day care?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Might be cheaper than staying at a hotel then u guys can sleep here.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I found a room for $60 a night. I'd rather not leave her at a random place.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Just like I'm sure you wouldn't do with the boys by herself.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Might be more fun for her than being in a hotel by herself.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't plan on leaving her in the hotel in the park and stuff. I'm not planning on just sitting at your apartment.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Maybe it's a bad idea coming down\"}, {\"speaker\": \"Speaker B\", \"text\": \"I think we'll just go to [REDACTED] instead.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Lucy isn't an inconvenience for me since it seems to be for you I will just go elsewhere, not a big deal.\"}, {\"speaker\": \"Speaker B\", \"text\": \"You've made it abundantly clear that we will leave at that time.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Enjoy your preferred family.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I was just making a suggestion not saying you dog in the apartment I'm sorry.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Not blaming you.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I know where your home is. You've never spent much time there.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Your home and I have been very clear about how we want things to be.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Since you started dating... that's been the only thing important. Even in FL.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hope you and the boys are doing well. Love and miss you guys.\"}, {\"speaker\": \"Speaker B\", \"text\": \"If you're interested in maybe coming up next week with the boys I'll cover the cost of gas and ferry.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I don't appreciate how you've been treating me.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm not acting like nothing happened. Believe it or not, I feel like I'm still getting over the whole thing.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I hear that you feel hurt but that does not justify spending time with someone who doesn't respect you.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Let's focus on building that respect moving forward.\"}]}"
    },
    {
        "SubmissionID": "1l6f25k",
        "URL": "https://i.redd.it/g9i29ze8up5f1.png",
        "Title": "AIO for wanting to uninvite this guy to a bachelor party because of his behavior?",
        "Body": "A close friend asked me to be a groomsman for his wedding, and I was honored to say yes. Since January, the best man and I have been planning the bachelor party. Because the groom has struggled with cocaine in the past and is now clean, we were careful about who we invited. We excluded some old friends still involved with drugs to avoid temptation and out of respect for the groom and his fiancée.\n\nWe did include one old friend, let’s call him Tom, who still uses, but made it very clear that there would be zero tolerance for drug use at the party. He agreed completely.\n\nBy March, we’d planned the events: golf, go-karts, bowling, and a night out with a party bus. One friend generously covered a luxury suite ($1,500), and another covered the party bus ($1,500). The remaining 10 of us (excluding the groom and the two who paid for the big items) were asked to contribute $300 each into a “party fund” to cover everything else: activities, drinks, food, and a group wedding gift or refunds of leftover money. I kept everything transparent with an anonymous tracking sheet.\n\nEveryone was on board. One person couldn’t afford it, and another covered his share. Most people paid early. I only had to remind a couple of people, and they paid quickly.\n\nThe only exception was Tom. Even though he was one of the first to agree to the plan, when I followed up with him two weeks ago, he acted strangely. I let him know we were collecting money and he still hadn’t sent his. He replied with “I’ll send you your money, relax.” I calmly gave him the details and said we needed final numbers by the Friday before the party.\n\nThat Friday came, and still no payment. I checked in with another friend, who advised I just tell Tom that if he wasn’t contributing, he’d have to pay for his own stuff. I passed that message along. In return, I got called a “fuck face” and a “bachelor party Nazi.”\n\nI want to stress: I only reached out twice, politely. Meanwhile, everyone else has been cooperative, thankful, and respectful. We’ve worked hard to make this a great, low-stress weekend, and being insulted like that makes me wonder if we should even have Tom come at all.\n\ntldr; guy agreed to contribute to a bachelor party we were organizing, proceeds to be difficult and send extremely disrespectful replies which makes me want to uninvite him. ",
        "BestComment": "WOW. Tell him he doesn’t need to go any longer.. he’s not welcome. That was extremely rude and uncalled for verbiage. You did everything correctly and he insulted you for just trying to keep everything organized. NOR",
        "Topic": "Emotional Abuse",
    "Background": "When asked to confirm whether he’s contributing to a shared bachelor-party fund, a friend responds by calling the organizer a fuck face and “bachelor party nazi” rather than discussing money.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey there dude how's it going?\"}, {\"speaker\": \"Speaker A\", \"text\": \"I know you said you wanted to contribute the fund and we are a week away. Is that still something you wanna do or do you wanna just pay for what you take. Makes it a lot harder for us but it's your choice\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hey fuck face. I'm going to send you the money now so you can get off my back.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Bachelor party nazi.\"}]}"
    },
    {
        "SubmissionID": "1g5umes",
        "URL": "https://i.redd.it/a8qpedmsccvd1.jpeg",
        "Title": "AIO I feel like I’m half right / half wrong here",
        "Body": "I have a really good background in the culinary field, and I understand sometimes you’re expected to do free work - like above states, to see if I can cook ~proteins properly. But that’s it, just proteins. I’ve grilled protein before as part of my interview and when it was a stage it was paid..\n\nIf I conceptualize two plates it’ll take me an hour of unpaid work, cooking the two proteins alone would be 10 minutes which I originally had zero problems with. I feel like I’m just going there to make lunch for the chefs 😭 or maybe I’m over my head and being entitled? \n\nI’ve worked at country clubs, mom & pop shops, cafe’s and fine dining establishments. And never had to conceptualize ~two dishes for free. \n\nAnd his “don’t overthink it” comment really irked me the wrong way but this is the TOM for me 🙂‍↔️😮‍💨",
        "BestComment": "Update: \n\nHe has texted me twice since. \n“Are you really going to turn down a great opportunity because you’re worried about $19?” \n(I value my time) and that’s not the rate he promised. I texted him back with the correct rate and again that I’m just turning the position down. He responds with a rate that’s a dollar less than what he communicated in the interview originally. “This is the rate I offered”. No it’s not \n🤦🏼‍♀️ \nWhy is it so wild that I’d like to be paid for the hour of work I’m going to do? This wasn’t my response to him just a simple thought. \n“You’re more worried about getting paid than securing a job” \nI have a job? He knows this and I’m looking to get a second job. Fire response though.\n\nNow I know I made the right decision, as an executive chef after someone respectfully declines a position I wouldn’t even bother texting them again. Sheesh.",
        "Topic": "Manipulation and Control",
    "Background": "A chef candidate pushes back on doing unpaid full-plate test dishes, and the hiring chef insists it’s only an hour and a requirement, implying she must comply if she wants the job.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"You'd like me to prepare the two proteins, is that JUST the proteins? I remember in our interview you mentioned making an appetizer possibly out of them, so I'm a little confused. And I cooking just proteins or creating a plate out of them? Thanks in advance.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Complete plates not just the proteins. I just want to make sure you can cook things properly and to the right temperature. Don't over think it\"}, {\"speaker\": \"Speaker A\", \"text\": \"I understand, and respectfully I'm not overthinking it. But even roasting vegetables takes around 30 minutes so I'm thinking of my time.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I would understand cooking the proteins but full plates without pay isn't something I'm interested in, I hope you find the right candidate!\"}, {\"speaker\": \"Speaker B\", \"text\": \"Then i guess you are interested in working here. Its a requirement. Its one hour of your time so i can see if you know how to cook. Nobody has ever had a problem with it. Good luck!\"}]}"
    },
    {
        "SubmissionID": "1mfhauy",
        "URL": "https://i.redd.it/gfaasrm18jgf1.png",
        "Title": "AIO over my friend's reaction to me not liking cars? Am I going insane?",
        "Body": "So, of course this is not all of my interaction, but this is basically what this whole thing is about. He was telling me how I haven't tried good cars yet and that's why I'm not interested in them. He also told me that my opinion would piss off other car guys around the world.\n\nAm I, like, actually insane right now?",
        "BestComment": "Dude sounds dumb. You’ll meet more open minded people as you get older. Cars are tools for transportation. Some look “cooler” than others and some go faster than others. But they all do the same thing. I bet he’s one of those 18 year olds who spends all their money on a 2018 dodge charger and still lives with his parents and brags about his car like he’s successful or something. Don’t let it get to you and don’t be influenced by that type of behavior.",
        "Topic": "Emotional Abuse",
    "Background": "A friend pressures someone about not liking cars, calling their stance weird and saying pretty much everyone wants an expensive car, dismissing their preferences as abnormal.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Yea but like Cars r liked universally Its legit one of the most common interests in the wrld\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ur speed Bru 😂😂😂 Yk wut pissed me off tho U saying u dont want an expensive car :/\"}, {\"speaker\": \"Speaker B\", \"text\": \"Okay too bad Who the hell doesn't bru\"}, {\"speaker\": \"Speaker B\", \"text\": \"This is actually so weird, I hope you realize that\"}]}"
    },
    {
        "SubmissionID": "1lxqplc",
        "URL": "https://i.redd.it/85242t4x6dcf1.jpeg",
        "Title": "AIO — long distance texting/dating",
        "Body": "Chat why i feel like this man just be straight up lying ???? \n\nok so i met him online on a facebook i made a comment on a funny post he liked it replied he sent me a friend request i accepted we hit it off blah blah Gen Z love blah blah wtv \n\nWe’re both 20 years old He lives in Indiana and Im moving to New York but i live in the caribbean (big bummer) so its long distance and we have so much in common but its feel way too good to be true and i dont wanna be delusional or get attached quickly but you cant \nhold nothing pass men in this time and age cause they would back door you and do you so dirty just for the fun of it.. should i be honest and tell him that i feel this way or just— idk ",
        "BestComment": "\"Dada\" and \"papa\" oh hell nah wht typa ageplay shit is this",
        "Topic": "Boundary Issues",
    "Background": "A long-distance love interest casually calls her “ma” and jokes that his niece had his phone watching cocomelon, feeding her doubts about whether he’s being honest and emotionally safe.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"My bad I'm inna shower again ma\"}, {\"speaker\": \"Speaker A\", \"text\": \"sighhhhhh u busy papa?\"}, {\"speaker\": \"Speaker A\", \"text\": \"let me see\"}, {\"speaker\": \"Speaker B\", \"text\": \"My niece had my phone on cocoa melon yo lil freak ass😂😂😂\"}]}"
    },
    {
        "SubmissionID": "1hudbe7",
        "URL": "https://i.redd.it/qo8posa0w7be1.jpeg",
        "Title": "Am I overreacting by going bat shit crazy when I found this? I think this is extremely intimate,but,I’m so confused and unconfident.  I need opinions because I am and have been gaslit into questioning my own judgement. ",
        "Body": null,
        "BestComment": "Would your partner be ok with you texting someone like that? If the answer is no, then you have your answer. You imo are not overreacting.",
        "Topic": "Boundary Issues",
    "Background": "Two people exchange flirty compliments about each other’s looks and staying in touch, raising questions about emotional fidelity and what’s appropriate when in a relationship.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Anything for you. Anytime you're in town let me know\"}, {\"speaker\": \"Speaker B\", \"text\": \"You looked mighty fine!\"}, {\"speaker\": \"Speaker A\", \"text\": \"Lol you're too kind you looked hot as ever 😍 please stay in touch\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hey! I hear you are RCS me...\"}]}"
    },
    {
        "SubmissionID": "1i7vwgt",
        "URL": "https://www.reddit.com/gallery/1i7vwgt",
        "Title": "AIO by not wanting my ex to send me random selfies??",
        "Body": "So, this argument happened months ago at this point, but it's been pretty consistently bugging me since then, so I need to know if I was actually the one that was being unreasonable here. For context, me and this person had been broken up for a couple of years at this point. The relationship had been very serious and it was a pretty messy breakup, but we tried at least a few times to still be friends. At the time this argument happened, we had just started talking again after almost a year of no contact because of another, different, fight we had, and we'd only been talking again for a couple of days. In this short time span, he sent me at least three different selfies with absolutely NO context. No words, nothing meaningful that was actually worth responding to, not even an attempt to look good so it wasn't a matter of fishing for compliments. I've ALWAYS been the type to think it's ridiculous to do that, and I usually just ignore stuff like that when it gets sent to me and most people get the hint and stop doing that, but I knew that he wasn't going to stop unless I actually said something about it because he does that sort of thing so frequently. As you can see in the first screenshot, he did it to me TWICE in the span of only one hour, and I know that he did it at least one more time before those screenshots.\nThe reason this has been bothering me for so long is because I sent the screenshots to a few different friends at the time to get their opinions, and while most of them were very much on my side, ONE of them asked me why the hell I'm even talking to him on Snapchat if I DON'T want to get random selfies, and said that that's how most people use Snapchat and it shouldn't be such a big deal to me. I only even use Snapchat because it's what so many of my friends prefer for some godawful reason, but most of my friends know that I don't like being spammed with unnecessary selfies and don't send me anything unless they have something worthwhile to say, and I feel like he should be able to understand if I just don't want to see that sort of thing. It's not like me seeing his face was horribly upsetting to me or anything because I'm over the relationship entirely and there aren't any lingering romantic feelings, but now that I'm not madly and hopelessly in love with him, I just don't find it cute and adorable anymore when he does that sort of thing. When we were IN the relationship, my response to his random nonsensical selfies was always \"awww look at him being all adorable and looking for attention\" but after the breakup, all I can think about is \"okay? What exactly do you expect me to do with this? You've given me NOTHING to respond to and made me stop what I was doing and waste my time just to look at.... Your face? For no reason??\" And of course I've never actually said that because I'm not THAT much of a bitch, but I can't help feeling that way. So, am I the one that's overreacting here??",
        "BestComment": "babe.. you’re putting way too much effort into those replies and the entire convo.. just block him or unfriend him",
        "Topic": "Boundary Issues",
    "Background": "Someone who had a messy past relationship finally texts their ex that they wish them well but do not want to be friends, clearly asserting a no-contact boundary.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I wish the best for you in life, but I don't want to be friends.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm moving on. I wish the best for you in life, but I don't want to be friends.\"}]}"
    },
    {
        "SubmissionID": "1jws9ds",
        "URL": "https://i.redd.it/15upkfnb28ue1.jpeg",
        "Title": "AIO for thinking what I said was perfect and he’s being dramatic for blocking me",
        "Body": "This short conversation seems so unhinged but I’m looking for opinions. So I(F19) was in a talking stage which this guy (M20) for two months and a few hours ago he asked me this questioned and after I responded he ended up blocking me a few minutes after. I might be crazy but I feel like he was either testing me or I actually offended him from how I answered 😂😂 So AIO for this or is he \n",
        "BestComment": "Haha! I think you cooked him and he was just pissed that you didn't let him fuck you in the ass, he could also have been jacking off at that very moment and you talking about pegging him threw him off his stroke; very well played 🤣.",
        "Topic": "Boundary Issues",
        "Background": "A guy asks whether period pain hurts more than anal, and when she jokingly suggests a period simulator and pegging him, he reacts with disgust and blocks her over the sexual boundary joke.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"I have a question\"}, {\"speaker\": \"Speaker A\", \"text\": \"Go on\"}, {\"speaker\": \"Speaker B\", \"text\": \"What hurts more that period ass pain females get or receiving anal?\"}, {\"speaker\": \"Speaker A\", \"text\": \"What the fuck 😂😂\"}, {\"speaker\": \"Speaker A\", \"text\": \"How about I buy you that period simulator thingy you can try it out and then I'll peg you\"}, {\"speaker\": \"Speaker A\", \"text\": \"So you get the answer and the experience\"}, {\"speaker\": \"Speaker B\", \"text\": \"Yea nah. I'm out. You took that way too far. I asked a question I wasn't singing up for an offer to get pegged and hooked up to a torture machine\"}]}"
    },
    {
        "SubmissionID": "1n7llae",
        "URL": "https://i.redd.it/1z7j13tdlzmf1.jpeg",
        "Title": "Update AIO FOR TELLING THEIR PARENTS - MY 15F AND 19M COWORKER'S DOING IT AT WORK",
        "Body": "Update AIO FOR TELLING THEIR PARENTS - MY 15F AND 19M COWORKER'S DOING IT AT WORK\n\nI told their parents - at church wenddays night after sermon I asked in a very serious tone if we could talk in private i said \"Your childern were doing it at work, I told them to cut it out and havent told anyone else.\" his moms eyes popped out of her heads and said \"AT WORK?!\" she quickly grabbed him and they got out of there. Her parents were next and her dad just looked down at the ground. her mom just said \"okay, thank you for telling us.\" they left. That night the both of em (coworker's) sent alot of angry mean texts all night long, I had to put them on block. Thursday Morning the Bosses were in- I didn't work till 6 so this is what I heard from other coworker- So the Bosses were in and talked to 19m about \"the incident\" well he was fired. \n\nI came in at 6 and the boss talked to me about what happened and I let him know. 15f also came in at 6 and 19m had text her about what happed and after she talked to the boss (after me) she showed me the bird and left. Yes? she was fired?\nI didn't know at that time. I checked and the mean angry text were still coming. It was an uneventful shift. \n\nFriday I worked open to close with boss and it was an uneventful regular Friday. at some point the texts stoped. \n\nSaturday night I saw 19m and 15f and their family sitting together at church and nothing was said between us. \n\nSunday after church 19m and 15f with there family behind them apologized to me about overreacting. \n\nthat's all folks. ps at some point the police were involved however I just overheard that I really don't know anything else. ",
        "BestComment": "[removed]",
        "Topic": "Boundary Issues",
    "Background": "A worker states they will tell the parents of a 15-year-old and 19-year-old coworker who are audibly having sex in the workplace restroom, trying to enforce boundaries around age and workplace behavior.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"AIO FOR TELLING THEIR PARENTS - MY 15F AND 19M COWORKER'S ARE DOING IT AT WORK.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I haven't actually told yet, the 19m is the manager and I 24f told them to cut it out or I will tell their parents. This is a carryout pizza place and they were doing it in the one employee restroom and it was very audible and clear.\"}]}"
    },
    {
        "SubmissionID": "1oltbmu",
        "URL": "https://i.redd.it/c5ccywc2ioyf1.jpeg",
        "Title": "AIO or is it weird that the guy I’m dating randomly brings up other women and/or their babies (almost always girls..randomly in conversation both over text and IRL?",
        "Body": "I’ve been dating this guy I’ve known for years. We’re both 30. I got out of my only relationship about five years ago, then had a bad accident three years ago that needed foot surgery. I basically stopped dating until recently. I lost a lot of support from people during that time, but he was always just kind of there, maybe because his parents still live near mine.\n\nLately he’s been doing something that really bothers me. He keeps bringing up his female friends and their babies, always baby girls. He’ll randomly text me about them, send pictures of the babies or even ultrasound photos, and bring them up in conversations that have nothing to do with it. The one that really throws me off is a friend from grad school (I’ve never met) who had a baby girl three months ago. She hasn’t even let him visit yet, but he talks about her and the baby like he’s part of their family. It makes me uncomfortable FOR her and the baby and I’m not sure if she even knows that he’s sharing her ultrasound photos with people she doesn’t know. \n\nLast weekend we went out for breakfast and he couldn’t stop talking about how important his job is. He was checking his phone the whole time on a Sunday and bragging about volunteering to work weekends for an extra $150 to $200. When I asked if he’s a workaholic he said yes. He’s a PA, not a doctor, but the way he talks about himself feels strange. I’m not even going to mention him getting two different Broadway tix for himself rather than getting two for the same show for the both of us (mentioned in this text). \n\nAm I overreacting for feeling weird about how invested he is in these women and their babies, or would this make other people uncomfortable too?",
        "BestComment": "But i assume that you dont care about him because if you don’t answer his text in more than two days …?",
        "Topic": "Boundary Issues",
    "Background": "A man frequently talks to the woman he’s dating about other women’s babies and sends photos while also describing his own workaholic schedule, leaving her uncomfortable with where his emotional focus lies.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker B\", \"text\": \"Probably. The PAs just chose what holiday they'll take to be on-call for. I got Christmas Day.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Lighter side - I got tickets to see Mark Strong's Oedipus!\"}, {\"speaker\": \"Speaker A\", \"text\": \"That’s awesome, who are seeing it with?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Just myself. Also got a ticket for the Book of Mormon\"}, {\"speaker\": \"Speaker B\", \"text\": \"Next time, I’ll get tickets for the two of us\"}, {\"speaker\": \"Speaker B\", \"text\": \"Did u make it to Hawaii ok???\"}, {\"speaker\": \"Speaker B\", \"text\": \"How’s Hawaii? Miss u.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Paula’s little one\"}, {\"speaker\": \"Speaker B\", \"text\": \"I volunteered to assist in an emergency surgery tomorrow...I think there’s something wrong with me\"}]}"
    },
    {
        "SubmissionID": "1n0hyj1",
        "URL": "https://i.redd.it/kxo8lvsgaclf1.jpeg",
        "Title": "AIO for my bf doing this?",
        "Body": "So I (F18) and my bf (M19) have been together for about 2 and a half months now. We talk mostly but whenever hes around his friends with me his personality completely changes and he starts being mean to me and starts to avoid me and talk with other girls. Whenever i ask him at home about this he usually avoids the questions or turns the tv volume up or comes up with something else to do as an excuse to get out of the questions. His snap is full of girls and only 10 guys which are his group of friends from his football team at school. He holds hands with other girls and other stuff and then completely changes the convo whenever i ask him about this or usually just says “We’re just best friends”. The thing is he completely avoids me at school and acts like I’m a stranger to him. He ignores me and stays with other girls. I would usually dump him but Ive developed these strong feelings for him that each day grow bigger and stronger and im completely attached to him. I really dont wanna give an end to this relationship but because of all this i think i have no other choice. Its completely disrespectful to me that he does this, but also difficult for me to handle it on my own. What should I do or AIO about this?",
        "BestComment": "He's not your boyfriend.\n\nHe's just a BOY, friend.",
        "Topic": "Emotional Abuse",
    "Background": "A boyfriend tells his girlfriend he’s going out with friends, then ignores her question about why he keeps ignoring her at school, brushing her off and abruptly ending the conversation.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey, I'm going out with friends again.\"}, {\"speaker\": \"Speaker A\", \"text\": \"oh ok. Also why do u keep ignoring me at school\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'll go now, can't be late, bye.\"}]}"
    },
    {
        "SubmissionID": "1hs9imp",
        "URL": "https://www.reddit.com/gallery/1hs9imp",
        "Title": "AIO by being offended at this girl possibly suggesting Im a pedo?",
        "Body": "For backstory I have 2 kids, my youngest is 8 and my bio child with my ex, my oldest is 15 and my ex had him already when we got together, but Im the only father figure he has ever had in his life\n\nIve talked to this girl on and off several times for a few years, we have matched on a few dating sites, and we were talking about my custody agreement and how it affected holidays and she drops the line about my ex being worried Im a pedo?",
        "BestComment": "Both children are lucky to have you in their life. \n\nWell done for blocking her.",
        "Topic": "Boundary Issues",
    "Background": "A woman frames single mothers’ fear of men as a legitimate concern and questions whether his ex saw him as a potential predator, while he is shocked and pushes back on the implication.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"What? Hes 15 i've raised him since he was 2 Where did that even come from?\"}, {\"speaker\": \"Speaker A\", \"text\": \"I don't understand why you would even say they're a legitimate fear for single mother's?! I mean yea im sure but its been 13 years since i got introduced to him and we lived together for 10 years so i don't see the point of bringing that up in the current conversation\"}, {\"speaker\": \"Speaker B\", \"text\": \"When you were living together it was relevant If you're alone with the children. I think it would be relevant It was just a question\"}]}"
    },
    {
        "SubmissionID": "1h78lpl",
        "URL": "https://www.reddit.com/gallery/1h78lpl",
        "Title": "Am i overreacting ? Bf spam called me @ 6:30am ! ",
        "Body": "Basically my bf (m20) wants me (f19) to go to his 6 hour tattoo appointment despite me having things to do during the day which i told him prior. Yesterday i told him that id stay for a little bit, but leave because for 1 cannot sit still for 6 hours and 2 i have things to do ! I bring up showing up later to his tattoo appointment mostly so i can at least start on the shit i had to do, now looking back at the messages it makes no sense for me to get lunch with him and then show up to the tattoo appointment later so he was right about that and i can admit that because come on girl, what sense would it make to eat with him and not show up til later ? I did say i dont want to get lunch with him which is an asshole thing to do but he spam called me @ 6:30am and sent those rude msgs & ts left a bad taste in my mouth !! (His school starts at 6:30). The im omw was from me being woke up n not knowing what was going on) You should never take something from your partner as punishment so i can admit my fault there as well !! I just want to know if im overreacting and i should really be the one to apologize !!",
        "BestComment": "Normally I try to keep things balanced.  This guy is a fucking douchebag.  What the fuck are you even doing with him?\n\nHe treats you like a dog, he tries to manipulate you, he demeans you... and that's just on page 1 of your screenshots.  \n\nGo find yourself a real man.\n\n\"Choose people who choose you.\"\n\nGood luck.",
        "Topic": "Emotional Abuse",
    "Background": "A boyfriend spam-calls at 6:30am and sends hostile texts calling his girlfriend a piece of shit and threatening the relationship if she’s late or doesn’t stay at his long tattoo appointment.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Huh\"}, {\"speaker\": \"Speaker A\", \"text\": \"It's 12.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Why u spam calling me at 6 in the morning??\"}, {\"speaker\": \"Speaker A\", \"text\": \"Cuz u wanna be a piece of shit for no reason.\"}, {\"speaker\": \"Speaker B\", \"text\": \"U literally said I didn't have to go the whole time times.\"}, {\"speaker\": \"Speaker A\", \"text\": \"The fuck wrong with you dude.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ok why if ur trying ufucking hardest to be an asshole.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Bro never said I wasn't going but now u being rude n rly don't want to go like u said I can either show up the last few hrs or the start.\"}, {\"speaker\": \"Speaker A\", \"text\": \"U Jeep Pushing shit and lying to yeu f***ing asshole.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I said nothing one.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Now leave me alone, get lunch yourself.\"}, {\"speaker\": \"Speaker A\", \"text\": \"U air said u coming the first fee so why the fuck are u trying to change shit last minute.\"}, {\"speaker\": \"Speaker A\", \"text\": \"R u trying to purposely make shit worse?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Ur being hostile for no reason. I said I was coming. I never said when.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yes u did Stop lying u asshole.\"}, {\"speaker\": \"Speaker B\", \"text\": \"ur insulting me at 6:30 in the morning if u can reply to where i said tht, then ill apologize in stand on wit i said.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Look at that a wow Before we go.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Wow.\"}, {\"speaker\": \"Speaker A\", \"text\": \"So u going at 22.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Sure i'm leaving tho. im not staying the whole time.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Mkay u don't show up or get there late asf we done.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I went through the whole process without me, lck why ur acting like u need me now lines.\"}]}"
    },
    {
        "SubmissionID": "1om1as8",
        "URL": "https://www.reddit.com/gallery/1om1as8",
        "Title": "AIO I told my girlfriend she was being too clingy but now she’s being really distant",
        "Body": "for some backstory, I’m 25 and my girlfriend’s 24. I adore her, seriously. She’s the best thing that’s ever happened to me but we clash in one specific thing.. she’s really big on talking, hanging out often and texting throughout the day when we’re not together. my friends think it’s sweet and means she loves me but I honestly find it just a little grating. It’s gotten to a point where my frustration’s been boiling over for weeks because I seriously feel like I can’t breathe in peace without her sending me messages all the time. Anyway so my friend told me to just talk to her about it, again, im not very good at this but I tried. I told her I was picking her up and told her I couldn’t take her clinginess. That I need breathing space, it’s exhausting to keep up with her and I feel smothered. My girlfriend’s a really timid woman, it took me a while just to get her to come out with me and now it feels like she’s reverted to that. She got quiet and said she was sorry and that she’d give me space but now she’s not talking to me at all. Not unless I text her and even then she responds really shortly. I didn’t tell her to vanish from my life, I meant that she could give me some time to miss her but it feels like she’s misread everything I meant to say. These messages are from yesterday, we still haven’t talked and she’s not picking up the phone, it’s starting to get a little frustrating.",
        "BestComment": "YOR. You got what you wanted. \n\nIn your next relationship use your words, use them clearly and before you're at a point of resentment. And don't yell at your partner.",
        "Topic": "Boundary Issues",
    "Background": "After being told he is clingy, a boyfriend interprets his girlfriend’s reduced messaging as her being distant, while she feels suffocated and tries to balance his need for contact with her need for space.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"hey\"}, {\"speaker\": \"Speaker B\", \"text\": \"hi\"}, {\"speaker\": \"Speaker B\", \"text\": \"what's up?\"}, {\"speaker\": \"Speaker A\", \"text\": \"you home?\"}, {\"speaker\": \"Speaker B\", \"text\": \"nope at work why?\"}, {\"speaker\": \"Speaker A\", \"text\": \"can we talk?\"}, {\"speaker\": \"Speaker B\", \"text\": \"like in person?\"}, {\"speaker\": \"Speaker A\", \"text\": \"preferably yeah\"}, {\"speaker\": \"Speaker B\", \"text\": \"idk, what's it about? I have a late shift, can it wait till tomorrow?\"}, {\"speaker\": \"Speaker A\", \"text\": \"no I'd rather talk about it now\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm not trying to fight\"}, {\"speaker\": \"Speaker A\", \"text\": \"ur just being super distant\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm sorry you see it that way\"}, {\"speaker\": \"Speaker B\", \"text\": \"you asked me for space, I'm trying to give that to you\"}, {\"speaker\": \"Speaker A\", \"text\": \"yeah I asked you for space but I didn't ask you to literally disappear\"}, {\"speaker\": \"Speaker A\", \"text\": \"I just meant I wanted to breathe without you CONSTANTLY blowing up my phone\"}, {\"speaker\": \"Speaker B\", \"text\": \"like I said I'm trying to do that for you. I'm not trying to argue with you, just doing what you asked\"}, {\"speaker\": \"Speaker A\", \"text\": \"This isn't what I asked for\"}, {\"speaker\": \"Speaker B\", \"text\": \"yes it is?\"}, {\"speaker\": \"Speaker B\", \"text\": \"you said I was smothering you and being exhausting\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't wanna be around someone I love and constantly worry I'm pissing you off\"}, {\"speaker\": \"Speaker A\", \"text\": \"I know and I'm sorry, I was being a dick\"}, {\"speaker\": \"Speaker A\", \"text\": \"I just felt like I couldn't go about my shift without you sending a dozen messages\"}, {\"speaker\": \"Speaker B\", \"text\": \"you could've told me that\"}, {\"speaker\": \"Speaker B\", \"text\": \"no, you yelled at me and made me feel like shit for checking up on you\"}, {\"speaker\": \"Speaker A\", \"text\": \"I would have understood if you told me you needed me to ease up but you seriously hurt my feelings instead\"}, {\"speaker\": \"Speaker B\", \"text\": \"okay but that doesn't change how it came off\"}, {\"speaker\": \"Speaker B\", \"text\": \"I get now I might've been a lot but it was always to see if you were okay, if you needed me to drop off lunch and whatnot\"}, {\"speaker\": \"Speaker B\", \"text\": \"I would have gotten your point just as clearly through a calm conversation\"}, {\"speaker\": \"Speaker A\", \"text\": \"Again, I'm seriously sorry. You're fucking amazing, I'm genuinely sorry I hurt your feelings. Can we talk in person? I don't wanna have this conversation through text\"}, {\"speaker\": \"Speaker B\", \"text\": \"yeah tomorrow tho. gotta go now\"}, {\"speaker\": \"Speaker A\", \"text\": \"I love you\"}, {\"speaker\": \"Speaker B\", \"text\": \"love you too\"}]}"
    },
    {
        "SubmissionID": "1mhwdxg",
        "URL": "https://www.reddit.com/gallery/1mhwdxg",
        "Title": "AIO for thinking this behaviour from my boyfriend is concerning?",
        "Body": "He is very possessive of me, essentially saying that I cannot wear short sleeves or shorts. I sent him a photo of me in tank top the other day and he immediately was like “why tf are you wearing that” and got mad. He says I can’t have guy friends, must learn to respect myself and him by covering up, and eventually wear a headscarf (i’m ethnically russian american and he’s syrian). He has threatened to fuck me up (and “destroy me” as you can see) if he sees me wearing something he deems inappropriate or talking to other guys. as of now, we live in separate countries. not sure what i should do? ",
        "BestComment": "He is in another country. Block his number and delete that contact.\n\nDo not respond to his text messages. Do not answer your phone. Do not un block him “just to see if he is still calling.”\n\nGet away from this person.",
        "Topic": "Manipulation and Control",
    "Background": "A boyfriend ‘tests’ his girlfriend by proposing a scenario where she services his shy friend sexually, threatens to destroy her if she agreed, and insists she cover up and eventually wear a headscarf because she is “his.”",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"So I have a friend he is so shy and like never did anything with a girl like me but I'm taking him with me so u can suck his d while I fuck u in the back\"}, {\"speaker\": \"Speaker B\", \"text\": \"what\"}, {\"speaker\": \"Speaker A\", \"text\": \"Can u or nah\"}, {\"speaker\": \"Speaker B\", \"text\": \"are u being fr\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yh I am So can u or nah\"}, {\"speaker\": \"Speaker B\", \"text\": \"no? wtf\"}, {\"speaker\": \"Speaker B\", \"text\": \"Yayy\"}, {\"speaker\": \"Speaker B\", \"text\": \"I passed\"}, {\"speaker\": \"Speaker B\", \"text\": \"U so lucky U did pass Cuz I would get so mad I destroy u\"}, {\"speaker\": \"Speaker A\", \"text\": \"my heart was breaking\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm not I was just testing u I'm sorry lmao I won't do it again\"}, {\"speaker\": \"Speaker A\", \"text\": \"so if we walked together outside you were with me would u still make me cover up\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yes but you are with me?\"}, {\"speaker\": \"Speaker B\", \"text\": \"So what They will still See u\"}, {\"speaker\": \"Speaker A\", \"text\": \"who is they\"}, {\"speaker\": \"Speaker B\", \"text\": \"The guys The crazy guys\"}, {\"speaker\": \"Speaker A\", \"text\": \"but what if every girl wears it isn't it common it\"}, {\"speaker\": \"Speaker B\", \"text\": \"Idc about others I care about what's mine\"}, {\"speaker\": \"Speaker A\", \"text\": \"one day would y make me wear headscarf\"}, {\"speaker\": \"Speaker B\", \"text\": \"Yh really?\"}, {\"speaker\": \"Speaker A\", \"text\": \"when do i have to wear it\"}]}"
    },
    {
        "SubmissionID": "1gj4a9i",
        "URL": "https://i.redd.it/fx86x622ssyd1.jpeg",
        "Title": "AIO - husband playing video games for hours",
        "Body": "my husband has always played video games on and off, but NEVER this much. recently the new call of duty game came out and he plays 5-6 days a week, for MINIMUM 2 hours a day up to 6 hours a day. there’s a few days a week where I go to sleep alone. \n\nfor reference, my relationship previous to this was traumatizing for me as my ex played video games 12-18 hours a day. not exaggerating. i’ve told this to my husband, but he always makes me feel bad saying he’s “not wasting any money” and “just hanging out with friends”. if i can’t think of something for us to do together, he chooses games usually. \n\nam i overreacting here? do i just need to find my own hobbies? i just feel lonely. and i can’t talk to friends or family about this because i don’t want them to think he’s a negligent husband. ",
        "BestComment": "That’s normal for people into gaming. 2 hours is nothing. What’s the difference between that and watching Netflix?",
        "Topic": "Boundary Issues",
    "Background": "A husband justifies long nightly gaming sessions by telling his wife that zombie games are long and asking her to be more considerate of his favorite low-cost hobby while she feels neglected.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"zombies games are long\"}, {\"speaker\": \"Speaker A\", \"text\": \"i'm doing an important one with please be more considerate of one of my personal favorite and low cost hobbies\"}]}"
    },
    {
        "SubmissionID": "1mbdw1l",
        "URL": "https://i.redd.it/zx5eubj3rlff1.png",
        "Title": "AIO? Bf texting girl for work",
        "Body": "AIO? Ok, so my bf does window cleaning and screen jobs all over. He has been teasing me a little (like we do sometimes) about this one girl that is working somewhere that he goes about biweekly. He will say little things about her to make me jealous. I always laughed good naturedly but wasn't particularly jealous. Tonight I saw this.. am I wrong in thinking his wording about \"thinking of her\" was inappropriate in the fact that this should only be a professional conversation? Also, just to note. When he sends a text that says only \"Hi\" he isnt texting in a professional capacity and is rather looking for the person to engage with him. I feel like I am crazy, but please be gentle on me. I'm just feeling uncomfortable about it.",
        "BestComment": "While I think the comment around “Saying things about her to make you jealous” sounds WAY strange, I see noehting strange in that text exchange from a service business to client standpoint.",
        "Topic": "Boundary Issues",
    "Background": "A window cleaner texts a client that he was thinking about her and offers to stop by, mixing casual flirt-like wording into what is supposed to be a professional scheduling conversation.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hi what's up?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Was just thinking about you. I gotta stop by. Next time I'm in the area should I clean the windows? This week or weekend?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yes that would be great! And as far as a set schedule, would every other week work for you?\"}, {\"speaker\": \"Speaker B\", \"text\": \"That works for me\"}, {\"speaker\": \"Speaker B\", \"text\": \"I can probably be by tomorrow\"}, {\"speaker\": \"Speaker A\", \"text\": \"Awesome, thanks so much! I'll be in the store till 3, but anytime works for us!\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hi, sorry i didn't make it Saturday had some stuff come and had to leave town. I will be there this Saturday for sure though.\"}]}"
    },
    {
        "SubmissionID": "1gl4jwc",
        "URL": "https://i.redd.it/kcbcnwg3lbzd1.jpeg",
        "Title": "AIO Moved out ",
        "Body": "I recently moved out from my mothers house (25)F and moved in with my grandpa to a more healthy environment. Ollie is my cat :) (context) I use to babysit my brother now he’s home alone (12) ",
        "BestComment": "1. Go get your cat & 2. Your brother is not your responsibility",
        "Topic": "Manipulation and Control",
    "Background": "After a daughter moves out for a healthier environment, her mother texts that anything happening to the younger brother alone will be her fault and suggests she come get her cat since she won’t care for him.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Guess you will taken care of your papa\"}, {\"speaker\": \"Speaker A\", \"text\": \"Then\"}, {\"speaker\": \"Speaker A\", \"text\": \"If anything happens to your brother while he’s alone it will be your fault Abby\"}, {\"speaker\": \"Speaker A\", \"text\": \"Cause you chose this\"}, {\"speaker\": \"Speaker A\", \"text\": \"Guess you can come get Ollie\"}, {\"speaker\": \"Speaker A\", \"text\": \"I’m not going to take care of him\"}]}"
    },
    {
        "SubmissionID": "1mshwyd",
        "URL": "https://www.reddit.com/gallery/1mshwyd",
        "Title": "Am I Overreacting? (my teen friend group)",
        "Body": "Basically I got into an argument with my friends. MaccaPacca was playing a game alongside Master Wu and Little Quackky, in which he got provoked by them where he said the first message in the first image (I wasn’t playing with them). In response, me reading the chat, replied that he can’t really say anything about it since he acts like that in real life. It then escalated afterwards. I know I probably shouldn’t have commented on that but I don’t think they had such a need to be offensive afterward when I was just using his own insult on himself.\n\n1st and 2nd Image - Single Comment Thread From Argument\n\n3rd Image - Discussion afterwards 1 day later\n\nP.S When I said “I’m not even Afghani bro” I was referring to terrorist organisations in Afghanistan, not the people. (I actually respect them a lot since we share the same beliefs)\n\nAny help would be appreciated!",
        "BestComment": "how r u friends with people that are so comfortable in being racist",
        "Topic": "Emotional Abuse",
    "Background": "Teen friends trade racist, homophobic, and personal insults in a group chat, with one boy being mocked for his ego and for arguing to prove he’s right while the others belittle him.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"You are all so fucking gay\"}, {\"speaker\": \"Speaker A\", \"text\": \"Why r u yapping\"}, {\"speaker\": \"Speaker B\", \"text\": \"I said 2 sentences sir\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm not even Afghan bro\"}, {\"speaker\": \"Speaker C\", \"text\": \"Shush or ill wash ur hands\"}, {\"speaker\": \"Speaker B\", \"text\": \"No need\"}, {\"speaker\": \"Speaker A\", \"text\": \"Of that statement\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ur scared\"}, {\"speaker\": \"Speaker A\", \"text\": \"Of that statement\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't even know what that means\"}, {\"speaker\": \"Speaker C\", \"text\": \"Indians hate being clean\"}, {\"speaker\": \"Speaker B\", \"text\": \"again you can't talk\"}, {\"speaker\": \"Speaker B\", \"text\": \"and we are the ones who invented soap and shampoo\"}, {\"speaker\": \"Speaker A\", \"text\": \"Didn't use them\"}, {\"speaker\": \"Speaker A\", \"text\": \"They invented it to start a civil war against each other\"}, {\"speaker\": \"Speaker B\", \"text\": \"facts? sources?\"}, {\"speaker\": \"Speaker B\", \"text\": \"or is this another thing you made up\"}, {\"speaker\": \"Speaker B\", \"text\": \"Fine if you wish\"}, {\"speaker\": \"Speaker A\", \"text\": \"See his got such a big ego\"}, {\"speaker\": \"Speaker A\", \"text\": \"Who tf would spend 2 hour and spend their sleeping time just to prove they are right in an absolutely shitty and pointless conversation\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm gonna exclude myself from the conversation from now\"}, {\"speaker\": \"Speaker B\", \"text\": \"Fine if you wish\"}, {\"speaker\": \"Speaker C\", \"text\": \"Bro can you not handle being wrong\"}, {\"speaker\": \"Speaker C\", \"text\": \"Like you willing to yap for 2 hrs just to prove your right\"}, {\"speaker\": \"Speaker B\", \"text\": \"bruh it doesn't matter I'm posting it and I'll apologize if I'm wrong\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm gonna exclude myself from the conversation from now\"}, {\"speaker\": \"Speaker B\", \"text\": \"Fine if you wish\"}, {\"speaker\": \"Speaker A\", \"text\": \"See his got such a big ego\"}, {\"speaker\": \"Speaker A\", \"text\": \"Who tf would spend 2 hour and spend their sleeping time just to prove they are right in an absolutely shitty and pointless conversation\"}]}"
    },
    {
        "SubmissionID": "1ji4iez",
        "URL": "https://i.redd.it/u5ztvypi4hqe1.jpeg",
        "Title": "UPDATE on AlO for wanting to email my boss to apologize for my best friend quitting the job I just got her at my job after her working there for only 3 days? I feel very embarrassed",
        "Body": "I ended up sending an apology email to my boss. I’m a full time nanny for a company and my boss lives in a different state therefore I didn’t get to tell her this in person. She took it really well! I’m glad I sent the email",
        "BestComment": "NOR and super smart move on your part. You did recommend this person and from your boss' message, she probably hired her based on that. So, yeah, needed to be addressed and you handled it excellently. Making lemonade out of lemons, I'd say!!",
        "Topic": "Boundary Issues",
    "Background": "A nanny writes a formal apology email to her boss after a referred friend quits after three days, and the boss reassures her that referrals are still appreciated and she did nothing wrong.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I sincerely apologize for leaving without explanation. I hope this doesn't take up too much of your time. Thank you for your time and I hope you've had a good weekend.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hi S, Thank you for reaching out to me. I am always grateful for your referrals; please don't apologize! I'm so glad you are on our team!\"}]}"
    },
    {
        "SubmissionID": "1jth2xi",
        "URL": "https://i.redd.it/1kdiyo3bqdte1.jpeg",
        "Title": "My mum bought us a shed without asking — now she’s blocked me. Am I overreacting?",
        "Body": "Me (28M), and My girlfriend (28F) and I recently moved into our first home together, and I’ve been trying to set healthy boundaries with my mum — which has been difficult because she’s always had a habit of being quite controlling. She often drops by unannounced or makes decisions without asking us, and when I try to communicate openly, she tends to take it personally or twist it.\n\nA recent situation tipped things over:  \nWe mentioned we were looking at getting a specific type of shed (a Keter one), but without asking or showing us a link, my mum bought one herself and told me she’d be bringing it up and setting it up on Saturday.\n\nI replied saying I hadn’t seen it, and reminded her we were already looking for a specific kind. She then sent a string of messages (screenshot attached) calling me ungrateful, saying I’ve become a snob, and that they won’t be coming to our home anymore. She also blocked me.\n\nFor context, she often tries to blame my girlfriend for any decision I make, as if I’m not capable of making choices for myself. My girlfriend has never been rude and is always grateful for anything we’re given — but somehow she always becomes the scapegoat.\n\nI replied politely, telling my mum I appreciated the gesture and that she’s always welcome — but I’m now left feeling anxious and second-guessing myself.\n\nPlease bear in mind that this isn't even scratching the surface. When we moved house, my mum wasn't best pleased. It's a nice house in a sought after area, but when my mum saw the floorplan and the dimensions of the house, she said to my brother, who told me, that \"you couldn't even swing a cat in it\". God, I'd love to make a thread of all things she's said that have been hurtful over this past year.\n\nOh another one, when I was living with my parents, there was a time when my younger brother's girlfriends dog unexpectedly died. I was sympathetic towards her but because I didn't give her a hug (which wasn't appropriate at the time), my mum flipped because of this and kicked us both out of the house and I stayed in a hotel for a week because I didn't have a place to stay. She didn't invite me back. She packed two suitcases full of my belongings and I had to find a place to live. Me and my girlfriend were doing long distance at the time (approx 2hr drive), and because of work commitments, staying at hers wasn't an option, even though her and her family did offer.\n\nAm I overreacting for being upset by all this? Or is this kind of behaviour not okay?",
        "BestComment": "Man that's awful. I'm sorry. She should be proud of you for being on your own and being responsible. And, screw being a snob your house is YOURS (and emmas, obviously) so what you want in or out of your house should all be 100% up to you two. Nobody else. You're doing everything right. I hope she comes around and you can have a healthy relationship but if not then please do not blame yourself. This is on her.",
        "Topic": "Emotional Abuse",
    "Background": "A mother buys a shed without consulting her son, calls him ungrateful and a snob when he questions it, blames his partner, and declares she won’t visit their home anymore.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"We will bring it up on Saturday and set it up\"}, {\"speaker\": \"Speaker B\", \"text\": \"I've not even seen it\"}, {\"speaker\": \"Speaker B\", \"text\": \"I told you we were looking at getting a Keter one\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ffs\"}, {\"speaker\": \"Speaker A\", \"text\": \"You're such an ungrateful son!\"}, {\"speaker\": \"Speaker A\", \"text\": \"I told you there was one on JP and you said ok. So you think you're going to fit everything in a Keter I'm so done now\"}, {\"speaker\": \"Speaker A\", \"text\": \"I don't know if it's you or Emma but your becoming a snob\"}, {\"speaker\": \"Speaker A\", \"text\": \"Dont worry we won't be coming to your home anymore as we have now got the message\"}, {\"speaker\": \"Speaker A\", \"text\": \"Enjoy your life\"}, {\"speaker\": \"Speaker B\", \"text\": \"Emma hasn't even seen it, did you send her a link to it or text her?\"}, {\"speaker\": \"Speaker B\", \"text\": \"I really do appreciate it and I don't take it for granted\"}, {\"speaker\": \"Speaker B\", \"text\": \"You know you're welcome up whenever\"}]}"
    },
    {
        "SubmissionID": "1ltukix",
        "URL": "https://www.reddit.com/gallery/1ltukix",
        "Title": "AIO - my friend gave my abusive ex my new phone number",
        "Body": "I am genuinely not sure if I’m tweaking. I used to date a guy about a year ago and this man was TOXIC to a T, stalking, threats, emotional abuse, everything that was bad\n\nHe doesn’t live in my country but he came a few times when we were still ‘okay’ but I never invited him to my actual home, we always went to Airbnb’s bc even when things were okay I didn’t want him to have my home address, and when everything started going downhill, he genuinely stalked my address with all the info he found out about me flew from his country to mine and came to my house\n\nThat was deadass one of the scariest times of my life, and I genuinely moved after that, I changed my number, I did everything so he wouldn’t come again\n\nBut apparently someone I considered a ‘friend’ has for one been talking and for two GAVE that man my phone number knowing damn well everything he did last time\n\nI am so unbelievably mad, I thought I finally found peace and I’ve been healing over everything only to go right back to feeling completely unsafe again, but my ‘friend’ is acting like I’m crazy because it’s been a year and he’s ’probably changed’ \n\nAIO?",
        "BestComment": "NEVER TALK TO HER AGAIN. Basically the same situation but he tried to kill me instead of stalking, my friend would NEVER EVER EVER in a million years give him my new number. She is honestly your enemy fuck that bitch.",
        "Topic": "Gaslighting",
    "Background": "A friend admits she gave an abusive ex the poster’s new number and then says she’s overreacting and that he’s probably different now, dismissing the threats and stalking that led to the number change.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I didn't mean anything bad by it, he said he wanted to say sorry\"}, {\"speaker\": \"Speaker B\", \"text\": \"Holy shit dude I actually hate you for this\"}, {\"speaker\": \"Speaker A\", \"text\": \"you're overreacting it's not that bad???\"}, {\"speaker\": \"Speaker B\", \"text\": \"It is that fucking bad what are you talking about\"}, {\"speaker\": \"Speaker B\", \"text\": \"I changed my number bc that mf was stalking me, and ur still talking to him and giving him my new contact info???\"}, {\"speaker\": \"Speaker A\", \"text\": \"bro it's been a year he's probably different now\"}, {\"speaker\": \"Speaker B\", \"text\": \"What??????\"}, {\"speaker\": \"Speaker B\", \"text\": \"Fuck you dude Genuinely\"}]}"
    },
    {
        "SubmissionID": "1ltx0gx",
        "URL": "https://i.redd.it/mfcsf7xgzgbf1.jpeg",
        "Title": "AIO for being pissed at my teen sibling??",
        "Body": "Called teen sibling, no answer. Messaged, didn’t reply till 12 hrs later. Mind u, they’re on summer break n just stay at their house all day. Was genuinely an absolute emergency (tht still hasn’t been resolved, completely) \nAIO for thinking this is extremely inconsiderate, even for a teen in this society rn?? \n\nNot important but sn: I already overlooked this particular sibling not making and attending my college ceremony & graduation this past yr. (2 diff events) Didn’t come to my ceremony.. claim they didn’t know where it was. (After i told her 1000 times the details) And didn’t come to be college graduation at all.. said she forgot n had a 4H meeting.\n\nShe stays 15 min from the venues where my college events were held..\n\nBut anyway, for context, the emergency was abt a diff relative, who is the same age as my sibling. This other relative ran away & was considered ‘missing’. \n\nI only was just gonna ask my teen sibling if they could check social media of the other kid, to see if that person made any posts etc.. But NOPE! was ‘sleeping’ for 12 f’n hrs.\n\nIk we all do stupid stuff as teens and nobody’s perfect. \nHonestly, AIO n it’s just simply how this new generation is? Like do they all really not care abt anyone but themselves?? Genuine question. \nPlz be respectful",
        "BestComment": "With the information provided, OP is OR. I’ve slept 12+ hours since before I was 13 and I’m 24 now. \n\nIf it is an emergency then call instead of text and ask them to keep their notifications on at all times. \n\nThey may show up to some events but life is hard as a teen and they have an entire life outside of you, no matter which way you try to spin it. \n\nThey may have mental health issues that you are completely unaware of. They may just be very introverted.\n\nI’m not going to speculate any further cause this isn’t enough info to form anything with.",
        "Topic": "Boundary Issues",
    "Background": "A teen sibling apologizes for sleeping most of the day and missing texts, while the older sibling expresses anger that they were unreachable during a family emergency and sees it as inconsiderate.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I'm sorry I've been sleeping most of the day\"}, {\"speaker\": \"Speaker B\", \"text\": \"Girl ik u not doin nothing this an emergency\"}]}"
    },
    {
        "SubmissionID": "1o46rfr",
        "URL": "https://www.reddit.com/gallery/1o46rfr",
        "Title": "AIO because he's just a friend",
        "Body": "This guy used to work with my wife and they have a little friends group.  This guy though, it's different.  She and him  have their own side texting relationship and have been out just the two of them before too.  \nWe've already fought about this guy before.  He lived in her pocket and I said I wanted him out.  They said they'd cool it.   Then I saw this and lost it.  ",
        "BestComment": "Those messages a guy with my wife ? Never. Makes no sense. Not overreacting\n\nIf it doesn’t talk to the guy and remember him that she has a husband.",
        "Topic": "Boundary Issues",
    "Background": "A married woman and a male colleague exchange warm, intimate messages about missing each other and turning down other plans for happy hour, then later tells her husband he is her only and she will block the colleague.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"No reason to feel bad and you do not owe me any drinks. I was just letting you know that I was happy to choose you over them.\"}, {\"speaker\": \"Speaker B\", \"text\": \"That makes me happy and bad... lol\"}, {\"speaker\": \"Speaker B\", \"text\": \"Glad you're getting a nap... don't know how you look like you function on... hours!!!\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'd argue I'm not functioning well\"}, {\"speaker\": \"Speaker A\", \"text\": \"Both kids woke me up last night\"}, {\"speaker\": \"Speaker A\", \"text\": \"Feel like you really could have used that HH today\"}, {\"speaker\": \"Speaker A\", \"text\": \"Nanners has caused at least a few beers\"}, {\"speaker\": \"Speaker B\", \"text\": \"Totally agree with that\"}, {\"speaker\": \"Speaker B\", \"text\": \"And that's young kids\"}, {\"speaker\": \"Speaker B\", \"text\": \"How I miss having you at school\"}, {\"speaker\": \"Speaker A\", \"text\": \"I miss you too! I like my crew, but they don't get me like you do\"}, {\"speaker\": \"Speaker A\", \"text\": \"A lot of them live out here too\"}, {\"speaker\": \"Speaker B\", \"text\": \"Sorry about a happy hour this week\"}, {\"speaker\": \"Speaker B\", \"text\": \"Sorry about no happy hour this week\"}, {\"speaker\": \"Speaker A\", \"text\": \"But I will say generally speaking almost any Friday I could do happy hour after school\"}, {\"speaker\": \"Speaker A\", \"text\": \"And I forgot to tell you I actually turned down Teachers Academy happy hour today with Don cause I thought we were going to go to happy hour but again that nap is gonna work just as g...\"}, {\"speaker\": \"Speaker A\", \"text\": \"Heart enjoys or whatever are me to text response. I literally mean nothing by it, just a ok or 'love it'\"}, {\"speaker\": \"Speaker A\", \"text\": \"I mean it. You are my only. I will do anything for you. I am blocking him. And won't do anything with him. You are my only person\"}]}"
    },
    {
        "SubmissionID": "1mry9tc",
        "URL": "https://i.redd.it/z96qumvnfejf1.jpeg",
        "Title": "AIO to want to get a restraining order? TW: sa.",
        "Body": "Hey all. Throwaway account, my main one has too much personal info. \n\nI’ll make this really short bc there’s tooo much to it. \n\nCoworker raped me while I was blacked out. He’s hiding behind the mask “I didn’t know she was blacked out” he def knew. \n\nI made a police report and had to report him to my work because it was unbearable seeing him and he was fooling everyone into believing I was the problem. \n\nI’m just kinda scared. I’ve always been of reporting a rapist. These r the lowest of the low. He has also mentioned gang affiliation and how much of a badass he is. \n\nI crossed out him mentioning my old last name (he must’ve used googled) also I sent him a link for English classes but it has the name of the location I’m near at. \n\n",
        "BestComment": "Mute him, do not block, and stop replying. I get it, it is tempting to outsmart him and make him feel stupid, but it can at worst egg him on or harm your case in general.",
        "Topic": "Emotional Abuse",
    "Background": "An accused coworker sends a text calling the rape victim pathetic, scum, and miserable for reporting him, cloaking the insults in a veneer of forgiveness and religious language.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"It must suck to have such a shitty depressing life. That you got to go around making lies about people. Your pathetic. I should have left your ass there. Enjoy your lonely miserable life that you'll always have because you're amongst the lowest scum in earth. I forgive you but God nor the judge will Miss You.\"}, {\"speaker\": \"Speaker A\", \"text\": \"God bless you\"}]}"
    },
    {
        "SubmissionID": "1idb89p",
        "URL": "https://i.redd.it/uwwzmjfsf1ge1.jpeg",
        "Title": "AIO for ending a relationship because he believes he should be the one to make the final decision?",
        "Body": "My child’s father/boyfriend believes he makes the final decision whether i agree or not. i can’t get down with that program. ",
        "BestComment": "[deleted]",
        "Topic": "Manipulation and Control",
    "Background": "A child’s father describes a system where both parents discuss decisions but he still makes the final call, saying he hopes she’ll learn to trust his judgment even when she disagrees.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Yes im still here. What im explaining is we don’t collectively make a decision. We collectively come to the table n speak on a decision\"}, {\"speaker\": \"Speaker B\", \"text\": \"ok so your not okay with collectively making decision just to be clear..?\"}, {\"speaker\": \"Speaker A\", \"text\": \"I feel i am being perfectly clear. The system you needed me to describe is indeed what you asked me. Though now i know you won’t see it, i want to grow into a place where you trust me to make the final decision. W your input of course. N trust that decision to be in the best interest of both a us because you trust my thought process involves all us. However popular the decision\"}]}"
    },
    {
        "SubmissionID": "1iw3kzl",
        "URL": "https://www.reddit.com/gallery/1iw3kzl",
        "Title": "AIO: for blocking him because he’s okay with what his friend wants to do to me",
        "Body": "Okay so I (F19) have been in a situation-ship with this guy (M22) for around 2-3 months and we go on dates nearly every weekend. Anyway earlier today he sent me these message about me having sex with his friend and the fact they are even discussing me like that is a bit weird to me. I ended up blocking after the 'ew just ew'. Later today I went out drinking with one of my friends and she told me I was being a bit too harsh on him and that it was probably just one of his desires/ fantasies and that I shouldn't have shut him out like that straight away.. I get that as I myself have weird kinks and fantasies so I'm really not too quick on judging others but I'm still split on whether I did the right thing or not. Am I overreacting?? ",
        "BestComment": "NOT OVERREACTING. \n\nSee the problem is in the first few messages he says “he could if he let me watch ye go at it.” He practically just gave his friends hopes and a false invitation without your CONSENT. Thats why id be pissed and disgusted about it nonetheless.\n\nHe seems to just view you as an object and a fantasy only imo. Doesnt seem like he cares much of your feelings and on top of that doesnt make an apology but still tries to convince you to do it with his cringy reply. Like bruh. \n\nThat brother does not understand B O U N D A R I ES. Im with ya girl. Id double think if he is the right person for you. Cause you got a glimpse of his potential plans to use you for…. Sorry that happened.",
        "Topic": "Manipulation and Control",
    "Background": "A situationship partner tells her that his friend wants to have sex with her and that watching them is his fantasy, treating her like a shared sexual object until she pushes back in disgust.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I'm sorry is this some kind of joke?!?\"}, {\"speaker\": \"Speaker B\", \"text\": \"No if your not up to the idea i totally get that\"}, {\"speaker\": \"Speaker A\", \"text\": \"You do realise me and YOU are the ones going on dates and now you're asking if I can have sex with your friend because I'm his 'fantasy' girl? Do you realise how fucked that is.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm only interested in you and now your telling me you would be happy to watch another guy have sex with me\"}]}"
    },
    {
        "SubmissionID": "1gr6jkt",
        "URL": "https://i.redd.it/h8fz8l16sv0e1.jpeg",
        "Title": "AIO to partner taking photos of me in the bathroom? ",
        "Body": "Last night my (29F) partner (39M) walked into our bedroom, where I was in the bathroom completely naked sitting on the toilet ready to get in the shower. I don’t lock the door because he gets angry. I told him to get out and he picked up his phone and pointed it at me like he was taking a picture, which I assumed was a joke until he turned his phone around and there was the picture of me, butt ass naked on the toilet. He said something along the lines of “blackmail, I’m sending this to your boss”. I got angry and he deleted it but I didn’t care, the damage was done. I shoved him out of the room and locked the door. Went and finished my shower and went downstairs to take my meds and ignored him talking to me and went back upstairs to go to bed. These were the texts that followed. The relationship has been rocky for a while but I think this was the last straw and I am currently looking at apartments and planning a way out. He doesn’t think any of this was a big deal. Am I overreacting? ",
        "BestComment": "NOR leave! Several red flags in your post. 1) he gets mad when you lock the bathroom door. wtf if you want privacy that’s your right! 2) Taking the photo without consent 3) Threatening to use the photo as blackmail and send it to your boss!! 4) Not even apologizing for doing any of it and yelling at you for your very valid concerns. I’m glad to hear you’re already planning to leave, please be safe he sounds a smidge volatile.",
        "Topic": "Manipulation and Control",
    "Background": "A man secretly photographs his naked partner sitting on the toilet, jokes about blackmailing her by sending it to her boss, and then tells her to leave if she feels unsafe after she says he violated her trust.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Fuck off!\"}, {\"speaker\": \"Speaker B\", \"text\": \"You just took photos of me naked in the bathroom without my consent. I feel violated and humiliated. What you did is not just illegal but shows you have absolutely no respect for me as a person. This is not okay. I no longer feel safe here. I am beyond hurt and I don’t think I will ever be able to forgive you for this.\"}, {\"speaker\": \"Speaker A\", \"text\": \"wtf. I deleted off everything! And you can see for yourself.\"}, {\"speaker\": \"Speaker A\", \"text\": \"So ya prob shouldn’t stay here if you feel unsafe\"}, {\"speaker\": \"Speaker B\", \"text\": \"It is still in your recently deleted and there are still ways to recover it. You completely violated my trust.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Not it’s not!\"}]}"
    },
    {
        "SubmissionID": "1oh8hfn",
        "URL": "https://www.reddit.com/gallery/1oh8hfn",
        "Title": "AIO for cutting off my ex after she threatened me",
        "Body": "I made a comment that she was playing a lot of a video game that she'd mentioned a guy she liked was playing. Everyone in this situation is poly. Both my boyfriend and I used to date her until recently. This interaction makes me want to stop talking to her, even though we were on ok terms before this.",
        "BestComment": "Discord is all I had to see.",
        "Topic": "Emotional Abuse",
    "Background": "An ex says she’ll cut her former partner’s head off if he mentions her crushes in front of others, then lectures him about common sense and uses his autism to belittle him while insisting he nearly hurt people she cares about.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I'm not playing RuneScape for 12 hours straight\"}, {\"speaker\": \"Speaker A\", \"text\": \"Also if you mention guys I'm crushing on in front of me again I will cut your head off just because I don't want to hurt you like that\"}, {\"speaker\": \"Speaker A\", \"text\": \"That's my info to share with him, not yours. If I can't trust you to keep things secret and separate then I'll just stop telling you things\"}, {\"speaker\": \"Speaker A\", \"text\": \"No, I'm being hyperbolic\"}, {\"speaker\": \"Speaker A\", \"text\": \"This isn't a me and him thing, it's a you and me thing\"}, {\"speaker\": \"Speaker A\", \"text\": \"Interesting how you're more focused on how YOU feel about me bringing this up rather than now what I'm talking about\"}, {\"speaker\": \"Speaker B\", \"text\": \"Just because I hurt your feelings doesn't mean it's ok to threaten me. Whether it's a joke or not\"}, {\"speaker\": \"Speaker A\", \"text\": \"Okay, you're right, it was inappropriate and I'm sorry\"}, {\"speaker\": \"Speaker A\", \"text\": \"Now can we focus on the obvious topic?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Or do you still wanna focus on the obvious hyperbole?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Everyone here is poly. I didn't realize this was a boundary you had. I'm sorry that I hurt your feelings\"}, {\"speaker\": \"Speaker A\", \"text\": \"Use common sense\"}, {\"speaker\": \"Speaker A\", \"text\": \"That's what I want\"}, {\"speaker\": \"Speaker A\", \"text\": \"I don't understand why you would ever think that's okay to say that in front of him\"}, {\"speaker\": \"Speaker B\", \"text\": \"It's not common sense. Why wouldn't it be ok?\"}, {\"speaker\": \"Speaker B\", \"text\": \"Thank you for communicating your boundaries. I really appreciate it and won't say it again\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yes, it's fucking common sense to not talk about my other love interests in front of our mutual friend that I just broke up with holy shit\"}, {\"speaker\": \"Speaker A\", \"text\": \"I get that you're autistic and maybe you wouldn't realize that\"}, {\"speaker\": \"Speaker A\", \"text\": \"So I'm saying it explicitly\"}, {\"speaker\": \"Speaker A\", \"text\": \"Don't do that\"}, {\"speaker\": \"Speaker A\", \"text\": \"You got fucking lucky I didn't hear it because that's what really hurts\"}, {\"speaker\": \"Speaker A\", \"text\": \"You came very fucking close to hurting your boyfriend and someone I care a lot about\"}, {\"speaker\": \"Speaker A\", \"text\": \"I genuinely don't understand why you would ever think that's okay\"}, {\"speaker\": \"Speaker B\", \"text\": \"I mean he's not a jealous person. He definitely wouldn't mind. But I hear and appreciate your concern for his feelings\"}, {\"speaker\": \"Speaker A\", \"text\": \"Or why it wouldn't occur to you that it's not okay\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm mad crushing on like 2 other guys right now and he knows\"}, {\"speaker\": \"Speaker A\", \"text\": \"No, I don't think you do hear me, because all you're doing is minimizing the impact of your behavior\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yeah, and he DOESN'T LIKE HEARING ABOUT IT\"}, {\"speaker\": \"Speaker A\", \"text\": \"HOW DO YOU NOT KNOW THIS ABOUT YOUR BOYFRIEND\"}, {\"speaker\": \"Speaker B\", \"text\": \"Um okie\"}]}"
    },
    {
        "SubmissionID": "1muh99v",
        "URL": "https://i.redd.it/gutbchbf1zjf1.jpeg",
        "Title": "AIO? Father's shouldn't accomdate their own daughters?",
        "Body": "Long story short, I was going to go visit my Dad and his family was going to be visiting there as well for a few days. Unfortunately I only had a couple days of PTO built up and asked if he could take me back to the airport while his family was in town. He told me that he wasn't going to miss a second away from his family and that driving an hour to pick me up at the airport was \"too much\". ",
        "BestComment": "Saying “I didn’t know I’m supposed to accommodate my own daughter” reveals a lot. Whether or not he’s “supposed to” why wouldn’t he want to? Strange guy. I don’t think you’re overreacting. \n\nIf it’s really so much of an issue he could at least offer you solutions, like paying for a taxi or lyft/uber. Also interesting how you say “his family” is visiting. They are not your family too? Seems like a larger context here.",
        "Topic": "Emotional Abuse",
    "Background": "A father refuses to drive an hour to help his daughter visit during his family’s trip, later texting that he didn’t know he was supposed to accommodate his own daughter and framing her feelings as selfish",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Idk Dad. You literally made me feel like absolute crap because I couldn't make it up there on the days you wanted me to. Glad you had a good time with them though.\"}, {\"speaker\": \"Speaker B\", \"text\": \"you put me into an impossible situation so yes I was upset. It also makes me mad that you go to Tennessee all the time. There are plenty of things to do here too (amusement parks, parks, big cities etc.) that could give you something to do if visiting isn't enough. It's very difficult for me to travel now if I'm not going to see you otherwise I'd come and see you.\"}, {\"speaker\": \"Speaker A\", \"text\": \"TN is also only a 6 hr drive for us. We haven't been up there since in over a year now. But I have no desire to argue with you. I made plans to come see you and you couldn't accommodate. There's nothing else to say about it.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I didn't know I was supposed to accommodate my daughter to come see me. It's all about you isn't it. I will always love you but I see now that I probably won't see you for a very long time.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Yeah I'm not playing this woe is me card, Dad.\"}]}"
    },
    {
        "SubmissionID": "1l8p8h2",
        "URL": "https://i.redd.it/upetgzcvz96f1.jpeg",
        "Title": "AIO - I'm tired and hungry",
        "Body": "AIO - just a little background info. My fiance and I both work full time and we have 2 boys. I was out of work for a couple of months due to a medical issue stemming from a chronic autoimmune disease. I'm back to work now (I'm an exterminator) but we are desperately trying to get caught up on bills. Needless to say, money is extremely tight. I have less than $20 until payday and he's not much better off. Yesterday afternoon, I ended up getting a couple of extra appointments on my schedule, which is readily took as it earns me more on my paycheck, but I was working well over an hour from home. \nWith money being so tight, I frequently skip meals. Sometimes that's several days in a row. I've lost 18lbs in recent weeks. My fiance knows this and hates it, but I will always make sure my kids are fed before I am. I sent him a text asking if he would figure out supper for the family last night as I would be very late getting home and didn't want to 1) have the kids waiting on me to get home and make supper so late and 2) just really didn't want to cook after working an 11 hour shift in +90° heat. He didn't respond to my message, so I rushed through work to hurry home and make supper so we weren't stuck eating after 8pm. This is the message I received back. I dont have the money to buy myself meals and he knows this. We don't have very much fast/quick stuff in the house, so I would have had to cook something. I figured I would just have a sandwich, too, but got home and found he had eaten 3 sandwiches which left me without bread. I ended up not eating at all yesterday and just went to bed early. I'm upset because to me, it felt like it didn't matter to him if I had food or not. It felt like I didn't matter and like he didn't think of or care about my wellbeing. I don't know if this was sheer laziness. He was playing COD when I arrived, so maybe he didn't want to cook because it would take away time from his game. I cried myself to sleep last night because I felt so abandoned in the moment. Idk why it hit me so hard, but it did. So AIO? ",
        "BestComment": "Reddit won't let me edit my post right now, so I pray this comment is seen. I'm so sorry I posted and ran. I posted in the few moments before I left for work and am finally home and able to read through more thoroughly. To add to the shitty day, a customer left her dog out and it attacked. I'm good - just a few punctures and what will undoubtedly be one hell of a bruise. My day grew nearly 2 hours longer due to the mandatory urgent care visit, paperwork, and unfortunately a police report per state laws. I'm exhausted, to say the least. With what little time I had between appointments, I did try to acknowledge and reply to a handful of comments and DMs. Let me first say that I am beyond grateful for so many kind words and actions from so many of you. Reddit can have days where it seems to be a cesspool, no matter what communities you're following, but yall all proved just how amazing this site and humanity can be. For that, I am eternally grateful. \nSecond, I hear you. The way my fiance treated me last night (and honestly in some other cases recently) isn't right. It's not the kindness and love a fiance should show, no matter how badly we're stressed. I see that now. I've done a lot of thinking and reflecting through your comments and I know I have some more to do. I don't know how this relationship will end up, but I know that in it's current state, we will not make it. I shoulder some responsibility here, too. Im definitely not a completely innocent party. I know I've made mistakes, too. With that said, allowing me to go hungry - not just today, but over the last several weeks - is 100% unacceptable and horrific. I don't deserve that, especially with as hard as I work both inside and outside the home. As so many of you pointed out, I should not be allowing him to disrespect me in any way. I escaped a violently abusive marriage nearly a decade ago. I didn't do all that just to allow mistreatment by another man. But somewhere along the road, I lost the backbone that got me out and somewhere safe.\nMy fiance and I have a lot to talk about. I know I'm not fully ready for that tonight - mostly because I'm just exhausted - but that conversation will happen before the weekend is over. \nI did reach out to him today about last night. I sent him a text and explained in no uncertain terms how worthless he made me feel in that moment. He apologized and told me he loved me. Better, I came home to both a home-cooked meal and dessert, ready and waiting for me. He asked me about my day and how I'm feeling. He hugged me long and warmly. It made me miss him and who we were even more, but it felt good to be in his arms. I told him so. It's peaceful with the kids and I'll likely take my meds and head to bed shortly. \nI very sincerely thank each of you for taking a few minutes from your own busy and stressful lives to read, comment, and message. It means so much to me that you shared those little moments with me. Thank you, from the bottom of my little southern  heart. ❣️",
        "Topic": "Emotional Abuse",
    "Background": "After his partner texts from a long, exhausting workday asking for help with dinner, the fiancé replies that she should just pick something up for herself because he already fed the kids and will make sandwiches.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I just got tossed 2 more appointments. Now I have 4 left plus driving home from durham. Do you mind helping me figure out supper for all of us? I wont likely be home before 630/7\"}, {\"speaker\": \"Speaker B\", \"text\": \"Oh sorry bout that. Just pick up something for yourself for supper. I only got them something I'm going to have a few sandwiches\"}]}"
    },
    {
        "SubmissionID": "1lyb5xf",
        "URL": "https://i.redd.it/qcaw442hdicf1.jpeg",
        "Title": "Am I Overreacting",
        "Body": "Am I overreacting/thinking???\n\nI get a text last night from an unknown number(ss is below). My Fiance and I have been together for 3+ years. we have an almost 2 year old and i’m 4 months pregnant with our 2nd baby. \n\nI texted the ss this morning and sent it to my fiance since he is at work and just said “what’s this?” bc i was concerned/ confused. I do trust him and don’t think he has done anything. HOWEVER, he offered for me to go through his phone. i did, and when i got to snap data he started to freak out and go off on me saying “that’s so much data being downloaded, you’re taking their side over mine, you’re letting them come between us” screams all of that to me. so i just let him have his phone back with out even looking and he still proceeds to go off.. \n\nAm i overthinking now that maybe he maybe guilty or maybe he did do something??\n\nAnd no, the number hasn’t texted me back.\nHe keeps saying it’s a scam and someone trying to get us. but why would someone make a comment like that???",
        "BestComment": "Download the data and have it emailed to YOUR email not his. \n\n\nThen read thru. Youll have an answer. It keeps EVERYthing. ",
        "Topic": "Boundary Issues",
    "Background": "An unknown number texts a pregnant fiancée to “check his phone” and says sorry for not knowing he had a baby on the way, hinting at potential infidelity and breaching relationship trust.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Check his phone\"}, {\"speaker\": \"Speaker A\", \"text\": \"Sorry sweetie. I didn't know he had a baby and another on the way\"}, {\"speaker\": \"Speaker B\", \"text\": \"sorry?\"}]}"
    },
    {
        "SubmissionID": "1jh5t2m",
        "URL": "https://www.reddit.com/gallery/1jh5t2m",
        "Title": "AIO my boyfriend wouldn’t give me space, and his messages weirded me out",
        "Body": "For context, my boyfriend and I have been together for a little over a year. When we first got together, we went to the gym frequently, but over time that tapered off. These days, I go alone, which I don’t mind since it helps me clear my head. However, recently, he mentioned wanting to do more things together, so we made some plans. Later, I brought up how I’d love to go to the gym together again—not all the time, just once or twice a week. He has a lot of free time on weekdays, so I figured it was reasonable.\n\nA few days ago, we were getting ready to go to the gym together. The only issue was that he brought up that he had to meet a friend around the same time, so he was in a bit of a time crunch. This frustrated me slightly, because it felt like he couldn't prioritise something that was important to to me, but it's not a big deal as we can always go another time.\n\nSince I was ready first, I started tidying up the apartment. I noticed the kitchen sink was clogged with rice from when he washed his pot—rice that had been sitting there for four or five days. I had asked him multiple times to clean it, and while he finally did the night before, he left a pile of rice in the sink. Since we’ve had drainage issues before, I wanted to clear it out before we left.\n\nAt this point, I was getting irritated. He was standing next to me while I cleaned, continuing to take his time getting ready instead of helping. Then, I noticed his stuff scattered all over the kitchen. I asked if he could put it away before we left—it would have only taken a few seconds. But what really pushed me over the edge was when I turned around and saw socks on the dining table.\n\nThis is a huge boundary for me. He has a habit of throwing clothes all over the place, which I’ve brought up multiple times before. Seeing socks on the table where we and our guests are supposed to eat made me snap. I told him to grow up and clean up after himself. We argued. I know I could have been more thoughtful - but I've become less tolerant of this issue.\n\nDespite the tension, we left together and took two buses to the gym. By this point, I was still frustrated, he asked if I'd continue being mad at him all day and he ended up sitting separately on the 2nd bus. That’s when the attached messages started.\n\nTo me, it felt like he was bombarding me with messages regardless of what I said. I explained my frustration, but he kept pushing without building on what were talking about. I was really trying to get this resolved before we got off. This wasnt getting resolved. So, I bluntly texted him I needed space and just wanted to focus on working out. It seemed like he agreed to giving eachother space.\n\nWhen we got to the bus stop, I left for the gym alone since we had both agreed to take space. I knew he was meeting his friend that was close anyway, so I figured it was fine. But instead of leaving, he followed me into the gym.\n\nHe asked to use my locker, I told him directly there are other lockers with integrated locks available and he was leaving soon anyway. While I was on the treadmill, he interrupted me to ask again if I was going to be mad all day.\n\nAt this point, I was really overwhelmed. My mind was racing, and I just told him to leave me alone. That’s when the gym texts started.\n\nHis messages really threw me off—he was apologising one second, guilt-tripping me the next, then victimising himself, and dismissing my need for space. The wildest part was when he threatened to never go to the gym with me again and then ended with \"lmao be stressed\" after I asked once more for space. It felt claustrophobic, like I was expected to immediately regulate my emotions and act like nothing had happened— to comfort him- even though my boundaries had been repeatedly ignored.\n\nEventually, he ran a bit on the treadmill while I stretched, then he left.\n\nI finished my workout, used the sauna, and went home. I spent a few hours cooking and relaxing on my computer, trying to clear my head. Later, I decided to go for a bike ride to get some fresh air. It felt great.\n\nThen, I got a message from him: \"Woke up to see you’ve left. Not a nice feeling\"\n\nAt that point, I just thought— do I really have to explain myself after everything that happened? Freedom is a big thing for me, he knows this, and it felt suffocating to be tracked like that. When I got home, I went straight to bed.\n\nI didn’t hear a word from him all day. Later, I headed to the gym alone. As soon as I left the house, he flooded me with messages.\n\nI refused to engage in that cycle again. I thought, why didn’t he bring this up when I was home? So I just told him we’d talk after my session—I didn’t want to associate my gym time with negativity.\n\nI also texted (not in the screenshots) that I’d let him know when I was ready to talk. Looking back, I get what he was trying to say, but completely ignoring my need for space and then demanding an apology felt like too much. I knew I needed to apologise for snapping in the kitchen, but he was hyper-fixating on what happened at the gym—as if I had forced him to be there.\n\nAnother day went by. By the end of it, I started the conversation. We talked everything through, I ordered pizza, and watched a show together. He cooked some chicken for me, and it felt like things were back to normal.\n\nBut I still can’t shake the weird feeling from his texts.\n\nDuring our talk, he kept pushing the narrative that I made him uncomfortable, embarrassed, and insecure at the gym—but in the moment, I felt like I was under so much pressure and had no room to breathe. It felt inescapable. All I said was that I needed to be left alone, but he kept engaging with me. He also said the socks were actually clean, and 'they smelled fine' - sure... I'm just confused why he didn't just say that when I brought it up on the day. He said he was struggling while I was taking space, almost talked to me, but admitted he didn't want to be the first one to talk because then he'd be letting me 'win'? - just really strange.\n\nI didn’t straight up tell him I found his messages manipulative, but I did say I was weirded out by them. Now, I’m just trying to get some outside perspective.\n\nDoes this seem manipulative, or just bad communication? Whenever I needed space before, he'd become passive aggressive, sarcastic etc... Am I overreacting? ",
        "BestComment": "you guys are both exhausting",
        "Topic": "Manipulation and Control",
    "Background": "At the gym, a boyfriend ignores his partner’s repeated requests for space, bombards her with guilt-tripping texts about hurting his feelings, and threatens never to go with her again if she doesn’t respond the way he wants.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Alright, I just want to argue all of this time\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm sorry I annoyed you\"}, {\"speaker\": \"Speaker B\", \"text\": \"No worries, we can go separate ways for today then\"}, {\"speaker\": \"Speaker A\", \"text\": \"I just don't want to argue all the time\"}, {\"speaker\": \"Speaker B\", \"text\": \"Alright, it's difficult because you don't want to argue and I don't seem to back down - but from my perspective I do argue because these things are not getting resolved.\"}, {\"speaker\": \"Speaker B\", \"text\": \"And I'm your boundaries are being broken.\"}, {\"speaker\": \"Speaker B\", \"text\": \"If the partnership is making things more difficult than easier then what's the point of managing everything in the apartment and some things outside of it too - it's too much hassle for me.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'll just go for a walk around or something if you wanna come.\"}, {\"speaker\": \"Speaker A\", \"text\": \"okay\"}, {\"speaker\": \"Speaker B\", \"text\": \"I need to work out\"}, {\"speaker\": \"Speaker A\", \"text\": \"okay\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'll leave you alone for today\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm sorry for being annoying again\"}, {\"speaker\": \"Speaker A\", \"text\": \"Really hurting my feelings\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'd appreciate being left alone because I'm feeling stressed out\"}, {\"speaker\": \"Speaker A\", \"text\": \"Then be stressed out\"}, {\"speaker\": \"Speaker A\", \"text\": \"okay\"}, {\"speaker\": \"Speaker B\", \"text\": \"I'm getting fresh air\"}, {\"speaker\": \"Speaker A\", \"text\": \"To be honest\"}, {\"speaker\": \"Speaker A\", \"text\": \"When you blank me It makes it worse\"}, {\"speaker\": \"Speaker A\", \"text\": \"I have told you this before\"}, {\"speaker\": \"Speaker A\", \"text\": \"And you never listen to me\"}, {\"speaker\": \"Speaker A\", \"text\": \"Stuff like this creates more distance\"}, {\"speaker\": \"Speaker A\", \"text\": \"I deserve an apology for how you treated me yesterday\"}, {\"speaker\": \"Speaker A\", \"text\": \"I felt so embarrassed and ashamed in a place that I already felt uncomfortable\"}, {\"speaker\": \"Speaker A\", \"text\": \"I came along because I didn't want you feeling that I didn't want to spend time with you\"}, {\"speaker\": \"Speaker A\", \"text\": \"Just for you to tell me to go anywhere\"}, {\"speaker\": \"Speaker A\", \"text\": \"and then say you didn't want me there was really hurtful\"}, {\"speaker\": \"Speaker A\", \"text\": \"you made it so difficult to even get two words out of you after\"}, {\"speaker\": \"Speaker A\", \"text\": \"Fully ignoring me when I tried talking to you at the gym\"}, {\"speaker\": \"Speaker A\", \"text\": \"It made me feel like you couldn't stand being near me\"}, {\"speaker\": \"Speaker A\", \"text\": \"And yesterday You came in\"}, {\"speaker\": \"Speaker A\", \"text\": \"Didn't say a word\"}, {\"speaker\": \"Speaker A\", \"text\": \"Nothing\"}, {\"speaker\": \"Speaker A\", \"text\": \"Ignored that I was even here\"}, {\"speaker\": \"Speaker A\", \"text\": \"and then left randomly at 12 to come back at 2\"}, {\"speaker\": \"Speaker A\", \"text\": \"what am I supposed to think about that?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Even going to bed I was feeling completely uncomfortable\"}, {\"speaker\": \"Speaker A\", \"text\": \"When you get like this it's like I don't know you\"}, {\"speaker\": \"Speaker A\", \"text\": \"This is just my feelings on this. I'm feeling hurt\"}, {\"speaker\": \"Speaker B\", \"text\": \"To be honest, I can't deal with this right now. I just headed out the door - I don't want to be flooded with negative thoughts consecutively when I go out to the gym - where I'm supposed to take my mind off things. I don't want to be thinking about this constantly. So we can talk when we're back home together.\"}, {\"speaker\": \"Speaker A\", \"text\": \"Okay\"}]}"
    },
    {
        "SubmissionID": "1jahhwa",
        "URL": "https://i.redd.it/5ysazdvrrhoe1.jpeg",
        "Title": "AIO I unfollow girl and this is how she reacts and I think it’s excessive",
        "Body": "For context I was in this friend group that I eventually found to be toxic because people talked behind peoples back and it seemed there was always some type of drama. I was not a saint myself cause I did participate and sometimes added to the drama but once I realized that it was not healthy I tried doing my best not to go along with the drama. Me and this girl tho were never close and I always felt like she didn’t like me but I could never give a valid reason of why I felt like that. Eventually one of the friends in the group told me that the girl told her she would never be friends with someone like me because of who I was as a person (emotional and sensitive), even though that hurt my feelings I didn’t bring it up and started distancing myself from the group. After some months of not talking to anyone I left the group chats and eventually unfollowed the girl and once I did this is the reaction she gave me and before I could even respond she blocks me. I personally think it’s juvenile because if she didn’t like me in the first place why would it trigger her that I simply unfollowed her? Should I have said something to her about the situation?",
        "BestComment": "\"Im done with you\" is like trying to quit after youve already been fired",
        "Topic": "Emotional Abuse",
    "Background": "After being unfollowed, Speaker B accuses Speaker A of creating drama, questions if she has a problem, and sends condescending messages before blocking her.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I'm sorry I know you hate that\"}, {\"speaker\": \"Speaker B\", \"text\": \"Do you have a problem with me? Lol just being straight up\"}, {\"speaker\": \"Speaker B\", \"text\": \"If there's anything you want to talk about talk to me because I already told you I don't like drama and YOURE the one creating it. So I'm fine with us not being cool because I'm honestly tired of telling you I'm okay with you and for you to lot believe me. It's too much of a headache.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hope you find peace within yourself.\"}, {\"speaker\": \"Speaker B\", \"text\": \"You could have at least had the balls to have me unfollow you too if you were going to unfollow lmao I'm done with you.\"}]}"
    },
    {
        "SubmissionID": "1od0x6u",
        "URL": "https://i.redd.it/6fw3aj45zlwf1.jpeg",
        "Title": "AIO for breaking up with my boyfriend over these deleted texts.",
        "Body": "This is kind of an update to this post:\n\nhttps://www.reddit.com/r/AmIOverreacting/s/2FGF4pADNm\n\nTLDR: I got into an argument with my boyfriend after I went through his phone and found out he was live texting my abortion to his female friend, including sending a photo of my sonogram. \n\nAs we worked our way through that argument, I asked him to ask his friend, whose opinion he clearly values so much, how she would feel if she were essentially in my position. \n\nI asked him to text her “how would you feel if you found out your boyfriend sent your  sonogram to another woman and told her about your abortion”. \n\nI go back and forth between thinking this is a crazy ask and a reasonable request. I believe she is in the wrong for participating in this and not calling him out on sending sonogram photos if she is such a “girls girl”. But I do feel like it’s a bit crazy to ask your boyfriend to send messages. Idk. \n\nBut he agreed to it. So he said. \n\nHe sat there and pretended to send the text. \n\nInstead he sent “hi quick question” and when she responded he reduced our argument to me being mad about him discussing our relationship with her. \n\nI had asked him several times that day what her response was. Each time “she hadn’t responded”. When I asked the next day he said she responded “hey what’s up”, as if she just ignored the whole thing. \n\nPart of me believed him and thought maybe she thought I took his phone and sent that text and maybe waited for a cool down period before responding. \n\nAnother part of me felt like he was lying. I felt the insincerity. I felt like he was hiding something. I swear I even had a vision of him deleting texts. \n\nSo I took his phone a few days later and immediately opened deleted messages and this is what I found. \n\nThe “omg you’re supposed to delete” and the “I guess so” followed by the immediate deletion of the messages. I was sent into a rage. That was it for me. \n\nI swear I’m being gaslit now. He’s telling me that he deleted them because he was embarrassed. Because he was mad at himself for even responding to her after telling me that he was cutting that relationship off. That is such horse shit. You deleted the messages to hide them from me. \n\nI knew I had a bad feeling about this friendship. She gives advice such as “you’re supposed to delete the messages”. What if someone gave her boyfriend that advice? Be so fucking forreal. Always trust your gut instinct, people. \n\nI guess I’m really just looking for validation here. Because a huge part of me wants to stay knowing damn well I need to walk away. \n\n",
        "BestComment": "If he's not choosing you over her now, what makes you think he will choose you if you get married? \n\nYou clearly already don't trust him or you wouldn't have gone through his phone to begin with. Just break up. You cannot have a healthy relationship without trust, and you don't trust him (nor does he deserve it, it seems).",
        "Topic": "Manipulation and Control",
    "Background": "Speaker A tells a friend that his girlfriend is mad about their messages, and Speaker B advises him that he is \"supposed to delete\" them, normalizing secrecy and hiding conversations from his partner.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey I have a question!\"}, {\"speaker\": \"Speaker B\", \"text\": \"Hi! you good?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Good now, I guess she went on my phone and somehow fell upon our messages and got mad that I tell you things about our relationship\"}, {\"speaker\": \"Speaker B\", \"text\": \"omg you're supposed to delete!!\"}, {\"speaker\": \"Speaker A\", \"text\": \"I guess so\"}]}"
    },
    {
        "SubmissionID": "1jp9o0s",
        "URL": "https://i.redd.it/5e7ebxui1bse1.jpeg",
        "Title": "AIO in thinking my gf is trying to end things?",
        "Body": "My (41m) gf (37f) and I have been dating for a little over a year. We’ve had our ups and downs, but we’re in a good place right now. We live together and the other night she said she needed space to get her life together and she thought I needed the same. She said we weren’t breaking up, but it feels like that’s the direction she wants to go in. This morning she texted me this after she left for work. It reads like correspondence from a landlord or something and my RSD is going crazy. Looking for some clarity. ",
        "BestComment": "Yes, she's breaking up with you.  She just realizes you'll have to live together for the next month and so she's trying to keep it cordial in the meantime.  Go find that new place and leave with your head held high.",
         "Topic": "Boundary Issues",
    "Background": "Speaker A sends a formal, landlord-style text giving Speaker B a move-out deadline and clarifying they will not ask for financial help while he is still living there.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Hey, just to recap our conversation from yesterday morning. You have until April 30th-May 3rd to move into your new place. I won't be asking for any financial assistance from you while you are here from April 1st to May 3rd so that you may have enough funds to move and also establish your mail from your address on to another location. Thank you\"}, {\"speaker\": \"Speaker B\", \"text\": \"You're welcome?\"}]}"
    },
    {
        "SubmissionID": "1jt9uss",
        "URL": "https://www.reddit.com/gallery/1jt9uss",
        "Title": "Am I being a bitch? I’m pregnant and feel like I’m being mean and overdramatic",
        "Body": "The conversation from the first text happened after I my 32 year old boyfriend  to buy the dog’s dog food after he asked what I needed from the store. \n\nThe video he sent me was a video of a man raping a dog saying that that’s my dad. My dad’s never raped a dog. ",
        "BestComment": "You're going to raise your kid in a household full of anger and bitterness if you don't break up with this guy",
        "Topic": "Emotional Abuse",
    "Background": "Speaker B responds to Speaker A’s complaints and low mood with hostility, insults, and repeated statements that they don’t want to see or be around Speaker A.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I have a headache\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't want to see you here right now\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm tired of eating junk food\"}, {\"speaker\": \"Speaker B\", \"text\": \"Where are you? I'm not asking you to come in just because I need to shower\"}, {\"speaker\": \"Speaker B\", \"text\": \"Spaghetti\"}, {\"speaker\": \"Speaker A\", \"text\": \"Depressed\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm tired of everything\"}, {\"speaker\": \"Speaker A\", \"text\": \"Okay, I'll make spaghetti\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't think I'll be able to eat that even though I want that\"}, {\"speaker\": \"Speaker B\", \"text\": \"Burgers?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Buy them\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm going to make a tostino\"}, {\"speaker\": \"Speaker B\", \"text\": \"Okay why ask me then\"}, {\"speaker\": \"Speaker B\", \"text\": \"Bye\"}, {\"speaker\": \"Speaker A\", \"text\": \"Indian man finds romance with Fido while his H-18 processor\"}, {\"speaker\": \"Speaker A\", \"text\": \"Your dad\"}, {\"speaker\": \"Speaker B\", \"text\": \"Watch the video\"}, {\"speaker\": \"Speaker B\", \"text\": \"Can't you go to your moms for a bit?\"}, {\"speaker\": \"Speaker A\", \"text\": \"You're not coming here right now\"}, {\"speaker\": \"Speaker B\", \"text\": \"Yes\"}, {\"speaker\": \"Speaker B\", \"text\": \"You're just a shit taller always obnoxious talking about my dad and this and that\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't want to see you here\"}, {\"speaker\": \"Speaker B\", \"text\": \"You can but stay away from me\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't want to be around you\"}, {\"speaker\": \"Speaker A\", \"text\": \"Idk so I can't go over or what?\"}, {\"speaker\": \"Speaker A\", \"text\": \"Idk okay\"}]}"
    },
    {
        "SubmissionID": "1jedoo3",
        "URL": "https://www.reddit.com/gallery/1jedoo3",
        "Title": "AIO? made a joke about taking a nap",
        "Body": "context: im (23f) a student (currently on spring break) and i enjoy taking naps. they usually go between 1-2.5 (not 4 like he claims i genuinely dk where he got that number) hrs and it’s because i get exhausted between 2-4pm in the day. idk why, it happens every day and it’s been like that since i was a teenager. i don’t nap every single day, but definitely between 3-5x a week.\n\nmy boyfriend (28m) has tried to encourage me to take shorter naps because he thinks it’ll help with my sleep schedule. he takes daily naps on his lunch breaks (1 hr absolute max, usually 15-45 min) and he says how energizing they are. i believe him, and i’m glad they work for him, however i haven’t had much success with short naps so i don’t take them.\n\nmy sleep schedule has been kinda shit bc of spring break rn and im trying to fix it. i’m usually in bed by 11-12 most nights and up around 8-9. he works a 7-5 so he sleeps at 10 and wakes up at 6. today he sent me this text and i thought it would be funny to make a sarcastic joke because hes always lecturing me about how my naps keep me up at night, then he followed it up with this. idek where to begin with this, i think its weird as fuck and the “we are not on the same level” is just ??? aio?",
        "BestComment": "\"we are not on the same level.\" Nice. Solid bit of disrespect there.",
         "Topic": "Emotional Abuse",
    "Background": "Speaker A tells Speaker B that one reason for her poor perception is that she keeps putting them on the same level when they are \"not the same,\" asserting superiority and belittling her.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I get that you were joking but honestly one of the reasons you have such a poor perception of me is because you keep placing us on the same level when we're just not.\"}, {\"speaker\": \"Speaker A\", \"text\": \"We are not the same.\"}]}"
    },
    {
        "SubmissionID": "1mbjwev",
        "URL": "https://www.reddit.com/gallery/1mbjwev",
        "Title": "AIO: My Friend thinks I’m bashing her Hulk Hogan grief(Update)",
        "Body": "She’s calling the police on me. I told my used to be friend about the post and this was her response. \n\nYes the same post where she’s asking me, a black person to grieve a racist. I can’t give up space to grieve a racist when she knows I’m grieving my grandpa who I buried last week. \n\nThat’s like asking a child to mourn a pedo or an abuse victim to mourn their abuser. On top of that asking for the space I’m already grieving for a loved one. Yes she knows about my grandpa’s death & my aunt being sent to the hospital w/aneurysms. \n\n I’m posting this as an update to how it all ended. Safe to say she’s no longer my friend. She will probably see this update since she has my account but idc. It’s my emotions & im allowed to vent just how you’re entitled to your feelings.\n\n",
        "BestComment": "lol at her calling the police for “talking about you”\n\nGirl, the police have much more to deal with than your petty drama and emotional distress over someone you don’t know",
        "Topic": "Emotional Abuse",
    "Background": "Speaker A reacts to a post by hurling insults, calling Speaker B a horrid piece of shit and cunt, and threatening to press charges if the post is not deleted.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"get fucked\"}, {\"speaker\": \"Speaker B\", \"text\": \"Not clicking on that\"}, {\"speaker\": \"Speaker A\", \"text\": \"you horrid piece of shit.\"}, {\"speaker\": \"Speaker A\", \"text\": \"delete the post or I'm pressing charges\"}, {\"speaker\": \"Speaker A\", \"text\": \"you've admitted you posted it about me\"}, {\"speaker\": \"Speaker A\", \"text\": \"delete the post or I'm pressing charges\"}, {\"speaker\": \"Speaker A\", \"text\": \"Horrid cunt\"}, {\"speaker\": \"Speaker B\", \"text\": \"It is about you\"}, {\"speaker\": \"Speaker B\", \"text\": \"I've screen recorded everything and blocking you indefinitely.\"}, {\"speaker\": \"Speaker B\", \"text\": \"Please do\"}, {\"speaker\": \"Speaker A\", \"text\": \"Horrid cunt\"}, {\"speaker\": \"Speaker B\", \"text\": \"it's about you\"}, {\"speaker\": \"Speaker A\", \"text\": \"You are a vile human being\"}, {\"speaker\": \"Speaker B\", \"text\": \"I've screen recorded everything and blocking you indefinitely.\"}]}"
    },
    {
        "SubmissionID": "1kqv68q",
        "URL": "https://www.reddit.com/gallery/1kqv68q",
        "Title": "Aio told my bf his joke wasn’t original and he’s pissed.",
        "Body": "I 19(F) and bf (20m) were sitting in the car smoking. My bf drew a dick  on the window, he looked at me and I said “original” he shut down emotionally and I said I’m Sorry. but he  turned off end car and went inside. We went our separate ways inside but I texted him now and he’s still rlly mad. I understand it was his first day back at a new job so he’s tired. But is it really  that big of a deal. He turned off his read receipts and went to bed ",
        "BestComment": "he's upset over a cock and balls he drew on a window bc you said \"original\" 😭😭 my goodness me, where are you all finding these people?! \n\n  \nbut, he could be on edge, starting a new job can be really anxiety inducing, maybe just give him some time to think and some space. he might calm down after some time to himself.",
        "Topic": "Emotional Abuse",
    "Background": "After Speaker B lightly teases his joke as unoriginal and apologizes, Speaker A stays resentful, says he can’t stop thinking about it, and frames the comment as an attack on his sense of humor.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"I just thought it was funny. I was trying to make a joke after my first day back at work and I'm met with the bitchiest response imaginable.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I understand that you had your big first day and I'm not trying to undermine that\"}, {\"speaker\": \"Speaker B\", \"text\": \"But I said I was sorry and it feels like you're still holding a grudge towards me for it\"}, {\"speaker\": \"Speaker B\", \"text\": \"I didn't think it was a big issue but I'm sorry if I choose the wrong words\"}, {\"speaker\": \"Speaker A\", \"text\": \"Lol first time you've acknowledged it all day\"}, {\"speaker\": \"Speaker A\", \"text\": \"Thanks for saying sorry but it's sorta one of those things I can't stop thinking about\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't feel like it's a terrible thing to say\"}, {\"speaker\": \"Speaker B\", \"text\": \"It's light teasing\"}, {\"speaker\": \"Speaker B\", \"text\": \"And I won't do that again and I know now not to do that again\"}, {\"speaker\": \"Speaker B\", \"text\": \"It's light teasing\"}, {\"speaker\": \"Speaker B\", \"text\": \"And I won't do that again and I know now not to do that again\"}, {\"speaker\": \"Speaker A\", \"text\": \"Light teasing and its making fun of my sense of humor. Yeah ok\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm really tired after my Big Day, at this point I'm just going to bed\"}, {\"speaker\": \"Speaker B\", \"text\": \"Fine let's talk about it tomorrow\"}, {\"speaker\": \"Speaker B\", \"text\": \"But I still think that you need to consider that I didn't mean any harm and didn't think that would be upsetting\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm really tired after my Big Day, at this point I'm just going to bed\"}]}"
    },
    {
        "SubmissionID": "1npuqd7",
        "URL": "https://www.reddit.com/gallery/1npuqd7",
        "Title": "AIO for being rude and indifferent towards my ex who texted me? I can’t help but feel horrible.",
        "Body": "For context, this is about my ex-boyfriend. We broke up at the beginning of August and were together for 4 yrs. At first, things were good, but over time, I found out he cheated with my FRIEND, lied to me constantly, and said many hurtful things. He was emotionally closed off, never fully let me in, and didn't put in nearly as much effort as I did. I often felt unseen and like I had to constantly prove my worth. Safe to say, I loved him a lot. And at many times it felt like he took advantage of my forgiveness and kindness.\n\nDuring the breakup, we saw each other again two weeks after and I felt like I was practically begging him to give us another chance trying to convince him that I was enough, that we had something special. But he made it clear that he didn't want that. He even said I loved him more than he loved me, which really put things into perspective for me. I respected that and told him that if I stepped away, I wasn't coming back.\n\nAbout a week later, he texted me again, essentially repeating the same thing he had already said. I reflected during that week and realized I felt the same way he wasn't what I wanted, and he wasn't worth my time. I had been doing too much for someone who didn't care as much as I did. Therefore, I didn't care to change his mind anymore.\n\n\nThree weeks later (text messages shown), he sent me another message, and I responded firmly.\nI feel a little bad about it and worry I might have been too harsh, but honestly, l'm indifferent about him now. I don't care about his guilt or his attempts to tell me my worth because I already know it. It seems like he's just trying to clean his conscience and honestly it took me back be he's very avoidant about things like this.\n\nI feel like I took it too far and overreacted, usually I’d be more understanding and even afterwards I felt bad bc im not usually this way. I just want to know if I overreacted or if it was the right / correct reaction🫩",
        "BestComment": "Honestly, you weren’t harsh at all and I probably would have not responded after he continuously kept saying he was doing it to clear his conscious if that was me so kudos to you for keeping it cool. He was doing it only for himself and not for you.",
        "Topic": "Manipulation and Control",
    "Background": "Speaker A reaches out to apologize mainly for his own peace of mind, while Speaker B points out that he is clearing his conscience rather than truly considering her feelings or change.",
        "Transcription": "{\"messages\": [{\"speaker\": \"Speaker A\", \"text\": \"Um... I might regret sending this lol\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm sorry for not responding earlier.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I wanted to say something but didn't want to hold you back because I didn't want to hold you back.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'd like to say developing into some kind of different 'man' and viewing things a lot more different.\"}, {\"speaker\": \"Speaker B\", \"text\": \"What made you think I wanted an apology after all this time?\"}, {\"speaker\": \"Speaker A\", \"text\": \"I'm sure you didn't, like I said I did to give myself the peace of mind.\"}, {\"speaker\": \"Speaker B\", \"text\": \"If this is about clearing your conscience, it only shows you haven't changed.\"}, {\"speaker\": \"Speaker A\", \"text\": \"That makes sense. I did want to pretty much show you I acknowledge and analyzed the fact that I did do you wrong.\"}, {\"speaker\": \"Speaker B\", \"text\": \"You want me to forgive you or something\"}, {\"speaker\": \"Speaker A\", \"text\": \"I guess it was something I wanted to be known and not really looking for anything in return.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't want to be a bitch about it, but there's no other way to say it.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't have significance in my life anymore for me to care what you say.\"}, {\"speaker\": \"Speaker B\", \"text\": \"I don't need you telling me about my value I know it, and others do too.\"}, {\"speaker\": \"Speaker B\", \"text\": \"This was for your peace of mind, it only proves you're still selfish and self-absorbed, and you haven't changed like you say.\"}, {\"speaker\": \"Speaker A\", \"text\": \"I got it, sorry.\"}]}"
    }
]